Repository: quarkusio/pt.quarkus.io
Catalog: l10n/po/*/_versions/main/guides/amqp-dev-services.adoc.po
Languages: pt_br

source: Dev Services for AMQP
pt_br: Dev Services para AMQP

source: Dev Services for AMQP automatically starts an AMQP 1.0 broker in dev mode and when running tests. So, you don't have to start a broker manually. The application is configured automatically.
pt_br: O Dev Services for AMQP inicia automaticamente um broker AMQP 1.0 no modo de desenvolvimento e ao executar testes. Portanto, você não precisa iniciar um broker manualmente. A aplicação é configurada automaticamente.

source: Enabling / Disabling Dev Services for AMQP
pt_br: Ativação/desativação do Dev Services para AMQP

source: Dev Services for AMQP is automatically enabled unless:
pt_br: O Dev Services para AMQP é ativado automaticamente, a menos que:

source: `quarkus.amqp.devservices.enabled` is set to `false`
pt_br: `quarkus.amqp.devservices.enabled` é definido como `false`

source: the `amqp-host` or `amqp-port` is configured
pt_br: o `amqp-host` ou `amqp-port` esteja configurado

source: all the Reactive Messaging AMQP channels have the `host` or `port` attributes set
pt_br: todos os canais AMQP de mensagens reativas tenham os atributos `host` ou `port` definidos

source: Dev Services for AMQP relies on Docker to start the broker. If your environment does not support Docker, you will need to start the broker manually, or connect to an already running broker. You can configure the broker access using the `amqp-host`, `amqp-port`, `amqp-user` and `amqp-password` properties.
pt_br: O Dev Services para AMQP conta com o Docker para iniciar o agente. Se o seu ambiente não for compatível com o Docker, você precisará iniciar o agente manualmente ou conectar-se a um agente já em execução. Você pode configurar o acesso ao agente usando as propriedades `amqp-host` , `amqp-port` , `amqp-user` e `amqp-password` .

source: Shared broker
pt_br: broker compartilhado

source: Most of the time you need to share the broker between applications. Dev Services for AMQP implements a _service discovery_ mechanism for your multiple Quarkus applications running in _dev_ mode to share a single broker.
pt_br: Na maioria das vezes, você precisa compartilhar o broker entre os aplicativos. O Dev Services for AMQP implementa um mecanismo de _descoberta de serviços_ para que as várias aplicações Quarkus em execução no modo de _desenvolvimento_ compartilhem um único broker.

source: Dev Services for AMQP starts the container with the `quarkus-dev-service-amqp` label which is used to identify the container.
pt_br: Dev Services para AMQP inicia o container com a etiqueta `quarkus-dev-service-amqp` que é utilizada para identificar o container.

source: If you need multiple (shared) brokers, you can configure the `quarkus.amqp.devservices.service-name` attribute and indicate the broker name. It looks for a container with the same value, or starts a new one if none can be found. The default service name is `amqp`.
pt_br: Se precisar de vários brokers (compartilhados), você pode configurar o atributo `quarkus.amqp.devservices.service-name` e indicar o nome do broker. Ele procura um contêiner com o mesmo valor ou inicia um novo se nenhum for encontrado. O nome do serviço padrão é `amqp` .

source: Sharing is enabled by default in dev mode, but disabled in test mode. You can disable the sharing with `quarkus.amqp.devservices.shared=false`.
pt_br: O compartilhamento é ativado por padrão no modo de desenvolvimento, mas desativado no modo de teste. Você pode desativar o compartilhamento com `quarkus.amqp.devservices.shared=false` .

source: Setting the port
pt_br: Definindo a porta

source: By default, Dev Services for AMQP picks a random port and configures the application. You can set the port by configuring the `quarkus.amqp.devservices.port` property.
pt_br: Por padrão, o Dev Services for AMQP escolhe uma porta aleatória e configura a aplicação. Você pode definir a porta configurando a propriedade `quarkus.amqp.devservices.port` .

source: Configuring the image
pt_br: Configurando a imagem

source: Dev Services for AMQP uses https://quay.io/repository/artemiscloud/activemq-artemis-broker[activemq-artemis-broker] images. You can configure the image and version using the `quarkus.amqp.devservices.image-name` property:
pt_br: Os serviços de desenvolvimento para AMQP usam imagens https://quay.io/repository/artemiscloud/activemq-artemis-broker[activemq-artemis-broker] . Você pode configurar a imagem e a versão usando a propriedade `quarkus.amqp.devservices.image-name` :

source: The configured image must be _compatible_ with the `activemq-artemis-broker` one. The container is launched with the `AMQ_USER`, `AMQ_PASSWORD` and `AMQ_EXTRA_ARGS` environment variables. The ports 5672 and 8161 (web console) are exposed.
pt_br: A imagem configurada deve ser _compatível_ com a imagem `activemq-artemis-broker` . O contêiner é iniciado com as variáveis de ambiente `AMQ_USER` , `AMQ_PASSWORD` e `AMQ_EXTRA_ARGS` . As portas 5672 e 8161 (console da Web) são expostas.
