Repository: quarkusio/pt.quarkus.io
Catalog: l10n/po/*/_versions/main/guides/dev-services.adoc.po
Languages: pt_br

source: Dev Services Overview
pt_br: Visão Geral dos Dev Services

source: Quarkus supports the automatic provisioning of unconfigured services in development and test mode. We refer to this capability as Dev Services. From a developer's perspective this means that if you include an extension and don't configure it then Quarkus will automatically start the relevant service (usually using https://www.testcontainers.org/[Testcontainers] behind the scenes) and wire up your application to use this service.
pt_br: O Quarkus oferece suporte ao provisionamento automático de serviços não configurados no modo de desenvolvimento e teste. Referimo-nos a esse recurso como Dev Services. Do ponto de vista do desenvolvedor, isso significa que, se você incluir uma extensão e não a configurar, o Quarkus iniciará automaticamente o serviço relevante (geralmente usando https://www.testcontainers.org/[Testcontainers] nos bastidores) e conectará sua aplicação para usar esse serviço.

source: All this functionality is part of the Quarkus `deployment` modules, so does not affect the production application in any way. If you want to disable all Dev Services you can use the `quarkus.devservices.enabled=false` config property, although in most cases this is not necessary as simply configuring the service will result in the Dev Service being disabled automatically.
pt_br: Toda essa funcionalidade faz parte dos módulos do `deployment` do Quarkus e, portanto, não afeta a aplicação de produção de forma alguma. Se quiser desativar todos os Dev Services, você pode usar a propriedade de configuração `quarkus.devservices.enabled=false`, embora na maioria dos casos isso não seja necessário, pois a simples configuração do serviço fará com que o Dev Service seja desativado automaticamente.

source: Note that the default startup timeout is 60s, if this is not enough you can increase it with the `quarkus.devservices.timeout` property.
pt_br: Note que o tempo limite de arranque predefinido é de 60s, se não for suficiente, pode aumentá-lo com a propriedade `quarkus.devservices.timeout`.

source: This page lists all the Dev Services that Quarkus supports.
pt_br: Esta página lista todos os Dev Services que o Quarkus suporta.

source: In order to use Dev Services you will generally need a working Docker environment (remote environments are supported). If you don't have Docker installed you will need to configure your services normally.
pt_br: Para usar os Dev Services, você geralmente precisa de um ambiente Docker em funcionamento (há suporte para ambientes remotos). Se você não tiver o Docker instalado, precisará configurar seus serviços normalmente.

source: The AMQP Dev Service will be enabled when the `quarkus-smallrye-reactive-messaging-amqp` extension is present in your application, and the broker address has not been explicitly configured. More information can be found in the xref:amqp-dev-services.adoc[AMQP Dev Services Guide].
pt_br: O Dev Service AMQP será ativado quando a extensão `quarkus-smallrye-reactive-messaging-amqp` estiver presente em sua aplicação e o endereço do broker não tiver sido configurado explicitamente. Mais informações podem ser encontradas no xref:amqp-dev-services.adoc[Guia do Dev Services do AMQP].

source: The Apicurio Dev Service will be enabled when the `quarkus-apicurio-registry-avro` extension is present in your application, and it's address has not been explicitly configured. More information can be found in the xref:apicurio-registry-dev-services.adoc[Apicurio Registry Dev Services Guide].
pt_br: O Dev Service Apicurio será ativado quando a extensão `quarkus-apicurio-registry-avro` estiver presente em sua aplicação e seu endereço não tiver sido configurado explicitamente. Mais informações podem ser encontradas no xref:apicurio-registry-dev-services.adoc[Guia do Dev Services do Apicurio Registry] .

source: Databases
pt_br: Bases de Dados

source: The database Dev Services will be enabled when a reactive or JDBC datasource extension is present in the application, and the database URL has not been configured. More information can be found in the xref:databases-dev-services.adoc[Databases Dev Services Guide].
pt_br: Os Dev Services de banco de dados serão ativados quando uma extensão de fonte de dados reativa ou JDBC estiver presente na aplicação e o URL do banco de dados não tiver sido configurado. Mais informações podem ser encontradas no xref:databases-dev-services.adoc[Guia de Dev Services de Bancos de Dados] .

source: Quarkus provides Dev Services for all databases it supports. Most of these are run in a container, except H2 and Derby which are run in-process. Dev Services are supported for both JDBC and reactive drivers.
pt_br: O Quarkus fornece Dev Services para todos os bancos de dados compatíveis. A maioria deles é executada em um contêiner, exceto o H2 e o Derby, que são executados no processo. Os Dev Services são compatíveis com drivers JDBC e reativos.

source: Those relational databases that are running in a container are started using Testcontainers and support "reusable instances"; this implies that if you add the property `testcontainers.reuse.enable=true` in your Testcontainers configuration file, a property file named `.testcontainers.properties` in your user home, then the databases will not be stopped aggressively after each run, and can be reused.
pt_br: Esses bancos de dados relacionais que estão sendo executados em um contêiner são iniciados usando Testcontainers e suportam "instâncias reutilizáveis"; isso significa que, se você adicionar a propriedade `testcontainers.reuse.enable=true` no arquivo de configuração do Testcontainers, um arquivo de propriedade chamado `.testcontainers.properties` na home do usuário, os bancos de dados não serão interrompidos de forma agressiva após cada execução e poderão ser reutilizados.

source: N.B. if you opt in for this feature, Quarkus will not reset the state of the database between runs unless you explicitly configure it to.
pt_br: Nota: se optar por esta funcionalidade, o Quarkus não reiniciará o estado da base de dados entre execuções, a menos que o configure explicitamente.

source: The Kafka Dev Service will be enabled when the `quarkus-kafka-client` extension is present in your application, and the broker address has not been explicitly configured. More information can be found in the xref:kafka-dev-services.adoc[Kafka Dev Services Guide].
pt_br: O Dev Service Kafka será ativado quando a extensão `quarkus-kafka-client` estiver presente em sua aplicação e o endereço do broker não tiver sido configurado explicitamente. Mais informações podem ser encontradas no xref:kafka-dev-services.adoc[Guia do Dev Services do Kafka] .

source: The Keycloak Dev Service will be enabled when the `quarkus-oidc` extension is present in your application, and the server address has not been explicitly configured. More information can be found in the xref:security-openid-connect-dev-services.adoc[OIDC Dev Services Guide].
pt_br: O Dev Service Keycloak será ativado quando a extensão `quarkus-oidc` estiver presente em sua aplicação e o endereço do servidor não tiver sido configurado explicitamente. Mais informações podem ser encontradas no xref:security-openid-connect-dev-services.adoc[Guia do Dev Services do OIDC] .

source: The Kubernetes Dev Service will be enabled when `kubernetes-client` extension is present in your application, and the API server address has not been explicitly configured. More information can be found in the xref:kubernetes-dev-services.adoc[Kubernetes Dev Services Guide].
pt_br: O Dev Service Kubernetes será ativado quando a extensão `kubernetes-client` estiver presente em sua aplicação e o endereço do servidor da API não tiver sido configurado explicitamente. Mais informações podem ser encontradas no xref:kubernetes-dev-services.adoc[Guia do Dev Services do Kubernetes] .

source: The MongoDB Dev Service will be enabled when the `quarkus-mongodb-client` extension is present in your application, and the server address has not been explicitly configured. More information can be found in the xref:mongodb.adoc#dev-services[MongoDB Guide].
pt_br: O Dev Service MongoDB será ativado quando a extensão `quarkus-mongodb-client` estiver presente em sua aplicação e o endereço do servidor não tiver sido configurado explicitamente. Mais informações podem ser encontradas no xref:mongodb.adoc#dev-services[Guia do MongoDB] .

source: The RabbitMQ Dev Service will be enabled when the `quarkus-smallrye-reactive-messaging-rabbitmq` extension is present in your application, and the broker address has not been explicitly configured. More information can be found in the xref:rabbitmq-dev-services.adoc[RabbitMQ Dev Services Guide].
pt_br: O Dev Service RabbitMQ será ativado quando a extensão `quarkus-smallrye-reactive-messaging-rabbitmq` estiver presente em sua aplicação e o endereço do broker não tiver sido configurado explicitamente. Mais informações podem ser encontradas no xref:rabbitmq-dev-services.adoc[Guia do Dev Services do RabbitMQ].

source: The Redis Dev Service will be enabled when the `quarkus-redis-client` extension is present in your application, and the server address has not been explicitly configured. More information can be found in the xref:redis-dev-services.adoc[Redis Dev Services Guide].
pt_br: O Dev Service Redis será ativado quando a extensão `quarkus-redis-client` estiver presente em sua aplicação e o endereço do servidor não tiver sido configurado explicitamente. Mais informações podem ser encontradas no xref:redis-dev-services.adoc[Guia do Dev Service do Redis] .

source: The Vault Dev Service will be enabled when the `quarkus-vault` extension is present in your application, and the server address has not been explicitly configured. More information can be found in the link:{vault-guide}#dev-services[Vault Guide].
pt_br: O Dev Service Vault será ativado quando a extensão `quarkus-vault` estiver presente em sua aplicação e o endereço do servidor não tiver sido configurado explicitamente. Mais informações podem ser encontradas no link:{vault-guide}#dev-services[Guia do Vault] .

source: The Neo4j Dev Service will be enabled when the `quarkus-neo4j` extension is present in your application, and the server address has not been explicitly configured. More information can be found in the link:{neo4j-guide}#dev-services[Neo4j Guide].
pt_br: O Dev Service Neo4j será ativado quando a extensão `quarkus-neo4j` estiver presente em sua aplicação e o endereço do servidor não tiver sido configurado explicitamente. Mais informações podem ser encontradas no link:{neo4j-guide}#dev-services[Guia do Neo4j] .

source: The Infinispan Dev Service will be enabled when the `quarkus-infinispan-client` extension is present in your application, and the server address has not been explicitly configured. More information can be found in the xref:infinispan-dev-services.adoc[Infinispan Dev Services Guide].
pt_br: O Dev Service Infinispan será ativado quando a extensão `quarkus-infinispan-client` estiver presente em sua aplicação e o endereço do servidor não tiver sido configurado explicitamente. Mais informações podem ser encontradas no xref:infinispan-dev-services.adoc[Guia do Dev Services do Infinispan] .

source: The Elasticsearch Dev Service will be enabled when one of the Elasticsearch based extensions (Elasticsearch client or Hibernate Search ORM Elasticsearch) is present in your application, and the server address has not been explicitly configured. More information can be found in the xref:elasticsearch-dev-services.adoc[Elasticsearch Dev Services Guide].
pt_br: O Dev Service Elasticsearch será ativado quando uma das extensões baseadas no Elasticsearch (cliente Elasticsearch ou Hibernate Search ORM Elasticsearch) estiver presente em sua aplicação e o endereço do servidor não tiver sido configurado explicitamente. Mais informações podem ser encontradas no xref:elasticsearch-dev-services.adoc[Guia do Dev Services do Elasticsearch] .
