Repository: quarkusio/pt.quarkus.io
Catalog: l10n/po/*/_versions/main/guides/flyway.adoc.po
Languages: pt_br

source: Using Flyway
pt_br: Usando o Flyway

source: https://flywaydb.org/[Flyway] is a popular database migration tool that is commonly used in JVM environments.
pt_br: https://flywaydb.org/[Flyway] é uma ferramenta popular de migração de banco de dados que é comumente usada em ambientes JVM.

source: Quarkus provides first class support for using Flyway as will be explained in this guide.
pt_br: O Quarkus oferece suporte de primeira classe para o uso do Flyway, como será explicado neste guia.

source: Setting up support for Flyway
pt_br: Configurando o suporte para o Flyway

source: As shown in the <<developing-with-flyway>> section, to start using Flyway with your project, you just need to:
pt_br: Conforme mostrado na seção <<developing-with-flyway>> , para começar a usar o Flyway com seu projeto, você só precisa:

source: add your migrations to the `{migrations-path}` folder as you usually do with Flyway
pt_br: adicione suas migrações à pasta `{migrations-path}` como o você normalmente faz com o Flyway

source: activate the `migrate-at-start` option to migrate the schema automatically or inject the `Flyway` object and run your migration as you normally do
pt_br: ative a opção `migrate-at-start` para migrar o esquema automaticamente ou injete o objeto `Flyway` e execute sua migração como você normalmente faz

source: In your build file, add the following dependencies:
pt_br: Em seu arquivo de _build_, adicione as seguintes dependências:

source: the Flyway extension
pt_br: a extensão Flyway

source: your JDBC driver extension (`quarkus-jdbc-postgresql`, `quarkus-jdbc-h2`, `quarkus-jdbc-mariadb`, ...)
pt_br: sua extensão de driver JDBC ( `quarkus-jdbc-postgresql` , `quarkus-jdbc-h2` , `quarkus-jdbc-mariadb` , ...)

source: Flyway support relies on the Quarkus datasource config. It can be customized for the default datasource as well as for every <<multiple-datasources,named datasource>>. First, you need to add the datasource config to the `{config-file}` file in order to allow Flyway to manage the schema. Also, you can customize the Flyway behaviour by using the following properties:
pt_br: O suporte ao Flyway depende da configuração do _datasource_ do Quarkus. Ela pode ser personalizada para o _datasource_ padrão, bem como para cada <<multiple-datasources,named datasource>>. Primeiro, você precisa adicionar a configuração do _datasource_ ao arquivo `{config-file}` para permitir que o Flyway gerencie o esquema. Além disso, você pode personalizar o comportamento do Flyway usando as seguintes propriedades:

source: <span class="icon"><i class="fa fa-lock" title="Fixed at build time"></i></span> Configuration property fixed at build time - All other configuration properties are overridable at runtime <input type="search" id="config-search-0" placeholder="FILTER CONFIGURATION" disabled>
pt_br: <span class="icon"><i class="fa fa-lock" title="Fixed at build time"></i></span> Propriedade de Configuração Fixa no Momento da Compilação - Todas as outras propriedades de configuração podem ser sobrepostas em tempo de execução. <input type="search" id="config-search-0" placeholder="FILTER CONFIGURATION" disabled>

source: Developing with Flyway
pt_br: Desenvolvendo com o Flyway

source: The following is an example for the `{config-file}` file:
pt_br: A seguir, um exemplo do arquivo `{config-file}` :

source: Add a SQL migration to the default folder following the Flyway naming conventions: `{migrations-path}/V1.0.0__Quarkus.sql`
pt_br: Adicione uma migração SQL à pasta padrão seguindo as convenções de nomenclatura do Flyway: `{migrations-path}/V1.0.0__Quarkus.sql`

source: Now you can start your application and Quarkus will run the Flyway's migrate method according to your config.
pt_br: Agora, você pode iniciar sua aplicação e o Quarkus executará o método de migração do Flyway de acordo com sua configuração.

source: With `quarkus.flyway.migrate-at-start=true`, as in the example above, Quarkus will execute the Flyway migration as part of the xref:lifecycle.adoc[application startup].
pt_br: Com `quarkus.flyway.migrate-at-start=true` , como no exemplo acima, o Quarkus executará a migração do Flyway como parte da xref:lifecycle.adoc[inicialização do aplicativo] .

source: Inject the Flyway object if you want to use it directly
pt_br: Injete o objeto Flyway se quiser usá-lo diretamente

source: In dev mode Quarkus will automatically restart the application if any of the existing migration scripts get modified. If you want to take advantage of this while developing and testing new migration scripts, you will want to set `%dev.quarkus.flyway.clean-at-start=true`, so that Flyway actually runs the modified migration.
pt_br: No modo de desenvolvimento, o Quarkus reiniciará automaticamente o aplicativo se algum dos scripts de migração existentes for modificado. Se quiser tirar proveito disso ao desenvolver e testar novos scripts de migração, você deverá definir `%dev.quarkus.flyway.clean-at-start=true` , para que o Flyway realmente execute a migração modificada.

source: Repairing the Flyway schema history table
pt_br: Reparando a tabela de histórico do esquema Flyway

source: There are different scenarios which may require _repairing_ the Flyway schema history table. One such scenario is when a migration fails in a database which doesn't support transactional DDL statements.
pt_br: Há diferentes cenários que podem exigir o _reparo_ da tabela de histórico do esquema do Flyway. Um desses cenários é quando uma migração falha em um banco de dados que não oferece suporte a instruções DDL transacionais.

source: In such situations the link:https://flywaydb.org/documentation/command/repair[Flyway repair command] comes in handy. In Quarkus this can either be executed automatically before the migration by setting `quarkus.flyway.repair-at-start=true` or manually by injecting the `Flyway` object and calling `Flyway#repair()`.
pt_br: Nessas situações, o link:https://flywaydb.org/documentation/command/repair[Comando de reparo do Flyway] é útil. No Quarkus, ele pode ser executado automaticamente antes da migração, definindo `quarkus.flyway.repair-at-start=true` , ou manualmente, injetando o objeto `Flyway` e chamando `Flyway#repair()` .

source: Multiple datasources
pt_br: _Datasources_ Múltiplos

source: Flyway can be configured for multiple datasources. The Flyway properties are prefixed exactly the same way as the named datasources, for example:
pt_br: O Flyway pode ser configurado para vários _datasources_. As propriedades do Flyway são prefixadas exatamente da mesma forma que os _datasources_ nomeados, por exemplo:

source: Notice there's an extra bit in the key. The syntax is as follows: `quarkus.flyway.[optional name.][datasource property]`.
pt_br: Observe que há um _bit_ extra na chave. A sintaxe é a seguinte: `quarkus.flyway.[optional name.][datasource property]` .

source: Without configuration, Flyway is set up for every datasource using the default settings.
pt_br: Sem configuração, o Flyway é configurado para cada _datasource _ usando as configurações padrão.

source: Customizing Flyway
pt_br: Customizando o Flyway

source: In cases where Flyway needs to be configured in addition to the configuration options that Quarkus provides, the `io.quarkus.flyway.FlywayConfigurationCustomizer` class comes in handy.
pt_br: Nos casos em que o Flyway precisa ser configurado além das opções de configuração fornecidas pelo Quarkus, a classe `io.quarkus.flyway.FlywayConfigurationCustomizer` é útil.

source: To customize Flyway for the default datasource, simply add a bean like so:
pt_br: Para personalizar o Flyway para o _datasource_ padrão, basta adicionar um _bean_ da seguinte forma:

source: When named datasources are used, the `@FlywayDataSource` annotation can be used to specify the datasource to which the customizer applies. For example, if there are multiple datasources one of which is called `users` and customization of Flyway is needed for only that datasource, then the following code can be used:
pt_br: Quando são usados _datasources _ nomeados, a anotação `@FlywayDataSource` pode ser usada para especificar o _datasource _ ao qual o customizador se aplica. Por exemplo, se houver vários _datasources_, um dos quais se chama `users` , e a customização do Flyway for necessária apenas para esse _datasource _, então o seguinte código poderá ser usado:

source: Using the Flyway object
pt_br: Usando o objeto Flyway

source: In case you are interested in using the `Flyway` object directly, you can inject it as follows:
pt_br: Caso esteja interessado em usar o objeto `Flyway` diretamente, você pode injetá-lo da seguinte forma:

source: Inject Flyway for named datasources using the Quarkus `FlywayDataSource` qualifier
pt_br: Injete o Flyway para _datasources_ nomeados usando o qualificador do Quarkus `FlywayDataSource`

source: Inject Flyway for named datasources
pt_br: Injete o Flyway para _datasources_ nomeados

source: Use the Flyway instance directly
pt_br: Use a instância do Flyway diretamente

source: Flyway and Hibernate ORM
pt_br: Flyway e Hibernate ORM

source: When using Flyway together with Hibernate ORM, you can use the Dev UI to generate the initial schema creation script.
pt_br: Ao usar o Flyway junto com o Hibernate ORM, você pode usar a Dev UI para gerar o script de criação do esquema inicial.

source: You can find more information about this feature in the xref:hibernate-orm.adoc#flyway[Hibernate ORM guide].
pt_br: Você pode encontrar mais informações sobre esse recurso no xref:hibernate-orm.adoc#flyway[Guia Hibernate ORM] .

source: Flyway on Kubernetes
pt_br: Flyway no Kubernetes

source: Sometimes, it's helpful not to execute Flyway initialization on each application startup. One such example is when deploying
pt_br: Às vezes, é útil não executar a inicialização do Flyway em cada inicialização da aplicação. Um exemplo disso é ao implantar

source: on Kubernetes, where it doesn't make sense to execute Flyway on every single replica. Instead it's desirable to execute it once and then start the actual application without Flyway. To support this use case, when generating manifests for Kubernetes the generated manifests contain a Kubernetes initialization `Job` for Flyway. The `Job` performs initialization and the actual `Pod`, will starts once the `Job` is successfully completed.
pt_br: no Kubernetes, onde não faz sentido executar o Flyway em cada réplica. Em vez disso, é desejável executá-lo uma vez e depois iniciar o aplicativo real sem o Flyway. Para dar suporte a esse caso de uso, ao gerar manifestos para o Kubernetes, os manifestos gerados contêm um `Job` de inicialização do Kubernetes para o Flyway. O `Job` executa a inicialização e o `Pod` real será iniciado assim que o `Job` for concluído com êxito.

source: Disabling
pt_br: Desabilitando

source: The feature is enabled by default and can be globally disabled, using:
pt_br: O recurso é habilitado por padrão e pode ser desativado globalmente, usando:

source: or on OpenShift:
pt_br: ou no OpenShift:

source: Using a custom image that controls waiting for the Job
pt_br: Usando uma imagem personalizada que controla a espera pelo _Job_

source: To change the `wait-for` image which by default is `groundnuty/k8s-wait-for:no-root-v1.7` you can use:
pt_br: Para alterar a imagem `wait-for` que, por padrão, é `groundnuty/k8s-wait-for:no-root-v1.7` , você pode usar:

source: **Note**: In this context globally means `for all extensions that support init task externalization`.
pt_br: *Observação* : Neste contexto, globalmente significa `for all extensions that support init task externalization` .
