Repository: quarkusio/pt.quarkus.io
Catalog: l10n/po/*/_versions/main/guides/grpc-service-consumption.adoc.po
Languages: pt_br

source: Consuming a gRPC Service
pt_br: Consumindo um serviço gRPC

source: gRPC clients can be injected in your application code.
pt_br: Os clientes gRPC podem ser injectados no código da sua aplicação.

source: Consuming gRPC services requires the gRPC classes to be generated. Place your `proto` files in `src/main/proto` and run `mvn compile`.
pt_br: Consumir serviços gRPC requer que as classes gRPC sejam geradas. Coloque seus arquivos `proto` em `src/main/proto` e execute `mvn compile` .

source: Stubs and Injection
pt_br: Stubs e Injeção

source: gRPC generation provides several stubs, providing different ways to consume a gRPC service. You can inject:
pt_br: A geração do gRPC fornece vários stubs, oferecendo diferentes maneiras de consumir um serviço gRPC. Você pode injetar:

source: a service interface using the Mutiny API,
pt_br: uma interface de serviço utilizando a API Mutiny,

source: a blocking stub using the gRPC API,
pt_br: um stub bloqueante utilizando a API gRPC,

source: a reactive stub based on Mutiny,
pt_br: um stub reativo baseado no Mutiny,

source: the gRPC `io.grpc.Channel`, that lets you create other types of stubs.
pt_br: o `io.grpc.Channel` do gRPC, que permite criar outros tipos de stubs.

source: A gRPC client injection point must be annotated with the `@GrpcClient` qualifier. This qualifier can be used to specify the name that is used to configure the underlying gRPC client. For example, if you set it to `hello-service`, configuring the host of the service is done using the `quarkus.grpc.clients.**hello-service**.host`.
pt_br: O ponto de injeção do cliente gRPC deve ser anotado com o qualificador `@GrpcClient`. Este qualificador pode ser usado para especificar o nome que é utilizado para configurar o cliente gRPC subjacente. Por exemplo, se você defini-lo como `hello-service`, a configuração do host do serviço é feita usando o qualificador `quarkus.grpc.clients. *hello-service*.host`.

source: If the name is not specified via the `GrpcClient#value()` then the field name is used instead, e.g. `helloService` in this particular case.
pt_br: Se o nome não for especificado através do endereço `GrpcClient#value()`, então o nome do campo é usado em seu lugar, por exemplo, `helloService` neste caso específico.

source: The stub class names are derived from the service name used in your `proto` file. For example, if you use `Greeter` as a service name as in:
pt_br: Os nomes das classes stub são derivados do nome do serviço usado em seu arquivo `proto` . Por exemplo, se você usar `Greeter` como nome de serviço, como no seguinte caso:

source: Then the service interface name is: `hello.Greeter`, the Mutiny stub name is: `hello.MutinyGreeterGrpc.MutinyGreeterStub` and the blocking stub name is: `hello.GreeterGrpc.GreeterBlockingStub`.
pt_br: Nesse caso, o nome da interface do serviço é: `hello.Greeter`, o nome do stub Mutiny é: `hello.MutinyGreeterGrpc.MutinyGreeterStub` e o nome do stub bloqueante é: `hello.GreeterGrpc.GreeterBlockingStub`.

source: Examples
pt_br: Exemplos

source: Service Interface
pt_br: Interface de serviço

source: The service name is derived from the injection point - the field name is used. The `quarkus.grpc.clients.hello.host` property must be set.
pt_br: O nome do serviço é derivado do ponto de injeção - o nome do campo é usado. A propriedade `quarkus.grpc.clients.hello.host` deve ser definida.

source: Blocking Stub
pt_br: Stub Bloqueante

source: The `quarkus.grpc.clients.hello.host` property must be set.
pt_br: A propriedade `quarkus.grpc.clients.hello.host` deve ser configurada.

source: Handling streams
pt_br: Lidando com fluxos

source: gRPC allows sending and receiving streams:
pt_br: O gRPC permite o envia e recebimento de fluxos:

source: Using the Mutiny stub, you can interact with these as follows:
pt_br: Utilizando o stub Mutiny, você pode interagir com eles da seguinte forma:

source: Client configuration
pt_br: Configuração do cliente

source: For each gRPC service you inject in your application, you can configure the following attributes:
pt_br: Para cada serviço gRPC que você injeta em sua aplicação, você pode configurar os seguintes atributos:

source: The `client-name` is the name set in the `@GrpcClient` or derived from the injection point if not explicitly defined.
pt_br: O `client-name` é o nome definido no `@GrpcClient` ou derivado do ponto de injeção, se não for explicitamente definido.

source: The following examples uses _hello_ as the client name. Don't forget to replace it with the name you used in the `@GrpcClient` annotation.
pt_br: Os exemplos a seguir usam _hello_ como o nome do cliente. Não se esqueça de substituí-lo pelo nome que você usou na anotação `@GrpcClient` .

source: When you enable `quarkus.grpc.clients."client-name".xds.enabled`, it's the xDS that should handle most of the configuration above.
pt_br: Quando você habilita `quarkus.grpc.clients."client-name".xds.enabled`, é o xDS que deve tratar da maior parte da configuração acima.

source: Enabling TLS
pt_br: Habilitando o TLS

source: To enable TLS, use the following configuration. Note that all paths in the configuration may either specify a resource on the classpath (typically from `src/main/resources` or its subfolder) or an external file.
pt_br: Para habilitar o TLS, use a seguinte configuração. Lembre-se de que todos os caminhos na configuração podem especificar um recurso no classpath (geralmente em `src/main/resources` ou de sua subpasta) ou um arquivo externo.

source: When SSL/TLS is configured, `plain-text` is automatically disabled.
pt_br: Quando SSL/TLS é configurado, `plain-text` é automaticamente desativado.

source: TLS with Mutual Auth
pt_br: TLS com autenticação mútua

source: To use TLS with mutual authentication, use the following configuration:
pt_br: Para utilizar o TLS com autenticação mútua, utilize a seguinte configuração:

source: Client Stub Deadlines
pt_br: Prazos (Deadlines) para o Stub do Cliente

source: If you need to configure a deadline for a gRPC stub, i.e. to specify a duration of time after which the stub will always return the status error `DEADLINE_EXCEEDED`. You can specify the deadline via the `quarkus.grpc.clients."service-name".deadline` configuration property, e.g.:
pt_br: Se o senhor precisar configurar um prazo (deadline) para um stub de gRPC, ou seja, para especificar uma duração de tempo após o qual o stub sempre retornará o erro de status `DEADLINE_EXCEEDED` . Você pode especificar o prazo através da propriedade de configuração `quarkus.grpc.clients."service-name".deadline` , por exemplo:

source: Set the deadline for all injected stubs.
pt_br: Defina o prazo (deadline) para todos os stubs injetados.

source: Do not use this feature to implement an RPC timeout. To implement an RPC timeout, either use Mutiny `call.ifNoItem().after(...)` or Fault Tolerance `@Timeout`.
pt_br: Não utilize esse recurso para implementar um tempo limite (timeout) de RPC. Para implementar um timeout de RPC, use Mutiny `call.ifNoItem().after(…​)` ou Fault Tolerance `@Timeout` .

source: gRPC Headers
pt_br: Cabeçalhos gRPC

source: Similarly to HTTP, alongside the message, gRPC calls can carry headers. Headers can be useful e.g. for authentication.
pt_br: Da mesma forma que no HTTP, chamadas gRPC podem transportar cabeçalhos junto com a mensagem. Cabeçalhos podem ser úteis, por exemplo, para autenticação.

source: To set headers for a gRPC call, create a client with headers attached and then perform the call on this client:
pt_br: Para definir cabeçalhos para uma chamada gRPC, crie um cliente com cabeçalhos anexados e, em seguida, realize a chamada neste cliente:

source: Alter the client to make calls with the `extraHeaders` attached
pt_br: Alterar o cliente para fazer chamadas com os `extraHeaders` anexados

source: Perform the call with the altered client. The original client remains unmodified
pt_br: Realize a chamada com o cliente alterado. O cliente original permanece inalterado.

source: `GrpcClientUtils` work with all flavors of clients.
pt_br: `GrpcClientUtils` funciona com todas as variações de clientes.

source: Client Interceptors
pt_br: Interceptores de clientes

source: A gRPC client interceptor can be implemented by a CDI bean that also implements the `io.grpc.ClientInterceptor` interface. You can annotate an injected client with `@io.quarkus.grpc.RegisterClientInterceptor` to register the specified interceptor for the particular client instance. The `@RegisterClientInterceptor` annotation is repeatable. Alternatively, if you want to apply the interceptor to any injected client then annotate the interceptor bean with `@io.quarkus.grpc.GlobalInterceptor`.
pt_br: Um interceptor de cliente gRPC pode ser implementado por um bean CDI que também implementa a interface `io.grpc.ClientInterceptor` . Você pode anotar um cliente injetado com `@io.quarkus.grpc.RegisterClientInterceptor` para registrar o interceptor especificado para a instância específica do cliente. A anotação `@RegisterClientInterceptor` pode ser repetida. Como alternativa, se você deseja aplicar o interceptador a qualquer cliente injetado, anote o bean do interceptador com `@io.quarkus.grpc.GlobalInterceptor` .

source: Global Client Interceptor Example
pt_br: Exemplo de Interceptor Global de Cliente

source: This interceptor is applied to all injected gRPC clients.
pt_br: Este interceptor é aplicado a todos os clientes gRPC injectados.

source: It's also possible to annotate a producer method as a global interceptor:
pt_br: Também é possível anotar um método produtor como um interceptor global:

source: Check the https://grpc.github.io/grpc-java/javadoc/io/grpc/ClientInterceptor.html[ClientInterceptor JavaDoc] to properly implement your interceptor.
pt_br: Consulte o link:https://grpc.github.io/grpc-java/javadoc/io/grpc/ClientInterceptor.html[JavaDoc do ClientInterceptor] para implementar corretamente o seu interceptor.

source: `@RegisterClientInterceptor` Example
pt_br: Exemplo de `@RegisterClientInterceptor`

source: Registers the `MySpecialInterceptor` for this particular client.
pt_br: Regista o `MySpecialInterceptor` para este cliente específico.

source: When you have multiple client interceptors, you can order them by implementing the `jakarta.enterprise.inject.spi.Prioritized` interface:
pt_br: Quando tem vários interceptadores de clientes, pode ordená-los implementando a interface `jakarta.enterprise.inject.spi.Prioritized`:

source: Interceptors with the highest priority are called first. The default priority, used if the interceptor does not implement the `Prioritized` interface, is `0`.
pt_br: Os interceptadores com a maior prioridade são chamados primeiro. A prioridade padrão, usada se o interceptador não implementar a interface `Prioritized` , é `0` .

source: gRPC Client metrics
pt_br: Métricas de Cliente gRPC

source: Enabling metrics collection
pt_br: Habilitando a coleta de métricas

source: gRPC client metrics are automatically enabled when the application also uses the xref:telemetry-micrometer.adoc[`quarkus-micrometer`] extension. Micrometer collects the metrics of all the gRPC clients used by the application.
pt_br: As métricas do cliente gRPC são habilitadas automaticamente quando a aplicação também utiliza a extensão xref:telemetry-micrometer.adoc[quarkus-micrometer]. O Micrometer coleta as métricas de todos os clientes gRPC usados pelo aplicação.

source: As an example, if you export the metrics to Prometheus, you will get:
pt_br: Como exemplo, se você exportar as métricas para o Prometheus, obterá:

source: The service name, method and type can be found in the _tags_.
pt_br: O nome do serviço, o método e o tipo podem ser encontrados nas _tags_.

source: Disabling metrics collection
pt_br: Desativar a coleta de métricas

source: To disable the gRPC client metrics when `quarkus-micrometer` is used, add the following property to the application configuration:
pt_br: Para desativar as métricas do cliente gRPC quando se utiliza `quarkus-micrometer`, adicione a seguinte propriedade à configuração da aplicação:

source: Custom exception handling
pt_br: Tratamento personalizado de excepções

source: If any of the gRPC services or server interceptors throw an (custom) exception, you can add your own https://github.com/quarkusio/quarkus/extensions/grpc/api/src/main/java/io/quarkus/grpc/ExceptionHandlerProvider.java[ExceptionHandlerProvider] as a CDI bean in your application, to provide a custom handling of those exceptions.
pt_br: Se algum dos serviços gRPC ou interceptadores de servidor lançar uma exceção (personalizada), você poderá adicionar seu próprio link:https://github.com/quarkusio/quarkus/extensions/grpc/api/src/main/java/io/quarkus/grpc/ExceptionHandlerProvider.java[ExceptionHandlerProvider] como um bean CDI em sua aplicação, para fornecer um tratamento personalizado dessas exceções.

source: e.g.
pt_br: por exemplo.

source: Dev Mode
pt_br: Modo de desenvolvimento

source: By default, when starting the application in dev mode, a gRPC server is started, even if no services are configured. You can configure the gRPC extension's dev mode behavior using the following properties.
pt_br: Por padrão, ao iniciar a aplicação no modo de desenvolvimento, um servidor gRPC é iniciado, mesmo que nenhum serviço esteja configurado. Você pode configurar o comportamento do modo de desenvolvimento da extensão gRPC usando as seguintes propriedades.

source: Inject mock clients
pt_br: Injetar clientes falsos

source: In your `@QuarkusTest`, you can use `@InjectMock` to inject the Mutiny client of a gRPC service:
pt_br: No seu `@QuarkusTest`, você pode utilizar `@InjectMock` para injetar o cliente Mutiny de um serviço gRPC:

source: Only the Mutiny client can be _mocked_, channels, and other stubs cannot be mocked.
pt_br: Apenas o cliente Mutiny pode ser _mocked_ (simulado), canais e outros stubs não podem ser simulados.
