Repository: quarkusio/pt.quarkus.io
Catalog: l10n/po/*/_versions/main/guides/grpc-kubernetes.adoc.po
Languages: pt_br

source: Deploying your gRPC Service in Kubernetes
pt_br: Implantando seu serviço gRPC no Kubernetes

source: This page explains how to deploy your gRPC service in Quarkus in Kubernetes. We'll continue with the example from xref:grpc-getting-started.adoc[the Getting Started gRPC guide].
pt_br: Esta página explica como implantar seu serviço gRPC no Quarkus no Kubernetes. Continuaremos com o exemplo do xref:grpc-getting-started.adoc[guia Iniciando com gRPC] .

source: Configuring your project to use the Quarkus Kubernetes extension
pt_br: Configurando o seu projeto para utilizar a extensão Kubernetes no Quarkus

source: Add the Quarkus Kubernetes extension to your build file:
pt_br: Adicione a extensão Kubernetes do Quarkus ao seu arquivo de construção:

source: Next, we want to expose our application using the Kubernetes Ingress resource:
pt_br: A seguir, queremos expor nossa aplicação usando o recurso Kubernetes Ingress:

source: The Quarkus Kubernetes will bind the HTTP server using the port name `http` and the gRPC server using the port name `grpc`. By default, the Quarkus application will only expose the port name `http`, so only the HTTP server will be publicly accessible. To expose the gRPC server instead, set the `quarkus.kubernetes.ingress.target-port=grpc` property in your application.properties:
pt_br: O Quarkus Kubernetes vai vincular o servidor HTTP usando o nome da porta `http` e o servidor gRPC usando o nome da porta `grpc`. Por padrão, a aplicação Quarkus só expõe o nome da porta `http`, então, apenas o servidor HTTP estará publicamente acessível. Para expor o servidor gRPC, defina a propriedade `quarkus.kubernetes.ingress.target-port=grpc` no seu arquivo application.properties:

source: If you configure Quarkus to use the same port for both HTTP and gRPC servers with the property `quarkus.grpc.server.use-separate-server=false`, then you don't need to change the default `target-port`.
pt_br: Se você configurar o Quarkus para usar a mesma porta para os servidores HTTP e gRPC com a propriedade `quarkus.grpc.server.use-separate-server=false`, então você não precisa alterar a propriedade `target-port`.

source: Finally, we need to generate the Kubernetes manifests by running the command in a terminal:
pt_br: Por fim, precisamos gerar os manifestos do Kubernetes executando o comando em um terminal:

source: Once generated, you can look at the `target/kubernetes` directory:
pt_br: Depois de gerados, você pode verificar o diretório `target/kubernetes`:

source: You can find more information about how to deploy the application in Kubernetes in the xref:deploying-to-kubernetes.adoc#deployment[the Kubernetes guide].
pt_br: Você pode encontrar mais informações sobre como implantar a aplicação no Kubernetes no link:deploying-to-kubernetes.html#deployment[guia Kubernetes].

source: Using gRPC Health probes
pt_br: Usando gRPC Health probes

source: By default, the Kubernetes resources do not contain readiness and liveness probes. To add them, import the Smallrye Health extension to your build file:
pt_br: Por padrão, os recursos do Kubernetes não contêm sondas de prontidão (readiness) e vivacidade (liveness). Para adicioná-las, importe a extensão Smallrye Health para seu arquivo de construção:

source: By the default, this extension will configure the probes to use the HTTP server (which is provided by some extensions like the Quarkus RESTEasy reactive extension). Internally, this probe will also use xref:grpc-service-implementation.adoc#health[the generated gRPC Health services].
pt_br: Por padrão, esta extensão configurará as sondas (probes) para utilizarem o servidor HTTP (fornecido por algumas extensões, como a extensão Quarkus RESTEasy reactive). Internamente, esta sonda também utilizará link:grpc-service-implementation.html#health[os serviços gRPC Health gerados].

source: If your application does not use any Quarkus extension that exposes an HTTP server, you can still configure the probes to directly use the gRPC Health service by adding the property `quarkus.kubernetes.readiness-probe.grpc-action-enabled=true` into your configuration:
pt_br: Se sua aplicação não usar nenhuma extensão do Quarkus que exponha um servidor HTTP, você ainda pode configurar as sondas para usar diretamente o serviço gRPC Health, adicionando a propriedade `quarkus.kubernetes.readiness-probe.grpc-action-enabled=true` à sua configuração:
