Repository: quarkusio/pt.quarkus.io
Catalog: l10n/po/*/_versions/main/guides/grpc-virtual-threads.adoc.po
Languages: pt_br

source: Quarkus Virtual Thread support for gRPC services
pt_br: Suporte a Threads Virtuais do Quarkus para serviços gRPC

source: This guide explains how to benefit from Java virtual threads when implementing a gRPC service.
pt_br: Este guia explica como se beneficiar dos threads virtuais Java ao implementar um serviço gRPC.

source: This guide focuses on using virtual threads with the gRPC extensions. Please refer to xref:virtual-threads.adoc[Writing simpler reactive REST services with Quarkus Virtual Thread support] to read more about Java virtual threads in general and the Quarkus Virtual Thread support.
pt_br: Este guia se concentra no uso de threads virtuais com as extensões gRPC. Consulte xref:virtual-threads.adoc[Escrevendo serviços REST reativos mais simples com o suporte a Threads Virtuais do Quarkus] para saber mais sobre os threads virtuais Java em geral e o suporte a Threads Virtuais do Quarkus.

source: By default, the Quarkus gRPC extension invokes service methods on an event-loop thread. See the xref:quarkus-reactive-architecture.adoc[Quarkus Reactive Architecture documentation] for further details on this topic. But, you can also use the link:{blocking_annotation}[@Blocking] annotation to indicate that the service is _blocking_ and should be run on a worker thread.
pt_br: Por padrão, a extensão gRPC do Quarkus invoca métodos de serviço em um thread de loop de evento. Consulte a xref:quarkus-reactive-architecture.adoc[documentação da Arquitetura Reativa do Quarkus] para obter mais detalhes sobre esse tópico. Mas você também pode usar a anotação link:{blocking_annotation}[@Blocking] para indicar que o serviço está _bloqueando_ e deve ser executado em um thread de trabalho.

source: The idea behind Quarkus Virtual Thread support for gRPC services is to offload the service method invocation on virtual threads, instead of running it on an event-loop thread or a worker thread.
pt_br: A ideia por trás do suporte a Threads Virtuais do Quarkus para serviços gRPC é descarregar a invocação do método de serviço em threads virtuais, em vez de executá-lo em um thread de loop de evento ou em um thread de trabalho.

source: To enable virtual thread support on a service method, simply add the link:{runonvthread}[@RunOnVirtualThread] annotation to the method. If the JDK is compatible (Java 19 or later versions - we recommend 21+) then the invocation will be offloaded to a new virtual thread. It will then be possible to perform blocking operations without blocking the platform thread upon which the virtual thread is mounted.
pt_br: Para ativar o suporte a thread virtual em um método de serviço, basta adicionar a anotação link:{runonvthread}[@RunOnVirtualThread] ao método. Se o JDK for compatível (Java 19 ou versões posteriores - recomendamos 21+), a invocação será transferida para um novo thread virtual. Assim, será possível executar operações de bloqueio sem bloquear o thread da plataforma no qual o thread virtual está montado.

source: Configuring gRPC services to use virtual threads
pt_br: Configurando serviços gRPC para usar threads virtuais

source: Let's see an example of how to implement a gRPC service using virtual threads. First, make sure to have the gRPC extension dependency in your build file:
pt_br: Vamos ver um exemplo de como implementar um serviço gRPC usando threads virtuais. Primeiro, certifique-se de ter a dependência da extensão gRPC em seu arquivo de construção:

source: You also need to make sure that you are using Java 19 or later (we recommend 21+), this can be enforced in your `pom.xml` file with the following:
pt_br: Você também precisa se certificar de que está usando o Java 19 ou posterior (recomendamos o 21+), o que pode ser garantido no arquivo `pom.xml` com o seguinte:

source: Run your application with:
pt_br: Execute sua aplicação com:

source: or to use the Quarkus Dev mode, insert the following to the `quarkus-maven-plugin` configuration:
pt_br: ou para utilizar o modo Quarkus Dev, insira o seguinte na configuração `quarkus-maven-plugin`:

source: Then you can start using the annotation `@RunOnVirtualThread` in your service implementation:
pt_br: Em seguida, pode começar a utilizar a anotação `@RunOnVirtualThread` na implementação do seu serviço:

source: Limitations
pt_br: Limitações

source: The gRPC methods receiving _streams_, such as a `Multi` cannot use `@RunOnVirtualThread`, as the method must not be blocking and produce its result (`Multi` or `Uni`) immediately.
pt_br: Os métodos gRPC que recebem _fluxos_, como um `Multi`, não podem utilizar `@RunOnVirtualThread`, uma vez que o método não deve estar bloqueando e produzir o seu resultado ( `Multi` ou `Uni`) imediatamente.
