Repository: quarkusio/pt.quarkus.io
Catalog: l10n/po/*/_versions/main/guides/init-tasks.adoc.po
Languages: pt_br

source: Initialization tasks
pt_br: Tarefas de inicialização

source: There are often initialization tasks performed by Quarkus extensions that are meant to be run once. For example, Flyway or Liquibase initialization falls into that category. But what happens when the scaling needs of an application requires more instances of the application to run? Or what happens when the application restarts?
pt_br: Muitas vezes, há tarefas de inicialização executadas pelas extensões do Quarkus que devem ser executadas uma única vez. Por exemplo, a inicialização do Flyway ou do Liquibase se enquadra nessa categoria. Mas o que acontece quando o dimensionamento de um aplicativo exige a execução de mais instâncias do aplicativo? Ou o que acontece quando o aplicativo é reiniciado?

source: A common environment where both of these cases are pretty common is Kubernetes. To address these challenges, Quarkus allows externalization of such tasks as Kubernetes https://kubernetes.io/docs/concepts/workloads/controllers/job/[Jobs] and uses https://kubernetes.io/docs/concepts/workloads/pods/init-containers/[init containers] to ensure that an application instance only starts once the initialization jobs have finished. With this approach even if an application has multiple replicas, the initialization logic will only run once.
pt_br: Um ambiente comum em que ambos os casos são bastante comuns é o Kubernetes. Para enfrentar esses desafios, o Quarkus permite a externalização de tais tarefas como https://kubernetes.io/docs/concepts/workloads/controllers/job/[trabalhos] no Kubernetes e utiliza https://kubernetes.io/docs/concepts/workloads/pods/init-containers/[contêineres de inicialização] para garantir que uma instância de aplicativo seja iniciada apenas quando os trabalhos de inicialização forem concluídos. Com essa abordagem, mesmo que um aplicativo tenha várias réplicas, a lógica de inicialização só será executada uma vez.

source: This approach is reflected in the manifests generated by xref:deploying-to-kubernetes.adoc#kubernetes[Kubernetes extension].
pt_br: Essa abordagem é refletida nos manifestos gerados pela xref:deploying-to-kubernetes.adoc#kubernetes[extensão do Kubernetes] .

source: Disabling the feature
pt_br: Desabilitando a funcionalidade

source: The feature can be explicitly disabled per task (enabled by default). The default behavior can change by setting the following property to `false`:
pt_br: O recurso pode ser explicitamente desativado por tarefa (ativado por padrão). O comportamento padrão pode ser alterado com a definição da seguinte propriedade como 'false':

source: or on OpenShift:
pt_br: ou no OpenShift:

source: **Note**: All the configuration options in this guide are available on both OpenShift and Kubernetes. The rest of the guide will use Kubernetes(`quarkus.kubernetes` prefix) configuration prefix, but all the configuration options are also available for OpenShift(`quarkus.openshift` prefix) too.
pt_br: *Nota* : todas as opções de configuração neste guia estão disponíveis tanto no OpenShift quanto no Kubernetes. O restante do guia usará o prefixo de configuração do Kubernetes (prefixo 'quarkus.kubernetes' ), mas todas as opções de configuração também estão disponíveis para o OpenShift (prefixo 'quarkus.openshift' ).

source: In the case where we need to disable a particular task, we can use the following property:
pt_br: No caso de precisarmos desativar uma tarefa específica, podemos usar a seguinte propriedade:

source: The task name is the name of the extension that performs the initialization. Examples:
pt_br: O nome da tarefa é o nome da extensão que executa a inicialização. Exemplos:

source: For Flyway:
pt_br: Para a Flyway:

source: For Liquibase:
pt_br: Para a Liquibase:

source: For Liquibase Mongodb:
pt_br: Para o Liquibase Mongodb:

source: Controlling the generated job
pt_br: Controle do trabalho gerado

source: The job container is pretty similar to the application container, and the only thing that changes is the configured environment variables. More specifically, the following environment variable is added, to tell the job to exit right after initialization.
pt_br: O contêiner do trabalho é bastante semelhante ao contêiner do aplicativo, e a única coisa que muda são as variáveis de ambiente configuradas. Mais especificamente, a seguinte variável de ambiente é adicionada para dizer ao trabalho para sair logo após a inicialização.

source: The image, image pull policy, service account, volumes, mounts and additional environment variables are inherited/copied from the deployment resource. Any customization to the original deployment resource (via configuration or extension) will also be reflected in the job.
pt_br: A imagem, a política de pull de imagem, a conta de serviço, os volumes, as montagens e as variáveis de ambiente adicionais são herdadas/copiadas do recurso de implementação. Qualquer personalização do recurso de implementação original (por meio de configuração ou extensão) também será refletida no trabalho.

source: Controlling the generated init container
pt_br: Controle do contêiner de inicialização gerado

source: The name of the generated init container is `wait-for-${task name}` by default. Given that the init container is part of the same pod as the actual application, it will get the same service account (and therefore permissions) and volumes as the application. Further customization to the container can be done using the configuration options for init containers (see `quarkus.kubernetes.init-containers` or `quarkus.openshift.init-containers`).
pt_br: O nome do container init gerado é 'wait-for-${task name}' por padrão. Dado que o container init faz parte do mesmo pod que o aplicativo real, ele obterá a mesma conta de serviço (e, portanto, permissões) e volumes que o aplicativo. Mais personalização do container pode ser feita usando as opções de configuração para container init (veja 'quarkus.kubernetes.init-containers' ou 'quarkus.openshift.init-containers').

source: Examples:
pt_br: Exemplos:

source: To set the `imagePullPolicy` to `IfNotPresent` on the init container that waits for the `flyway` job:
pt_br: Para definir 'imagePullPolicy' como 'fNotPresent' no init container que aguarda o trabalho 'flyway':

source: To set custom command (say `custom-wait-for`) on the init container that waits for the `flyway` job:
pt_br: Para definir um comando personalizado (como 'custom-wait-for' ) no init container que aguarda o trabalho 'flyway' :

source: Orchestration of the initialization tasks
pt_br: Orquestração das tarefas de inicialização

source: The deployment resource should not start until the job has been completed. The typical pattern that is used among Kubernetes users is the use of init containers to achieve this. An init container that `waits for` the job to complete is enough to enforce that requirement.
pt_br: O recurso de implantação não deve iniciar até que o trabalho tenha sido concluído. O padrão típico usado entre usuários do Kubernetes é o uso de init containers para atingir isso. Um init containers que 'espera' que o trabalho seja concluído é suficiente para impor esse requisito.

source: Using a custom wait-for container image
pt_br: Usando uma imagem de container 'wait-for' personalizada

source: By default, the `wait-for` image is `groundnuty/k8s-wait-for:no-root-v1.7`. You can define another image:
pt_br: Por padrão, a imagem 'wait-for' é 'groundnuty/k8s-wait-for:no-root-v1.7'. Você pode definir outra imagem:

source: The `imagePullPolicy` can also be configured:
pt_br: O 'imagePullPolicy' também pode ser configurado:

source: To change the `wait-for` image for a particular init container (e.g. one that waits for the `flyway` job), you can use:
pt_br: Para alterar a imagem 'wait-for' de um init container específico (por exemplo, um que aguarda o trabalho 'flyway'), você pode usar:

source: You can define the `imagePullPolicy` for this particular init container with:
pt_br: Você pode definir o 'imagePullPolicy' para este init container específico com:

source: Configuring permissions
pt_br: Configuração de permissões

source: For an init container to be able to perform the `wait for job`, it needs to be able to perform `get` operations on the job resource. This is done automatically and the generated manifests include the required `Role` and `RoleBinding` resources.
pt_br: Para que um init container seja capaz de executar 'wait for job', ele precisa ser capaz de executar operações 'get' no job resource. Isso é feito automaticamente e os manifestos gerados incluem os recursos 'Role' e 'RoleBinding' necessários.

source: If, for any reason, additional permissions are required either by the init container or the job, they can be configured with the xref:deploying-to-kubernetes.adoc#generating-rbac-resources[Kubernetes RBAC configuration].
pt_br: Se, por qualquer motivo, permissões adicionais forem necessárias pelo init container ou pelo trabalho, elas poderão ser configuradas com xref:deploying-to-kubernetes.adoc#generating-rbac-resources[Configuração do RBAC do Kubernetes].

source: The application, the init container and the job use the same `ServiceAccount` and therefore, share the same permissions.
pt_br: O aplicativo, o init container e o trabalho usam o mesmo 'ServiceAccount' e, portanto, compartilham as mesmas permissões.

source: Extensions providing Initialization Tasks
pt_br: Extensões que fornecem tarefas de inicialização

source: Currently, this feature is used by the following extensions:
pt_br: Atualmente, esse recurso é usado pelas seguintes extensões:
