Repository: quarkusio/pt.quarkus.io
Catalog: l10n/po/*/_versions/main/guides/podman.adoc.po
Languages: pt_br

source: Using Podman with Quarkus
pt_br: Usando o Podman com o Quarkus

source: https://podman.io/[Podman] is an open-source, daemonless, and rootless container engine for developing, managing, and running OCI Containers on Linux, Windows and Mac. It can be used to support the container functionality and Dev Services on Quarkus.
pt_br: link:https://podman.io/[Podman] é um motor de contêineres open source, sem daemon e sem necessidade de privilégios de root, usado para desenvolver, gerenciar e executar contêineres OCI no Linux, Windows e Mac. Pode ser utilizado para suportar a funcionalidade de contêineres e os Dev Services no Quarkus.

source: Installing Podman
pt_br: Instalando o Podman

source: Podman's install approach varies depending on the operating system you are using, and the required steps also change over time depending on the version of Podman. For Mac and Windows we highly recommend installing through the Podman Desktop graphical application. It is the simplest option with the least number of steps, it adds additional functionality like automatic start, and it helps manage future updates. There is also a CLI-only option that may be used. However, this setup requires additional manual tasks to manage, update, and launch the Podman Machine environment.
pt_br: A abordagem de instalação do Podman varia dependendo do sistema operacional que você está usando, e os passos necessários também mudam ao longo do tempo, dependendo da versão do Podman. Para Mac e Windows, recomendamos fortemente a instalação através do aplicativo gráfico Podman Desktop. Esta é a opção mais simples, com o menor número de passos, além de adicionar funcionalidades adicionais, como inicialização automática e auxílio na gestão de futuras atualizações. Também existe uma opção apenas com CLI que pode ser utilizada. No entanto, essa configuração requer tarefas manuais adicionais para gerenciar, atualizar e iniciar o ambiente Podman Machine.

source: The Homebrew package manager on Mac (*brew*) *should not be used to install Podman* as it results in an unverified combination of components. This is due to Homebrew sharing dependencies between projects, along with limited vetting of upgrade requests. As an example, there were several instances where an update to qemu broke on Apple Silicon, preventing Podman machine VMs from booting.
pt_br: O gerenciador de pacotes Homebrew no Mac (brew) não deve ser usado para instalar o Podman pois resulta em uma combinação não verificada de componentes. Isso ocorre porque o Homebrew compartilha dependências entre projetos, além de ter uma verificação limitada dos pedidos de atualização. Por exemplo, houve várias ocasiões em que uma atualização do qemu quebrou no Apple Silicon, impedindo as VMs do Podman de inicializar.

source: On Linux, Podman is integrated as part of the operating system, and installed through the system's packager manager. As with Mac, and Windows, Podman Desktop can also be installed to supplement the Podman CLI. However, on Linux, Podman Desktop acts as a client to the native Podman integration, and does not manage the underlying Podman installation.
pt_br: No Linux, o Podman é integrado como parte do sistema operacional e instalado por meio do gerenciador de pacotes do sistema. Assim como no Mac e no Windows, o Podman Desktop também pode ser instalado para complementar a CLI do Podman. Entretanto, no Linux, o Podman Desktop atua como um cliente para a integração nativa do Podman e não gerencia a instalação subjacente do Podman.

source: See https://podman-desktop.io/downloads/ for the latest version of Podman Desktop or pick the version that suits your operating system from the list below:
pt_br: Consulte https://podman-desktop.io/downloads/ para obter a versão mais recente do Podman Desktop ou escolha a versão adequada ao seu sistema operacional na lista abaixo:

source: https://podman-desktop.io/macos/[MacOS]
pt_br: link:https://podman-desktop.io/macos/[MacOS]

source: https://podman-desktop.io/windows/[Windows]
pt_br: link:https://podman-desktop.io/windows/[Windows]

source: https://podman-desktop.io/linux/[Linux]
pt_br: link:https://podman-desktop.io/linux/[Linux]

source: Additionally, if you are using Linux, see the Podman https://podman.io/docs/installation#installing-on-linux[Linux installation documentation] for instructions installing Podman to your specific Linux distribution.
pt_br: Além disso, se estiver usando Linux, consulte o Podman https://podman.io/docs/installation#installing-on-linux[documentação de instalação] para obter instruções sobre como instalar o Podman em sua distribuição específica no Linux.

source: Docker compatibility mode
pt_br: Modo de compatibilidade com o Docker

source: When installing Podman Desktop on Mac or Windows, it's important to enable Docker compatibility mode when prompted. This will ensure the podman-mac-helper is setup on your behalf (normally a manual action you are prompted to do after start), necessary for supporting /var/run/docker.sock (privileged location). It will also install support for Docker Compose.
pt_br: Ao instalar o Podman Desktop no Mac ou Windows, é importante habilitar o modo de compatibilidade com Docker quando solicitado. Isso garantirá que o podman-mac-helper seja configurado em seu nome (normalmente uma ação manual que você seria solicitado a fazer após a inicialização), necessário para suportar /var/run/docker.sock (local privilegiado). Também instalará suporte para o Docker Compose.

source: Platform differences
pt_br: Diferenças de plataforma

source: While interacting with containers is mostly identical between Mac, Windows, and Linux, there are important environmental differences to be aware of. Notably, the way in which containers are executed is different, since "Containers are Linux". More specifically, containers contain Linux userland binaries with a dependency on the Linux kernel syscall interface. As such, Linux containers cannot run natively on macOS or Windows; they instead require the use of a virtual machine (VM), running Linux, to host them. For systems that require it, Podman includes a subsystem called Podman Machine that is used to manage this VM. Podman Desktop performs a guided interactive setup of this VM, and will automatically launch it on your behalf.
pt_br: Embora a interação com contêineres seja em sua maioria idêntica entre Mac, Windows e Linux, existem diferenças entre os ambientes importantes a serem consideradas. Notavelmente, a maneira como os contêineres são executados é diferente, pois "Contêineres são Linux". Mais especificamente, os contêineres contêm binários do userland do Linux com dependência na interface de chamada de sistema do kernel Linux. Portanto, contêineres Linux não podem ser executados nativamente no macOS ou Windows; eles requerem o uso de uma máquina virtual (VM) rodando Linux para hospedá-los. Para sistemas que precisam disso, o Podman inclui um subsistema chamado Podman Machine que é usado para gerenciar esta VM. O Podman Desktop realiza uma configuração interativa guiada desta VM e a lançará automaticamente em seu nome.

source: Rootful vs Rootless
pt_br: Root vs Sem Root

source: Podman supports two modes of operation: rootful, in which case the container runs as root on the Linux host (or VM in the case of Mac/Windows), and rootless, where the container runs under a standard Unix user account. The latter offers significantly stronger security, but some containers are not capable of running under the increased restrictions. As an example, if a container creates new devices, loopback mount points, and performs other highly restricted operations, then they must be run as root. Note, that this is not to be confused with the USER value specified in Containerfile/Dockerfile, which refers to how processes inside the container perceive themselves. In rootless, processes running in a container with a USER of "root" will appear to each other as root, but due to pid namespacing, they will actually be running as a standard restricted user account on the host system.
pt_br: O Podman suporta dois modos de operação: rootful, onde o contêiner é executado como root no host Linux (ou VM no caso de Mac/Windows), e rootless, onde o contêiner é executado sob uma conta de usuário Unix padrão. O último oferece segurança significativamente mais forte, mas alguns contêineres não são capazes de operar sob as restrições aumentadas. Por exemplo, se um contêiner cria novos dispositivos, pontos de montagem de loopback e realiza outras operações altamente restritas, eles devem ser executados como root. Note que isso não deve ser confundido com o valor USER especificado em um Containerfile/Dockerfile, que se refere a como os processos dentro do contêiner se percebem. No modo rootless, processos executados em um contêiner com um USER definido como "root" parecerão ser root entre si, mas devido ao isolamento de namespaces de PID, na verdade estarão sendo executados como uma conta de usuário restrita no sistema host.

source: Configuring on Win & Mac
pt_br: Configuração no Windowns e no Mac

source: On systems which involve a Podman Machine managed VM (Mac & Windows), container clients and Podman commands communicate remotely to either a rootful or rootless system service running the VM. Which is used is determined by the `rootful` setting of the Podman machine. For maximal compatibility, Podman Desktop defaults to enabling rootful for new machine instances. There is limited security impact to this since the VM itself is running under a user process. This can also be changed via the podman commands:
pt_br: Em sistemas que envolvem uma VM gerenciada pelo Podman Machine (Mac e Windows), os clientes de contêineres e os comandos do Podman se comunicam remotamente com um serviço de sistema, seja `rootful` (com privilégios de root) ou rootless (sem privilégios de root), executado na VM. Qual modo é usado é determinado pela configuração rootful da máquina Podman. Para máxima compatibilidade, o Podman Desktop por padrão habilita o modo rootful para novas instâncias de máquina. Há um impacto limitado na segurança disso, pois a própria VM está sendo executada como um processo de usuário. Isso também pode ser alterado através dos comandos do podman:

source: Configuring on Linux
pt_br: Configuração no Linux

source: On Linux systems, it's recommended to configure client access in a rootless configuration using a user systemd service.
pt_br: Nos sistemas Linux, é recomendável configurar o acesso do cliente em uma configuração sem privilégio de root usando um serviço systemd de usuário.

source: This can be enabled using the following command:
pt_br: Isso pode ser ativado com o seguinte comando:

source: Setting DOCKER_HOST on Linux
pt_br: Definindo o DOCKER_HOST no Linux

source: With the above rootless setup on Linux, you will need to configure clients, such as Quarkus and testcontainers by setting the `DOCKER_HOST` environment variable to point to the user service podman socket. The path be set using an expression which queries the path using the podman command:
pt_br: Com a configuração sem privilégios de root no Linux mencionada acima, você precisará configurar clientes, como Quarkus e testcontainers, definindo a variável de ambiente `DOCKER_HOST` para apontar para o socket de serviço do usuário do podman. O caminho pode ser definido usando uma expressão que consulta o caminho utilizando o comando podman:

source: Other Linux settings
pt_br: Outras configurações do Linux

source: Short names of images
pt_br: Nomes curtos de imagens

source: Testcontainers and Quarkus Dev Services also expect the container service they make requests against to be non-interactive. In case you have multiple registries configured in your Docker or Podman configuration, and when using short image names, Podman responds with a prompt asking which registry should be used to pull images.
pt_br: O Testcontainers e o Quarkus Dev Services também esperam que o serviço de contêiner ao qual fazem solicitações seja não interativo. Caso tenha vários registros configurados na sua configuração do Docker ou do Podman, e ao usar nomes de imagem curtos, o Podman responde com um prompt perguntando qual registro deve ser usado para extrair imagens.

source: While we recommend you to avoid short names and always use fully specified names including the registry, Testcontainers unfortunately relies on short names internally for the time being. If you are using Testcontainers, either directly or through Dev Services, you need to disable this prompt by setting the `short-name-mode="disabled"` configuration property of Podman in `/etc/containers/registries.conf`.
pt_br: Embora recomendemos que você evite nomes curtos e sempre use nomes totalmente especificados, inclusive no registro, o Testcontainers infelizmente depende de nomes curtos internamente por enquanto. Se estiver usando o Testcontainers, seja diretamente ou por meio do Dev Services, você precisará desativar esse prompt definindo a propriedade de configuração `short-name-mode="disabled"` do Podman em `/etc/containers/registries.conf`.
