Repository: quarkusio/pt.quarkus.io
Catalog: l10n/po/*/_versions/3.2/guides/security-basic-authentication.adoc.po
Languages: pt_br

source: Basic authentication
pt_br: Autenticação básica

source: Authorization header
pt_br: Cabeçalho de autorização

source: Example
pt_br: Exemplo

source: If the user name is `Alice` and the password is `secret`, the HTTP authorization header would be `Authorization: Basic QWxjZTpzZWNyZXQ=`, where `QWxjZTpzZWNyZXQ=` is a Base64 encoded representation of the `Alice:secret` string.
pt_br: Se o nome de usuário for `Alice` e a senha for `secret`, o cabeçalho de autorização HTTP seria `Authorization: Basic QWxjZTpzZWNyZXQ=`, onde `QWxjZTpzZWNyZXQ=` é uma representação codificada em Base64 da string `Alice:secret`.

source: The Basic authentication mechanism does not provide confidentiality protection for the transmitted credentials. The credentials are merely encoded with Base64 when in transit, and not encrypted or hashed in any way. Therefore, to provide confidentiality, use Basic authentication with HTTPS.
pt_br: O mecanismo de autenticação _Basic_ não oferece proteção de confidencialidade para as credenciais transmitidas. As credenciais são meramente codificadas com Base64 durante a transmissão, e não são criptografadas nem transformadas em _hash_ de forma alguma. Portanto, para fornecer confidencialidade, use autenticação básica com HTTPS.

source: Basic authentication is a well-specified, simple challenge and response scheme that all web browsers and most web servers understand.
pt_br: A autenticação básica é um esquema simples e bem especificado de desafio e resposta que todos os navegadores Web e a maioria dos servidores Web entendem.

source: Limitations with using Basic authentication
pt_br: Limitações ao usar autenticação básica (Basic)

source: The following table outlines some limitations of using HTTP Basic authentication to secure your Quarkus applications:
pt_br: A tabela a seguir descreve algumas limitações do uso da autenticação HTTP _Basic_ para proteger seus aplicativos Quarkus:

source: Limitations of HTTP Basic authentication
pt_br: Limitações da autenticação HTTP Basic

source: Limitation
pt_br: Limitação

source: Description
pt_br: Descrição

source: Credentials are sent as plain text
pt_br: As credenciais são enviadas como texto simples

source: Use HTTPS with Basic authentication to avoid exposing the credentials. The risk of exposing credentials as plain text increases if a load balancer terminates HTTPS because the request is forwarded to Quarkus over HTTP. Furthermore, in multi-hop deployments, the credentials can be exposed if HTTPS is used between the client and the first Quarkus endpoint only, and the credentials are propagated to the next Quarkus endpoint over HTTP.
pt_br: Use HTTPS com autenticação básica para evitar expor as credenciais. O risco de expor credenciais como texto simples aumenta se um balanceador de carga encerrar o HTTPS porque a solicitação é encaminhada para o Quarkus por HTTP. Além disso, em implantações _multi-hop_, as credenciais podem ser expostas se for usado HTTPS apenas entre o cliente e o primeiro _endpoint_ do Quarkus, e as credenciais forem propagadas para o próximo _endpoint_ do Quarkus por HTTP.

source: Credentials are sent with each request
pt_br: As credenciais são enviadas com cada solicitação

source: In Basic authentication, a username and password must be sent with each request, increasing the risk of exposing credentials.
pt_br: Na autenticação _Basic_, um nome de usuário e senha devem ser enviados com cada requisição, aumentando o risco de expor credenciais.

source: Application complexity increases
pt_br: A complexidade da aplicação aumenta

source: The Quarkus application must validate that usernames, passwords, and roles are managed securely. This process, however, can introduce significant complexity to the application. Depending on the use case, other authentication mechanisms that delegate username, password, and role management to specialized services might be more secure.
pt_br: A aplicação Quarkus deve validar se os nomes de usuário, senhas e papéis (funções) são gerenciados de forma segura. Este processo, no entanto, pode introduzir uma complexidade significativa na aplicação. Dependendo do caso de uso, outros mecanismos de autenticação que delegam o gerenciamento de nome de usuário, senha e papéis para serviços especializados podem ser mais seguros.

source: Implementing Basic authentication in Quarkus
pt_br: Implementando autenticação básica (Basic) no Quarkus

source: For more information about how you can secure your Quarkus applications by using Basic authentication, see the following resources:
pt_br: Para mais informações sobre como você pode proteger suas aplicações Quarkus utilizando autenticação _Basic_, consulte os seguintes recursos:

source: xref:security-basic-authentication-howto.adoc[Enable Basic authentication]
pt_br: xref:security-basic-authentication-howto.adoc[Habilitar a autenticação básica (Basic)]

source: Role-based access control
pt_br: Controle de acesso baseado em função

source: {project-name} also includes built-in security to allow for role-based access control (RBAC) based on the common security annotations @RolesAllowed, @DenyAll, @PermitAll on REST endpoints and CDI beans. For more information, see the Quarkus xref:security-authorize-web-endpoints-reference.adoc[Authorization of web endpoints] guide.
pt_br: {project-name} também inclui segurança integrada para permitir o controle de acesso baseado em função (RBAC) com base nas anotações de segurança comuns @RolesAllowed, @DenyAll, @PermitAll em _endpoints_ REST e _beans_ CDI. Para mais informações, consulte o guia Quarkus de xref:security-authorize-web-endpoints-reference.adoc[Autorização de endpoints da web] .

source: References
pt_br: Referências

source: xref:security-overview.adoc[Quarkus Security overview]
pt_br: xref:security-overview.adoc[Visão geral do Quarkus Security]

source: xref:security-architecture.adoc[Quarkus Security architecture]
pt_br: xref:security-architecture.adoc[Arquitetura do Quarkus Security]

source: xref:security-authentication-mechanisms.adoc#other-supported-authentication-mechanisms[Other supported authentication mechanisms]
pt_br: xref:security-authentication-mechanisms.adoc#other-supported-authentication-mechanisms[Outros mecanismos de autenticação suportados]

source: xref:security-identity-providers.adoc[Identity providers]
pt_br: xref:security-identity-providers.adoc[Provedores de identidade]

source: xref:security-authorize-web-endpoints-reference.adoc[Authorization of web endpoints]
pt_br: xref:security-authorize-web-endpoints-reference.adoc[Autorização de endpoints da web]
