Repository: quarkusio/pt.quarkus.io
Catalog: l10n/po/*/_versions/3.2/guides/security-architecture.adoc.po
Languages: pt_br

source: Quarkus Security architecture
pt_br: Arquitetura da Segurança do Quarkus

source: The Quarkus Security architecture provides several built-in authentication mechanisms and is highly customizable. The primary mechanism for securing HTTP applications in Quarkus is the `HttpAuthenticationMechanism` interface.
pt_br: A arquitetura da Segurança do Quarkus oferece vários mecanismos de autenticação incorporados e é altamente personalizável. O principal mecanismo para proteger os aplicativos HTTP no Quarkus é a interface `HttpAuthenticationMechanism` .

source: Overview of the Quarkus Security architecture
pt_br: Visão geral da arquitetura da Segurança do Quarkus

source: When a client sends an HTTP request, Quarkus Security orchestrates security authentication and authorization by interacting with several built-in core components including `HttpAuthenticationMechanism`, `IdentityProvider`, and `SecurityIdentityAugmentor`.
pt_br: Quando um cliente envia uma requisição HTTP, a Segurança do Quarkus orquestra a autenticação e a autorização de segurança interagindo com vários componentes principais incorporados, incluindo `HttpAuthenticationMechanism`, `IdentityProvider` e `SecurityIdentityAugmentor`.

source: The sequential security validation process results in one of three outcomes:
pt_br: O processo de validação de segurança sequencial conduz a um de três resultados:

source: The HTTP request gets authenticated and authorized and access to the Quarkus application gets granted.
pt_br: A requisição HTTP é autenticada e autorizada e o acesso à aplicação Quarkus é concedido.

source: The HTTP request authentication fails and the requester receives a challenge specific to the authentication mechanism, for example, a `401` error, a URL redirect to reauthenticate, or some other custom authentication challenge response. For some practical examples of challenge responses, see the Quarkus xref:security-customization.adoc[Security Tips and Tricks] guide.
pt_br: A autenticação da requisição HTTP falha e o solicitante recebe um desafio específico para o mecanismo de autenticação, por exemplo, um erro `401` , um redirecionamento de URL para reautenticar ou alguma outra resposta personalizada de desafio de autenticação. Para obter alguns exemplos práticos de respostas de desafio, consulte o guia xref:security-customization.adoc[Dicas e Truques de Segurança] do Quarkus.

source: The HTTP request authorization fails and the requester gets denied access to the Quarkus application.
pt_br: A autorização da requisição HTTP falha e é negado ao requerente o acesso à aplicação Quarkus.

source: The following diagram steps through the detailed process flow of the Quarkus Security architecture:
pt_br: O diagrama seguinte apresenta o fluxo detalhado do processo da arquitetura da Segurança do Quarkus:

source: The Quarkus Security architecture and process flow
pt_br: A arquitetura e o fluxo do processo da Segurança do Quarkus

source: Core components of the Quarkus Security architecture
pt_br: Componentes principais da arquitetura da Segurança do Quarkus

source: Quarkus Security uses `HttpAuthenticationMechanism` to extract the authentication credentials from the HTTP request and delegates them to `IdentityProvider` to convert the credentials to `SecurityIdentity`. For example, the credentials can come from the `Authorization` header, client HTTPS certificates, or cookies.
pt_br: A Segurança do Quarkus usa `HttpAuthenticationMechanism` para extrair as credenciais de autenticação da requisição HTTP e as delega a `IdentityProvider` para convertê-las em `SecurityIdentity` . Por exemplo, as credenciais podem vir do cabeçalho `Authorization` , de certificados HTTPS do cliente ou de cookies.

source: When an authentication request is rejected by Quarkus Security, `HttpAuthenticationMechanism` sends an authentication challenge back to the client. The type of challenge depends on the authentication mechanism. For example, with the OIDC OpenID Connect (OIDC) Authorization Code Flow mechanism, a redirect URL gets generated and the client is sent back to the OpenID Connect provider to authenticate.
pt_br: Quando uma requisição de autenticação é rejeitada pela Segurança do Quarkus, o `HttpAuthenticationMechanism` envia um desafio de autenticação de volta ao cliente. O tipo de desafio depende do mecanismo de autenticação. Por exemplo, com o mecanismo Fluxo de Código de Autorização do OIDC OpenID Connect (OIDC), é gerado um URL de redirecionamento e o cliente é enviado de volta ao provedor OpenID Connect para autenticação.

source: `IdentityProvider` verifies the authentication credentials and maps them to `SecurityIdentity`, which has the username, roles, original authentication credentials, and other attributes.
pt_br: `IdentityProvider` verifica as credenciais de autenticação e mapeia-as para `SecurityIdentity`, que tem o nome de utilizador, as funções, as credenciais de autenticação originais e outros atributos.

source: You can inject a `SecurityIdentity` instance for every authenticated resource to get the authenticated identity information.
pt_br: Você pode injetar uma instância de `SecurityIdentity` para cada recurso autenticado para obter as informações de identidade autenticada.

source: In other contexts, it is possible to have other parallel representations of the same information or parts of it, for example, `SecurityContext` for Jakarta REST or `JsonWebToken` for JSON Web Tokens (JWT).
pt_br: Em outros contextos, é possível ter outras representações paralelas da mesma informação ou de partes dela, por exemplo, `SecurityContext` para Jakarta REST ou `JsonWebToken` para JSON Web Tokens (JWT).

source: For more information, see the Quarkus xref:security-identity-providers.adoc[Identity providers] guide.
pt_br: Para mais informações, consulte o guia de xref:security-identity-providers.adoc[provedores de identidade] do Quarkus.

source: Because Quarkus Security is customizable, for example, you can add authorization roles to `SecurityIdentity`, you can register and prioritize one or more custom security augmentors.
pt_br: Uma vez que a Segurança do Quarkus é personalizável, por exemplo, você pode adicionar funções de autorização a `SecurityIdentity`, pode registar e dar prioridade a um ou mais aumentadores de segurança personalizados.

source: Registered instances of `SecurityIdentityAugmentor` are invoked during the final stage of the security authentication process. For more information, see the xref:security-customization.adoc#security-identity-customization[Security Identity Customization] section of the "Security Tips and Tricks" guide.
pt_br: As instâncias registradas de `SecurityIdentityAugmentor` são invocadas durante o estágio final do processo de autenticação de segurança. Para obter mais informações, consulte a seção xref:security-customization.adoc#security-identity-customization[Personalização da Identidade de Segurança] do guia "Dicas e Truques de Segurança".

source: Supported authentication mechanisms
pt_br: Mecanismos de autenticação suportados

source: Proactive authentication
pt_br: Autenticação proativa

source: Proactive authentication is enabled in Quarkus by default. The request is always authenticated if an incoming request has a credential, even if the target page does not require authentication. For more information, see the Quarkus xref:security-proactive-authentication.adoc[Proactive authentication] guide.
pt_br: A autenticação proativa é ativada no Quarkus por padrão. A solicitação é sempre autenticada se uma solicitação de entrada tiver uma credencial, mesmo que a página de destino não exija autenticação. Para obter mais informações, consulte o guia de xref:security-proactive-authentication.adoc[autenticação proativa] do Quarkus.

source: Quarkus Security customization
pt_br: Personalização da Segurança do Quarkus

source: For more information about customizing Quarkus Security, including reactive security and how to register a security provider, see the Quarkus xref:security-customization.adoc[Security tips and tricks] guide.
pt_br: Para obter mais informações sobre a personalização da Segurança do Quarkus, incluindo segurança reativa e como registar um provedor de segurança, consulte o guia de xref:security-customization.adoc[Dicas e truques de segurança].

source: References
pt_br: Referências

source: xref:security-overview.adoc[Quarkus Security overview]
pt_br: xref:security-overview.adoc[Visão geral do Quarkus Security]

source: xref:security-authentication-mechanisms.adoc#other-supported-authentication-mechanisms[Other supported authentication mechanisms]
pt_br: xref:security-authentication-mechanisms.adoc#other-supported-authentication-mechanisms[Outros mecanismos de autenticação suportados]

source: xref:security-identity-providers.adoc[Identity providers]
pt_br: xref:security-identity-providers.adoc[Provedores de identidade]

source: xref:security-authorize-web-endpoints-reference.adoc[Authorization of web endpoints]
pt_br: xref:security-authorize-web-endpoints-reference.adoc[Autorização de endpoints da web]
