Repository: quarkusio/pt.quarkus.io
Catalog: l10n/po/*/faq.adoc.po
Languages: es_es, pt_br

source: Get answers to some of your common Quarkus questions.
pt_br: Obtenha respostas para algumas de suas perguntas comuns sobre o Quarkus.

source: What is your license?
es_es: ¿Qué licencia tiene?
pt_br: Qual é a sua licença?

source: Quarkus is an Open Source project licensed under the https://www.apache.org/licenses/LICENSE-2.0[Apache License version 2.0].
es_es: Quarkus es un proyecto de código abierto con licencia https://www.apache.org/licenses/LICENSE-2.0[Licencia Apache versión 2.0].
pt_br: Quarkus é um projeto Open Source licenciado sob o https://www.apache.org/licenses/LICENSE-2.0 [Apache License versão 2.0].

source: Where can I get it?
es_es: ¿Dónde puedo conseguirlo?
pt_br: Onde posso obtê-lo?

source: Quarkus is published in Maven Central, check out link:/extensions[which extensions] you need and just import them in your `pom.xml` to get Quarkus. We recommend you start your Quarkus experience via our link:/get-started[Getting Started guides].
es_es: Quarkus es publicado en Maven Central, para obtener Quarkus consulte el link:/extensions[qué extensiones] y simplemente impórtelos en su `pom.xml`. Le recomendamos que comience su experiencia con Quarkus a través de nuestro link:/get-started[Guías de inicio].
pt_br: O Quarkus é publicado no Maven Central, confira link:/extensions[quais extensões] você precisa e basta importá-los em seu 'pom.xml' para obter o Quarkus. Recomendamos que você comece sua experiência com o Quarkus através do nosso link:/get-started[Guias de introdução].

source: Quarkus is stable?
es_es: ¿Quarkus es estable?
pt_br: Quarkus é estável?

source: Yes, we consider Quarkus stable. Remember 95% of the features Quarkus apps use are provided by the ecosystem like Hibernate ORM, Eclipse Vert.x, Netty, RESTEasy, etc. These libraries are rock solid :)
es_es: Sí, consideramos que Quarkus es estable. Recuerde que el 95 % de las funciones que usan las aplicaciones de Quarkus las proporciona el ecosistema como Hibernate ORM, Eclipse Vert.x, Netty, RESTEasy, etc. Estas bibliotecas son sólidas como una roca :)
pt_br: Sim, consideramos o Quarkus estável. Lembre-se que 95% dos recursos que os aplicativos Quarkus usam são fornecidos pelo ecossistema como Hibernate ORM, Eclipse Vert.x, Netty, RESTEasy, etc. Essas bibliotecas são sólidas :)

source: You can go to https://code.quarkus.io/[code.quarkus.io] to see if a particular extension is _stable_ (default) or _preview_.
es_es: Puedes ir a https://code.quarkus.io/[code.quarkus.io] para ver si una extensión en particular es _stable_ (default) o _preview_.
pt_br: Você pode ir para https://code.quarkus.io/[code.quarkus.io] para ver se uma determinada extensão é _stable_ (padrão) ou _preview_.

source: What is a Quarkus extension?
es_es: ¿Qué es una extensión de Quarkus?
pt_br: O que é uma extensão do Quarkus?

source: One of the main goals of Quarkus is ease of extensibility and to build a vibrant ecosystem.
es_es: Uno de los principales objetivos de Quarkus es la facilidad de extensibilidad y la construcción de un ecosistema vibrante.
pt_br: Um dos principais objetivos do Quarkus é a facilidade de extensibilidade e a construção de um ecossistema vibrante.

source: Think of Quarkus extensions as your project dependencies. Extensions configure, boot and integrate a framework or technology into your Quarkus application. They also do all of the heavy lifting of providing the right information to GraalVM for your application to compile natively. This will allow 3rd party projects to easily take advantage of the work we have done to make it easier to target GraalVM.
es_es: Piense en las extensiones de Quarkus como dependencias de su proyecto. Las extensiones configuran, arrancan e integran un framework o tecnologías en su aplicación de Quarkus. También hacen todo el trabajo pesado de proporcionar la información correcta a GraalVM para que su aplicación se compile de forma nativa. Esto permite que los proyectos de terceros aprovechen fácilmente el trabajo que hemos realizado para que sea más fácil utilizar GraalVM.
pt_br: Pense nas extensões do Quarkus como suas dependências de projeto. As extensões configuram, inicializam e integram uma estrutura ou tecnologia em seu aplicativo Quarkus. Eles também fazem todo o trabalho pesado de fornecer as informações certas para GraalVM para sua aplicação compilar nativamente. Isso permitirá que os projetos de terceiros aproveitem facilmente o trabalho que fizemos para facilitar o direcionamento do GraalVM.

source: What are the extension statuses?
es_es: ¿Cuáles son los estados de las extensiones?
pt_br: Quais são os status de extensão?

source: Extensions have a various degree of maturity when they enter the Quarkus ecosystem. A status offers the expectations you can rely on.
es_es: Las extensiones tienen varios grados de madurez a medida que ingresan al ecosistema de Quarkus. El estado ofrece el valor esperado de confianza.
pt_br: As extensões têm um grau de maturidade variado quando entram no ecossistema Quarkus. Um status oferece as expectativas nas quais você pode confiar.

source: *Stable*: backward compatibility and presence in the ecosystem are taken very seriously. An application can safely rely on these extensions. Extensions not marked as preview or experimental (the majority) are stable.
es_es: *Stable*: la compatibilidad con versiones anteriores y la presencia en el ecosistema se toman muy en serio. Una aplicacion pueden confiar de manera segura en estas extensiones. Las extensiónes no están marcadas como preview o experimental (la mayoría) son estables.
pt_br: *Stable*: retrocompatibilidade e presença no ecossistema são levadas muito a sério. Um aplicativo pode confiar com segurança nessas extensões. As extensões não marcadas como visualização ou experimentais (a maioria) são estáveis.

source: *Preview*: backward compatibility and presence in the ecosystem is not guaranteed. Specific improvements might require to change configuration or APIs and plans to become _stable_ are under way. Such extensions are in the middle of their maturation process.
es_es: *Preview*: la compatibilidad con versiones anteriores y la presencia en el ecosistema no están garantizadas. Ciertas mejoras pueden requerir cambios de configuración o API, y los planes para convertirse en _stable_ están en marcha. Estas extensiones están en pleno proceso de maduración.
pt_br: *Preview*: a retrocompatibilidade e a presença no ecossistema não são garantidas. Melhorias específicas podem exigir a alteração da configuração ou APIs e planos para se tornar _stable_ estão em andamento. Tais extensões estão no meio de seu processo de maturação.

source: *Experimental*: early feedback is requested to mature the idea. There is no guarantee of stability nor long term presence in the platform until the solution matures. Such extensions are at the beginning of their maturation process.
es_es: *Experimental*: se solicita un feedback temprano para madurar la idea. No se garantiza la estabilidad ni la presencia a largo plazo en la plataforma hasta que la solución madure. Dichas extensiones están al comienzo de su proceso de maduración.
pt_br: *Experimental*: é solicitado feedback antecipado para amadurecer a ideia. Não há garantia de estabilidade nem presença de longo prazo na plataforma até que a solução amadureça. Tais extensões estão no início de seu processo de maturação.

source: *Deprecated*: backward compatibility and presence in the ecosystem is not guaranteed. Such extensions are likely to be replaced or removed in a future version of Quarkus.
pt_br: *Deprecated*: a compatibilidade com versões anteriores e a presença no ecossistema não são garantidas. Tais extensões provavelmente serão substituídas ou removidas em uma versão futura do Quarkus.

source: You can find the extension status on https://code.quarkus.io[code.quarkus.io] or in the extension link:/guides/[guides].
es_es: Puede encontrar el estado de la extensión en https://code.quarkus.io[code.quarkus.io] o en las link:/guides/[guías] de la extensión.
pt_br: Você pode encontrar o status da extensão em https://code.quarkus.io[code.quarkus.io] ou no link da extensão:/guides/[guides].

source: Can I write an extension?
es_es: ¿Puedo crear una extensión?
pt_br: Posso escrever uma extensão?

source: Will the Quarkus team accept my extension?
es_es: ¿El equipo de Quarkus aceptará mi extensión?
pt_br: A equipe do Quarkus aceitará minha extensão?

source: Oh yeah! We had quite a few extensions written outside the Quarkus "initial" team.
es_es: ¡Por supuesto! Se ha creado un número significativo de extensiones fuera del equipo "inicial" de Quarkus.
pt_br: Oh sim! Tivemos algumas extensões escritas fora da equipe "inicial" do Quarkus.

source: Quarkus is an open ecosystem and we hope to see all the extensions people need to write their apps. We are working as we speak to allow an extension to be published in separate repos and separate GAVs and thus published in Maven repos independently of Quarkus core. This will greatly simplify the publication process. Expect news soon.
es_es: Quarkus es un ecosistema abierto y espera tener todas las extensiones que la gente necesita para crear aplicaciones. Estamos trabajando mientras hablamos para permitir que una extensión se publique en repositorios y GAV separados y por lo tanto se publique en repositorios Maven independientes del core de Quarkus. Esto simplificará enormemente el proceso de publicación. Espere noticias pronto.
pt_br: O Quarkus é um ecossistema aberto e esperamos ver todas as extensões que as pessoas precisam para escrever suas aplicações. Estamos trabalhando enquanto falamos para permitir que uma extensão seja publicada em repositórios separados e GAVs separados e, portanto, publicada em repositórios Maven independentemente do núcleo do Quarkus. Isso simplificará muito o processo de publicação. Aguarde novidades em breve.

source: The one current restriction is that extensions should work in both OpenJDK and GraalVM native executables. That is the guarantee we give Quarkus users (a cross compilation for their app). We have a maturity model to improve an extension to be fully "Quarked" and benefit from Quarkus, all done in incremental steps. Just hop on our https://quarkus.io/community/#discussions[mailing list] to discuss your ideas and get help. And you can start reading our https://quarkus.io/guides/writing-extensions[Writing extensions guide] as well or more simply get inspiration from the https://github.com/quarkusio/quarkus/tree/main/extensions[existing ones].
es_es: La limitación actual es que las extensiones deben funcionar con los ejecutables nativos de OpenJDK y GraalVM. Esta es una garantía que brindamos a los usuarios de Quarkus (compilación cruzada de aplicaciones). Tenemos un modelo de madurez para mejorar una extensión para que sea completamente "Quarked" y beneficiarse de Quarkus, todo hecho en pasos incrementales. Visite https://quarkus.io/community/#discussions[nuestra lista de correo] para discutir ideas y obtener apoyo. También puede comenzar a leer https://quarkus.io/guides/writing-extensions[guía sobre crear extensiones] o puede inspirarse en https://github.com/quarkusio/quarkus/tree/main/extensions[alguna de las existentes].
pt_br: A única restrição atual é que as extensões devem funcionar em executáveis nativos OpenJDK e GraalVM. Essa é a garantia que damos aos usuários do Quarkus (uma compilação cruzada para seu aplicativo). Temos um modelo de maturidade para melhorar uma extensão para ser totalmente "Quarked" e se beneficiar do Quarkus, tudo feito em etapas incrementais. Basta entrar em nossa https://quarkus.io/community/#discussions[lista de discussão] para discutir suas ideias e obter ajuda. E você pode começar a ler nossas https://quarkus.io/guides/writing-extensions[Guia para escrever extensões] também ou, mais simplesmente, se inspirar nas https://github.com/quarkusio/quarkus/tree/main/extensions[existentes].

source: ## What is GraalVM?
es_es: ## ¿Qué es GraalVM?
pt_br: ## O que é GraalVM?

source: https://www.graalvm.org[GraalVM] is a universal virtual machine for running applications written in various different languages, as well as providing the ability to compile JVM bytecode to a native executable (this native executable runs a special virtual machine called SubstrateVM). These native executables start much faster and can use a lot less memory than a traditional JVM, however not every JVM feature is supported, and some are more limited than normal.
es_es: https://www.graalvm.org[GraalVM] es una máquina virtual universal para ejecutar aplicaciones escritas en varios lenguajes diferentes, además de brindar la capacidad de compilar código de bytes JVM en un ejecutable nativo (este ejecutable nativo ejecuta una maquina virtual especial llamada SubstrateVM). Estos ejecutables nativos se inician mucho más rápido y pueden usar mucha menos memoria que una JVM tradicional, sin embargo, no todas las funciones de JVM son compatibles y algunas son más limitadas de lo normal.
pt_br: https://www.graalvm.org[GraalVM] é uma máquina virtual universal para executar aplicações escritas em várias linguagens diferentes, além de fornecer a capacidade de compilar bytecode JVM para um executável nativo (este executável nativo executa uma máquina virtual especial chamada SubstrateVM). Esses executáveis nativos iniciam muito mais rápido e podem usar muito menos memória do que uma JVM tradicional, no entanto, nem todos os recursos da JVM são suportados, e alguns são mais limitados do que o normal.

source: For example by default reflection in GraalVM will not work, unless a class/member has been explicitly registered for reflection. This is normally achieved by listing every class, method, field and constructor in a JSON file, and passing this as a parameter into the native image build. This obviously gets quite cumbersome for all but the most trivial projects. Quarkus provides a framework that makes it easy to work around these annotations, and programmatically determine what should be registered.
es_es: Por ejemplo, de forma predeterminada, la reflexión en GraalVM no funcionará, a menos que una clase/miembro se haya registrado explícitamente para la reflexión. Esto normalmente se logra listando cada clase, método, campo y constructor en un archivo JSON, y pasándolo como un parámetro Obviamente, esto se vuelve bastante engorroso para todos los proyectos, excepto para los más triviales. Quarkus proporciona un marco que facilita el trabajo en torno a estas anotaciones y proporciona un marco que le permite decidir mediante programación qué registrar.
pt_br: Por exemplo, por padrão, o uso de reflexão de classes no GraalVM não funcionará, a menos que uma classe/membro tenha sido explicitamente registrada para reflexão. Isso normalmente é obtido listando cada classe, método, campo e construtor em um arquivo JSON, e passando isso como um parâmetro para a compilação de imagem nativa. Isso obviamente fica bastante complicado para todos, exceto para os projetos mais triviais. O Quarkus fornece uma estrutura que facilita a solução dessas anotações e determina programaticamente o que deve ser registrado.

source: ## How do you unify imperative and reactive programming?
es_es: ## ¿Cómo se unifica la programación imperativa y reactiva?
pt_br: ## Como unificar a programação imperativa e reativa?

source: link:/continuum[Learn more].
pt_br: link:/continuum[Saiba mais].

source: ## What does Container First mean?
es_es: ## ¿Qué significa contenedor primero?
pt_br: ## O que significa Container First?

source: link:/container-first[Learn more].
pt_br: link:/container-first[Saiba mais].

source: ## What is your view on standards?
es_es: ## ¿Cuál es su punto de vista sobre los estándares?
pt_br: ## Qual é a sua opinião sobre os padrões?

source: link:/standards[Learn more].
pt_br: link:/standards[Saiba mais].

source: ## What are you doing to improve developer joy?
es_es: ## ¿Qué está haciendo para mejorar la alegría de los desarrolladores?
pt_br: ## O que você está fazendo para melhorar a alegria do desenvolvedor?

source: link:/developer-joy[Learn more].
pt_br: link:/developer-joy[Saiba mais].
