Repository: quarkusio/pt.quarkus.io
Catalog: l10n/po/*/_versions/2.7/guides/building-native-image.adoc.po
Languages: pt_br

source: Save this file in `src/main/docker/Dockerfile.multistage` as it is not included in the getting started quickstart.
pt_br: Salve esse arquivo em `src/main/docker/Dockerfile.multistage`, uma vez que não está incluído no startup rápido.

source: Sample Dockerfile for building with Gradle:
pt_br: Exemplo de Dockerfile para build com o Gradle:

source: If you are using Gradle in your project, you can use this sample Dockerfile. Save it in `src/main/docker/Dockerfile.multistage`.
pt_br: Se estiver utilizando o Gradle no seu projeto, pode utilizar este exemplo de Dockerfile. Salve-o em `src/main/docker/Dockerfile.multistage`.

source: And, finally, run it with:
pt_br: E, finalmente, execute-o com:

source: If you need SSL support in your native executable, you can easily include the necessary libraries in your Docker image.
pt_br: Se precisar de suporte SSL no seu executável nativo, pode facilmente incluir as bibliotecas necessárias na sua imagem Docker.

source: Please see xref:native-and-ssl.adoc#working-with-containers[our Using SSL With Native Executables guide] for more information.
pt_br: Consulte o link:native-and-ssl.html#working-with-containers[nosso guia Usando SSL com executáveis nativos] para obter mais informações.

source: Using a Distroless base image
pt_br: Usando uma imagem base sem distribuição

source: Distroless image support is experimental.
pt_br: O suporte de imagens sem distribuição é experimental.

source: If you are looking for small container images, the https://github.com/GoogleContainerTools/distroless[distroless] approach reduces the size of the base layer. The idea behind _distroless_ is the usage of a single and minimal base image containing all the requirements, and sometimes even the application itself.
pt_br: Se estiver procurando por imagens de contêineres pequenas, a abordagem https://github.com/GoogleContainerTools/distroless[sem distribuição] reduz o tamanho da camada base. A ideia por trás do _sem distribuição_ é o uso de uma imagem base única e mínima que contenha todos os requisitos e, às vezes, até a própria aplicação.

source: Quarkus provides a distroless base image that you can use in your `Dockerfile`. You only need to copy your application, and you are done:
pt_br: O Quarkus fornece uma imagem base sem distribuição que você pode usar no seu `Dockerfile` . Você só precisa copiar sua aplicação e pronto:

source: Distroless images should not be used in production without rigorous testing.
pt_br: As imagens sem distribuição não devem ser utilizadas em produção sem um teste rigoroso.

source: Quarkus can compress the produced native executable using UPX. More details on xref:./upx.adoc[UPX Compression documentation].
pt_br: O Quarkus pode compactar o executável nativo produzido usando UPX. Mais detalhes na xref:./upx.adoc[documentação de Compressão UPX] .

source: Separating Java and native image compilation
pt_br: Separando a compilação de imagens nativas e Java

source: After compilation has finished, you find the build artifact in `target/native-sources`:
pt_br: Após finalizar a compilação, você encontrará o artefato compilado em `target/native-sources`:

source: The process for Gradle is analogous.
pt_br: O processo para o Gradle é análogo.

source: Running the build process in a container is also possible:
pt_br: Também é possível executar o processo de compilação num contêiner:

source: Mount the host's directory `target/native-image` to the container's `/work`. Thus, the generated binary will also be written to this directory.
pt_br: Monte o diretório raiz `target/native-image` no diretório do contêiner `/work`. Assim, o binário gerado também será escrito neste diretório.

source: Switch the working directory to `/work`, which we have mounted in <1>.
pt_br: Mude o diretório de trabalho para `/work`, que foi montado em <1>.

source: Call `native-image` with the content of file `native-image.args` as arguments. We also supply an additional argument to limit the process's maximum memory to 4 Gigabytes (this may vary depending on the project being built and the machine building it).
pt_br: Chamar `native-image` com o conteúdo do arquivo `native-image.args` como argumentos. Também fornecemos um argumento adicional para limitar a memória máxima do processo a 4 Gigabytes (isto pode variar dependendo do projeto que está sendo construído e da máquina que está sendo usada).

source: If you are running on a Windows machine, please keep in mind that the binary was created within a Linux docker container. Hence, the binary will not be executable on the host Windows machine.
pt_br: Se você estiver executando em uma máquina Windows, lembre-se de que o binário foi criado em um contêiner docker do Linux. Portanto, o binário não será executável na máquina Windows do hospedeiro.

source: A high level overview of what the various steps of a CI/CD pipeline would look is the following:
pt_br: Uma visão geral de alto nível do que seriam as várias etapas de um pipeline CI/CD é a seguinte:

source: Register the output of the step executing `./mvnw ...` command (i.e. directory `target/native-image`) as a build artifact,
pt_br: Registar a saída da etapa que executa o comando `./mvnw …​` (ou seja, o diretório `target/native-image`) como um artefacto de construção,

source: Require this artifact in the step executing the `native-image ...` command, and
pt_br: Exigir este artefacto no passo que executa o comando `native-image …​`, e

source: Register the output of the step executing the `native-image ...` command (i.e. files matching `target/*runner`) as build artifact.
pt_br: Registar a saída do passo que executa o comando `native-image …​` (ou seja, arquivos que correspondem a `target/*runner`) como artefacto de build.

source: The environment executing step `1` only needs Java and Maven (or Gradle) installed, while the environment executing step `3` only needs a GraalVM installation (including the `native-image` feature).
pt_br: O ambiente que executa o passo `1` apenas necessita do Java e Maven (ou Gradle) instalados, enquanto o ambiente que executa o passo `3` apenas necessita de uma instalação GraalVM (incluindo a funcionalidade `native-image` ).

source: Depending on what the final desired output of the CI/CD pipeline is, the generated binary might then be used to create a container image.
pt_br: Dependendo do resultado final desejado do pipeline CI/CD, o binário gerado pode então ser utilizado para criar uma imagem de contêiner.

source: To generate debug symbols, add `-Dquarkus.native.debug.enabled=true` flag when generating the native executable. You will find the debug symbols for the native executable in a `.debug` file next to the native executable.
pt_br: Para gerar símbolos de depuração, adicione o sinalizador `-Dquarkus.native.debug.enabled=true` ao gerar o executável nativo. Você encontrará os símbolos de depuração para o executável nativo em um arquivo `.debug` ao lado do executável nativo.

source: When `objcopy` is not available debug symbols are embedded in the executable.
pt_br: Quando `objcopy` não está disponível, os símbolos de debug são incorporados no executável.

source: Aside from debug symbols, setting `-Dquarkus.native.debug.enabled=true` flag generates a cache of source files for any JDK runtime classes, GraalVM classes and application classes resolved during native executable generation. This source cache is useful for native debugging tools, to establish the link between the symbols and matching source code. It provides a convenient way of making just the necessary sources available to the debugger/IDE when debugging a native executable.
pt_br: Além dos símbolos de depuração, a configuração do sinalizador `-Dquarkus.native.debug.enabled=true` gera um cache de arquivos de origem para todas as classes de tempo de execução do JDK, classes do GraalVM e classes de aplicação resolvidas durante a geração do executável nativo. Esse cache de fontes é útil para ferramentas de depuração nativas, para estabelecer o vínculo entre os símbolos e o código-fonte correspondente. Ele fornece uma maneira conveniente de disponibilizar apenas os códigos-fonte necessários para o depurador/IDE ao depurar um executável nativo.

source: Sources for third party jar dependencies, including Quarkus source code, are not added to the source cache by default. To include those, make sure you invoke `mvn dependency:sources` first. This step is required in order to pull the sources for these dependencies, and get them included in the source cache.
pt_br: Fontes para dependências jar de terceiros, incluindo o código-fonte do Quarkus, não são adicionadas ao cache de fontes por padrão. Para incluí-los, certifique-se de invocar `mvn dependency:sources` primeiro. Essa etapa é necessária para extrair os códigos-fonte dessas dependências e incluí-los no cache de código-fonte.

source: The source cache is located in the `target/sources` folder.
pt_br: A cache de fonte está localizado na pasta `target/sources`.

source: If running `gdb` from a different directory than `target`, then the sources can be loaded by running:
pt_br: Se executar `gdb` a partir de um diretório diferente do `target`, então as fontes podem ser carregadas ao executar:

source: in the `gdb` prompt.
pt_br: no prompt `gdb`.

source: Or start `gdb` with:
pt_br: Ou começar `gdb` com:

source: e.g.,
pt_br: por exemplo,

source: For a more detailed guide about debugging native images please refer to the xref:native-reference.adoc[Native Reference Guide].
pt_br: Para obter um guia mais detalhado sobre o debug de imagens nativas, consulte o link:native-reference.html[Guia de Referência Nativo].

source: Configuring the Native Executable
pt_br: Configuração do executável nativo

source: There are a lot of different configuration options that can affect how the native executable is generated. These are provided in `application.properties` the same as any other config property.
pt_br: Há várias opções de configuração diferentes que podem afetar a forma como o executável nativo é gerado. Elas são fornecidas em `application.properties` da mesma forma que qualquer outra propriedade de configuração.

source: The properties are shown below:
pt_br: As propriedades são apresentadas abaixo:

source: What's next?
pt_br: O que vem a seguir?

source: This guide covered the creation of a native (binary) executable for your application. It provides an application exhibiting a swift startup time and consuming less memory. However, there is much more.
pt_br: Este guia abordou a criação de um executável nativo (binário) para a sua aplicação. Ele fornece uma aplicação que exibe um tempo de inicialização rápido e consome menos memória. No entanto, há muito mais.

source: We recommend continuing the journey with the xref:deploying-to-kubernetes.adoc[deployment to Kubernetes and OpenShift].
pt_br: Recomendamos continuar a jornada com a link:deploying-to-kubernetes.html[implantação no Kubernetes e no OpenShift].
