Repository: quarkusio/pt.quarkus.io
Catalog: l10n/po/*/_versions/2.7/guides/building-native-image.adoc.po
Languages: pt_br

source: Building a Native Executable
pt_br: Criando um executável nativo

source: This guide covers:
pt_br: Este guia inclui:

source: Compiling the application to a native executable
pt_br: Compilar a aplicação para um executável nativo

source: Packaging the native executable in a container
pt_br: Empacotar o executável nativo em um container

source: Debugging native executable
pt_br: Debugando um executável nativo

source: This guide takes as input the application developed in the xref:getting-started.adoc[Getting Started Guide].
pt_br: Este guia utiliza como base a aplicação desenvolvida no link:getting-started.html[Guia de Iniciação].

source: Building a native executable requires using a distribution of GraalVM. There are three distributions: Oracle GraalVM Community Edition (CE), Oracle GraalVM Enterprise Edition (EE) and Mandrel. The differences between the Oracle and Mandrel distributions are as follows:
pt_br: A criação de um executável nativo requer o uso de uma distribuição do GraalVM. Há três distribuições: Oracle GraalVM Community Edition (CE), Oracle GraalVM Enterprise Edition (EE) e Mandrel. As diferenças entre as distribuições Oracle e Mandrel são as seguintes:

source: Mandrel is a downstream distribution of the Oracle GraalVM CE. Mandrel's main goal is to provide a way to build native executables specifically designed to support Quarkus.
pt_br: O Mandrel é uma distribuição downstream do Oracle GraalVM CE. O principal objetivo do Mandrel é fornecer uma maneira de criar executáveis nativos projetados especificamente para dar suporte ao Quarkus.

source: Mandrel releases are built from a code base derived from the upstream Oracle GraalVM CE code base, with only minor changes but some significant exclusions that are not necessary for Quarkus native apps. They support the same capabilities to build native executables as Oracle GraalVM CE, with no significant changes to functionality. Notably, they do not include support for polyglot programming. The reason for these exclusions is to provide a better level of support for the majority of Quarkus users. These exclusions also mean Mandrel offers a considerable reduction in its distribution size when compared with Oracle GraalVM CE/EE.
pt_br: As versões Mandrel são criadas a partir de uma base de código derivada da base de código do Oracle GraalVM CE, com apenas pequenas alterações, mas algumas exclusões significativas que não são necessárias para os aplicativos nativos do Quarkus. Eles suportam os mesmos recursos para criar executáveis nativos que o Oracle GraalVM CE, sem alterações significativas na funcionalidade. Notavelmente, eles não incluem suporte para programação poliglota. O motivo dessas exclusões é oferecer um melhor nível de suporte para a maioria dos usuários do Quarkus. Essas exclusões também significam que o Mandrel oferece uma redução considerável no tamanho de sua distribuição quando comparado ao Oracle GraalVM CE/EE.

source: Mandrel is recommended for building native executables that target Linux containerized environments. This means that Mandrel users are encouraged to use containers to build their native executables. If you are building native executables for macOS, you should consider using Oracle GraalVM instead, because Mandrel does not currently target this platform. Building native executables directly on bare metal Linux or Windows is possible, with details available in the https://github.com/graalvm/mandrel/blob/default/README.md[Mandrel README] and https://github.com/graalvm/mandrel/releases[Mandrel releases].
pt_br: O Mandrel é recomendado para a criação de executáveis nativos voltados para ambientes em contêineres do Linux. Isso significa que os usuários do Mandrel são incentivados a usar contêineres para criar seus executáveis nativos. Se estiver criando executáveis nativos para o macOS, considere o uso do Oracle GraalVM, pois o Mandrel não está voltado para essa plataforma no momento. É possível criar executáveis nativos diretamente no Linux ou Windows rodando diretamente no hardware, com detalhes disponíveis no https://github.com/graalvm/mandrel/blob/default/README.md[LEIAME do Mandrel] e nos https://github.com/graalvm/mandrel/releases[lançamentos do Mandrel] .

source: Prerequisites
pt_br: Pré-requisitos

source: A xref:configuring-c-development[working C development environment]
pt_br: Um link:#configuring-c-development[ambiente de desenvolvimento em C]

source: The code of the application developed in the xref:getting-started.adoc[Getting Started Guide].
pt_br: O código da aplicação desenvolvida no link:getting-started.html[Guia de Iniciação].

source: Supporting native compilation in C
pt_br: Suporte à compilação nativa em C

source: What does having a working C developer environment mean?
pt_br: O que significa ter um ambiente de desenvolvimento em C?

source: On Linux, you will need GCC, and the glibc and zlib headers. Examples for common distributions:
pt_br: No Linux, é necessário o GCC e os headers glibc e zlib. Exemplos de distribuições comuns:

source: XCode provides the required dependencies on macOS:
pt_br: O XCode fornece as dependências necessárias no macOS:

source: On Windows, you will need to install the https://aka.ms/vs/15/release/vs_buildtools.exe[Visual Studio 2017 Visual C++ Build Tools]
pt_br: No Windows, terá de instalar link:https://aka.ms/vs/15/release/vs_buildtools.exe[Visual Studio 2017 Visual C++ Build Tools]

source: Configuring GraalVM
pt_br: Configurando a GraalVM

source: Install GraalVM if you haven't already. You have a few options for this:
pt_br: Instale o GraalVM se ainda não o fez. Existem algumas opções para isso:

source: Download the appropriate archive from <https://github.com/graalvm/mandrel/releases> or <https://github.com/graalvm/graalvm-ce-builds/releases>, and unpack it like you would any other JDK.
pt_br: Download do arquivo apropriado de https://github.com/graalvm/mandrel/releases ou https://github.com/graalvm/graalvm-ce-builds/releases e descompacte-o como faria com qualquer outro JDK.

source: Configure the runtime environment. Set `GRAALVM_HOME` environment variable to the GraalVM installation directory, for example:
pt_br: Configurar o runtime environment. Defina a variável de ambiente `GRAALVM_HOME` para o diretório de instalação do GraalVM, por exemplo:

source: On macOS (not supported by Mandrel), point the variable to the `Home` sub-directory:
pt_br: No macOS (não suportado pelo Mandrel), aponte a variável para o subdiretório `Home`:

source: On Windows, you will have to go through the Control Panel to set your environment variables.
pt_br: No Windows, você terá que ir até o Painel de Controle para definir as suas variáveis de ambiente.

source: Installing via scoop will do this for you.
pt_br: A instalação através do scoop irá fazer tudo por você.

source: (Optional) Set the `JAVA_HOME` environment variable to the GraalVM installation directory.
pt_br: (Opcional) Defina a variável de ambiente `JAVA_HOME` para o diretório de instalação do GraalVM.

source: (Optional) Add the GraalVM `bin` directory to the path
pt_br: (Opcional) Adicione o diretório `bin` GraalVM `bin` no PATH

source: Use the following command to recursively delete the `com.apple.quarantine` extended attribute on the GraalVM install directory as a workaround:
pt_br: Use o seguinte comando para excluir recursivamente o atributo estendido `com.apple.quarantine` no diretório de instalação do GraalVM como uma solução alternativa:

source: Solution
pt_br: Solução

source: We recommend that you follow the instructions in the next sections and package the application step by step. However, you can go right to the completed example.
pt_br: Recomendamos que siga as instruções nos passos seguintes e que prepare a aplicação passo a passo. No entanto, pode ir diretamente para o exemplo completo.

source: Clone the Git repository: `git clone {quickstarts-clone-url}`, or download an {quickstarts-archive-url}[archive].
pt_br: Clone o repositório Git: `git clone {quickstarts-clone-url}`, ou baixe um {quickstarts-archive-url}[arquivo].

source: The solution is located in the `getting-started` directory.
pt_br: A solução está localizada no diretório `getting-started`.

source: Producing a native executable
pt_br: Desenvolvendo um executável nativo

source: The native executable for our application will contain the application code, required libraries, Java APIs, and a reduced version of a VM. The smaller VM base improves the startup time of the application and produces a minimal disk footprint.
pt_br: O executável nativo da nossa aplicação conterá o código da aplicação, as bibliotecas necessárias, as APIs Java e uma versão reduzida de uma VM. A base menor da VM melhora o tempo de inicialização da aplicação e cria um espaço menor em disco.

source: image:native-executable-process.png[Creating a native executable]
pt_br: image:native-executable-process.png[alt=Criando um executável nativo]

source: If you have generated the application from the previous tutorial, you can find in the `pom.xml` the following _profile_:
pt_br: Se gerou a aplicação do tutorial anterior, pode encontrar no `pom.xml` o seguinte profile:

source: You can provide custom options for the `native-image` command using the `<quarkus.native.additional-build-args>` property. Multiple options may be separated by a comma.
pt_br: Você pode fornecer opções personalizadas para o comando `native-image` usando a propriedade `<quarkus.native.additional-build-args>` . Várias opções podem ser separadas por vírgula.

source: Another possibility is to include the `quarkus.native.additional-build-args` configuration property in your `application.properties`.
pt_br: Outra possibilidade é incluir a propriedade de configuração `quarkus.native.additional-build-args` no seu `application.properties`.

source: We use a profile because, you will see very soon, packaging the native executable takes a _few_ minutes. You could just pass -Dquarkus.package.type=native as a property on the command line, however it is better to use a profile as this allows native image tests to also be run.
pt_br: Usamos um perfil porque, como você verá em breve, o empacotamento do executável nativo leva _alguns_ minutos. Você poderia simplesmente passar -Dquarkus.package.type=native como uma propriedade na linha de comando, mas é melhor usar um perfil, pois isso permite que os testes de imagem nativa também sejam executados.

source: Create a native executable using:
pt_br: Criar um executável nativo utilizando:

source: Issues with packaging on Windows
pt_br: Problemas com o empacotamento no Windows

source: Another solution is to write a script to do this for you:
pt_br: Outra solução é escrever um script para fazer isso para você:

source: In addition to the regular files, the build also produces `target/getting-started-1.0.0-SNAPSHOT-runner`. You can run it using: `./target/getting-started-1.0.0-SNAPSHOT-runner`.
pt_br: Além dos arquivos normais, a construção também produz `target/getting-started-1.0.0-SNAPSHOT-runner` . Você pode executá-lo usando: `./target/getting-started-1.0.0-SNAPSHOT-runner` .

source: Java code that relies on preview features requires special attention. To produce a native executable, this means that the `--enable-preview` flag needs to be passed to the underlying native image invocation. You can do so by prepending the flag with `-J` and passing it as additional native build argument: `-Dquarkus.native.additional-build-args=-J--enable-preview`.
pt_br: O código Java que depende de recursos preview requer atenção especial. Para produzir um executável nativo, isso significa que o sinalizador `--enable-preview` precisa ser passado para a invocação da imagem nativa subjacente. Você pode fazer isso prefixando o sinalizador com `-J` e passando-o como argumento adicional de construção nativa: `-Dquarkus.native.additional-build-args=-J—​enable-preview` .

source: Testing the native executable
pt_br: Testando o executável nativo

source: Java code that relies on preview features requires special attention. To test a native executable, this means that the `--enable-preview` flag needs to be passed to the Surefire plugin. Adding `<argLine>--enable-preview</argLine>` to its `configuration` section is one way to do so.
pt_br: O código Java que depende de recursos preview requer atenção especial. Para testar um executável nativo, isso significa que o indicador `--enable-preview` precisa ser passado para o plug-in Surefire. Adicionar `<argLine>--enable-preview</argLine>` à sua seção `configuration` é uma maneira de fazer isso.

source: Excluding tests when running as a native executable
pt_br: Excluindo testes ao executar como um executável nativo

source: Testing an existing native executable
pt_br: Testar um executável nativo existente

source: If the process cannot find the native image for some reason, or you want to test a native image that is no longer in the target directory you can specify the executable with the `-Dnative.image.path=` system property.
pt_br: Se o processo não conseguir encontrar a imagem nativa por algum motivo ou se você quiser testar uma imagem nativa que não esteja mais no diretório de destino, poderá especificar o executável com a propriedade de sistema `-Dnative.image.path=` .

source: Creating a Linux executable without GraalVM installed
pt_br: Criando um executável Linux sem o GraalVM instalado

source: Before going further, be sure to have a working container runtime (Docker, podman) environment. If you use Docker on Windows you should share your project's drive at Docker Desktop file share settings and restart Docker Desktop.
pt_br: Antes de prosseguir, certifique-se de ter um ambiente de tempo de execução de contêiner em funcionamento (Docker, podman). Se usar o Docker no Windows, compartilhe a unidade do seu projeto nas configurações de compartilhamento de arquivos do Docker Desktop e reinicie o Docker Desktop.

source: Quite often one only needs to create a native Linux executable for their Quarkus application (for example in order to run in a containerized environment) and would like to avoid the trouble of installing the proper GraalVM version in order to accomplish this task (for example, in CI environments it's common practice to install as little software as possible).
pt_br: Muitas vezes, é necessário apenas criar um executável Linux nativo para o aplicativo Quarkus (por exemplo, para ser executado em um ambiente de contêiner) e evitar o trabalho de instalar a versão adequada do GraalVM para realizar essa tarefa (por exemplo, em ambientes de CI, é prática comum instalar o mínimo de software possível).

source: To this end, Quarkus provides a very convenient way of creating a native Linux executable by leveraging a container runtime such as Docker or podman. The easiest way of accomplishing this task is to execute:
pt_br: Para isso, o Quarkus oferece uma maneira muito conveniente de criar um executável nativo do Linux, aproveitando um tempo de execução de contêiner, como o Docker ou o podman. A maneira mais fácil de realizar essa tarefa é executar:

source: For Docker:
pt_br: Para o Docker:

source: For podman:
pt_br: Para o podman:

source: If you see the following invalid path error for your application JAR when trying to create a native executable using a container build, even though your JAR was built successfully, you're most likely using a remote daemon for your container runtime.
pt_br: Se vir o seguinte erro de caminho inválido para o JAR da sua aplicação ao tentar criar um executável nativo utilizando uma build em contêiner, mesmo o JAR ter sido compilado com sucesso, é muito provável que esteja utilizando um daemon remoto para o tempo de execução do contêiner.

source: In this case, use the parameter `-Dquarkus.native.remote-container-build=true` instead of `-Dquarkus.native.container-build=true`.
pt_br: Neste caso, utilize o parâmetro `-Dquarkus.native.remote-container-build=true` ao invés de `-Dquarkus.native.container-build=true`.

source: The reason for this is that the local build driver invoked through `-Dquarkus.native.container-build=true` uses volume mounts to make the JAR available in the build container, but volume mounts do not work with remote daemons. The remote container build driver copies the necessary files instead of mounting them. Note that even though the remote driver also works with local daemons, the local driver should be preferred in the local case because mounting is usually more performant than copying.
pt_br: O motivo para isso é que o driver do build local é executado através do `-Dquarkus.native.container-build=true` que utiliza irá montar volumes para tornar o JAR disponível na build do contêiner, mas os volumes montados não funcionam com daemons remotos. O driver que faz a build do contêiner remoto copia apenas os arquivos necessários para montar ele. Observe que, embora o driver remoto também funcione com daemons locais, o driver local deve ser preferido no caso local porque a montagem é geralmente mais eficiente do que a cópia.

source: Creating a container
pt_br: Criando um contêiner

source: Using the container-image extensions
pt_br: Utilizar as extensões dos container-image

source: By far the easiest way to create a container-image from your Quarkus application is to leverage one of the container-image extensions.
pt_br: A maneira mais fácil de criar uma container-image a partir da sua aplicação Quarkus é utilizar uma das extensões de imagem de contêiner.

source: If one of those extensions is present, then creating a container image for the native executable is essentially a matter of executing a single command:
pt_br: Se uma dessas extensões estiverem presente, então a criação de uma imagem de contêiner para o executável nativo é executar um único comando:

source: `quarkus.native.container-build=true` allows for creating a Linux executable without GraalVM being installed (and is only necessary if you don't have GraalVM installed locally or your local operating system is not Linux)
pt_br: `quarkus.native.container-build=true` permite criar um executável Linux sem que o GraalVM esteja instalado (e só é necessário se não tiver o GraalVM instalado localmente ou se o seu sistema operacional local não for Linux)

source: `quarkus.container-image.build=true` instructs Quarkus to create a container-image using the final application artifact (which is the native executable in this case)
pt_br: `quarkus.container-image.build=true` instrui o Quarkus para criar um container-image utilizando o artefato final da aplicação (que, neste caso, é o executável nativo)

source: See the xref:container-image.adoc[Container Image guide] for more details.
pt_br: Consulte o link:container-image.html[Guia do container-image] para obter mais informações.

source: Manually using the micro base image
pt_br: Utilizando a micro imagem base manualmente

source: You can run the application in a container using the JAR produced by the Quarkus Maven Plugin. However, in this section we focus on creating a container image using the produced native executable.
pt_br: É possível executar a aplicação em um contêiner usando o JAR produzido pelo Quarkus Maven Plugin. No entanto, nesta seção, vamos nos concentrar na criação de uma imagem de contêiner usando o executável nativo produzido.

source: image:containerization-process.png[Containerization Process]
pt_br: image:containerization-process.png[alt=Processo de conteinerização]

source: The Quarkus Micro Image is a small container image providing the right set of dependencies to run your native application. It is based on https://catalog.redhat.com/software/containers/ubi8-micro/601a84aadd19c7786c47c8ea?container-tabs=overview[UBI Micro]. This base image has been tailored to work perfectly in containers.
pt_br: O Quarkus Micro Image é uma pequena imagem de contêiner que fornece o conjunto certo de dependências para executar sua aplicação nativa. Ela é baseada no https://catalog.redhat.com/software/containers/ubi8-micro/601a84aadd19c7786c47c8ea?container-tabs=overview[UBI Micro]. Essa imagem base foi adaptada para funcionar perfeitamente em contêineres.

source: You can read more about UBI images on:
pt_br: Você pode ler mais sobre as imagens UBI em:

source: https://www.redhat.com/en/blog/introducing-red-hat-universal-base-image[Introduction to Universal Base Image]
pt_br: link:https://www.redhat.com/en/blog/introducing-red-hat-universal-base-image[Introdução à imagem base universal]

source: https://catalog.redhat.com/software/container-stacks/detail/5ec53f50ef29fd35586d9a56[Red Hat Universal Base Image 8]
pt_br: link:https://catalog.redhat.com/software/container-stacks/detail/5ec53f50ef29fd35586d9a56[Imagem Base Universal da Red Hat]

source: UBI images can be used without any limitations.
pt_br: As imagens UBI podem ser utilizadas sem qualquer limitações.

source: xref:quarkus-runtime-base-image.adoc[This page] explains how to extend the `quarkus-micro` image when your application has specific requirements.
pt_br: link:quarkus-runtime-base-image.html[Esta página] explica como extender a imagem `quarkus-micro` quando a sua aplicação tem requisitos específicos.

source: Then, if you didn't delete the generated native executable, you can build the docker image with:
pt_br: Depois, se não tiver deletado o executável nativo criado, pode construir a imagem docker com:

source: And finally, run it with:
pt_br: E, finalmente, execute-o com:

source: Manually using the minimal base image
pt_br: Utilizando manualmente a imagem base mínima

source: The project generation has also provided a `Dockerfile.native` in the `src/main/docker` directory with the following content:
pt_br: A geração do projeto também forneceu um `Dockerfile.native` na pasta `src/main/docker` com o seguinte conteúdo:

source: The UBI minimal image is bigger than the micro one mentioned above. It contains more utilities such as the `microdnf` package manager.
pt_br: A imagem mínima da UBI é maior do que a micro mencionada acima. Ela contém mais utilitários, como o gerenciador de pacotes `microdnf` .

source: Using a multi-stage Docker build
pt_br: Utilizar uma compilação do Docker multi-stage

source: The previous section showed you how to build a native executable using Maven or Gradle, but it requires you to have created the native executable first. In addition, this native executable must be a Linux 64 bits executable.
pt_br: A seção anterior mostrou como criar um executável nativo usando o Maven ou o Gradle, mas isso exige que o executável nativo tenha sido criado primeiro. Além disso, esse executável nativo deve ser um executável Linux de 64 bits.

source: You may want to build the native executable directly in a container without having a final container containing the build tools. That approach is possible with a multi-stage Docker build:
pt_br: Talvez você queira criar o executável nativo diretamente em um contêiner sem ter um contêiner final que contenha as ferramentas de criação. Essa abordagem é possível com uma compilação do Docker em vários estágios:

source: The first stage builds the native executable using Maven or Gradle
pt_br: O primeiro estágio faz o build do executável nativo utilizando o Maven ou o Gradle

source: The second stage is a minimal image copying the produced native executable
pt_br: O segundo estágio é uma imagem mínima que copia o executável nativo produzido

source: Such a multi-stage build can be achieved as follows:
pt_br: Esta construção em vários estágios pode ser realizada da seguinte forma:

source: Sample Dockerfile for building with Maven:
pt_br: Exemplo de Dockerfile para fazer o build com o Maven:
