Repository: quarkusio/pt.quarkus.io
Catalog: l10n/po/*/_versions/2.7/guides/websockets.adoc.po
Languages: pt_br

source: Using WebSockets
pt_br: Usando WebSockets

source: This guide explains how your Quarkus application can utilize web sockets to create interactive web applications. Because it's the _canonical_ web socket application, we are going to create a simple chat application.
pt_br: Este guia explica como seu aplicativo Quarkus pode utilizar web sockets para criar aplicativos web interativas. Por ser a aplicação canônica de web socket, vamos criar um aplicativo de bate-papo simples.

source: Prerequisites
pt_br: Pré-requisitos

source: Architecture
pt_br: Arquitetura

source: In this guide, we create a straightforward chat application using web sockets to receive and send messages to the other connected users.
pt_br: Neste guia, criamos um aplicativo de bate-papo simples usando soquetes da Web para receber e enviar mensagens a outros usuários conectados.

source: Solution
pt_br: Solução

source: We recommend that you follow the instructions in the next sections and create the application step by step. However, you can skip right to the completed example.
pt_br: Recomendamos que você siga as instruções nas próximas seções e crie o aplicativo passo a passo. No entanto, você pode pular diretamente para o exemplo completo.

source: Clone the Git repository: `git clone {quickstarts-clone-url}`, or download an {quickstarts-archive-url}[archive].
pt_br: Clone o repositório Git: `git clone {quickstarts-clone-url}`, ou baixe um {quickstarts-archive-url}[arquivo].

source: Creating the Maven project
pt_br: Criar o projeto Maven

source: First, we need a new project. Create a new project with the following command:
pt_br: Primeiro, precisamos de um novo projeto. Crie um novo projeto com o seguinte comando:

source: This command generates the project (without any classes) and imports the `websockets` extension.
pt_br: Esse comando gera o projeto (sem nenhuma classe) e importa a extensão `websockets` .

source: If you already have your Quarkus project configured, you can add the `websockets` extension to your project by running the following command in your project base directory:
pt_br: Se você já configurou seu projeto Quarkus, pode adicionar a extensão `websockets` ao seu projeto executando o seguinte comando no diretório base do seu projeto:

source: This will add the following to your build file:
pt_br: Isto irá adicionar o seguinte trecho no seu arquivo de build:

source: If you only want to use the WebSocket client you should include `quarkus-websockets-client` instead.
pt_br: Se você deseja utilizar apenas o cliente WebSocket, você deve incluir `quarkus-websockets-client`.

source: Handling web sockets
pt_br: Manuseio de web sockets

source: Our application contains a single class that handles the web sockets. Create the `org.acme.websockets.ChatSocket` class in the `src/main/java` directory. Copy the following content into the created file:
pt_br: Nosso aplicativo contém uma única classe que lida com os Web Sockets. Crie a classe `org.acme.websockets.ChatSocket` no diretório `src/main/java` . Copie o seguinte conteúdo para o arquivo criado:

source: Configures the web socket URL
pt_br: Configure a URL do Web Socket

source: Stores the currently opened web sockets
pt_br: Armazena os web sockets atualmente abertos

source: A slick web frontend
pt_br: Um frontend da Web sofisticado

source: Run the application
pt_br: Executar o aplicativo

source: Now, let's see our application in action. Run it with:
pt_br: Agora, vamos ver nosso aplicativo em ação. Execute-o com:

source: Then open your 2 browser windows to http://localhost:8080/:
pt_br: Em seguida, abra as duas janelas do navegador em http://localhost:8080/:

source: Enter a name in the top text area (use 2 different names).
pt_br: Digite um nome na área de texto superior (use dois nomes diferentes).

source: Click on connect
pt_br: Clique em conectar

source: Send and receive messages
pt_br: Enviar e receber mensagens

source: As usual, the application can be packaged using:
pt_br: Como de costume, a aplicação pode ser empacotada utilizando:

source: And executed using `java -jar target/quarkus-app/quarkus-run.jar`.
pt_br: E executada com `java -jar target/quarkus-app/quarkus-run.jar`.

source: You can also build the native executable using:
pt_br: Você também pode criar o executável nativo usando:

source: WebSocket Clients
pt_br: Clientes WebSocket

source: The example below shows the client being used to test the chat endpoint above.
pt_br: O exemplo abaixo mostra o client sendo usado para testar o endpoint de bate-papo acima.

source: More WebSocket Information
pt_br: Mais informações sobre o WebSocket
