Repository: quarkusio/pt.quarkus.io
Catalog: l10n/po/*/_data/getstarted-guides.yaml.po
Languages: es, pt_br

source: Guides
es: Guías
pt_br: Guias

source: Read the Guide
es: Leer la guía
pt_br: Leia o Guia

source: Learn how to create, package, and deploy a Hello World Quarkus application including a JAX-RS endpoint and functional tests.
es: Aprenda a crear, empaquetar y desplegar una aplicación Hello World Quarkus, incluyendo un punto final JAX-RS y pruebas funcionales.
pt_br: Saiba como criar, empacotar e implantar um aplicativo Hello World Quarkus, incluindo um endpoint JAX-RS e testes funcionais.

source: Write Your First Application
es: Escriba su primera aplicación
pt_br: Escreva Seu Primeiro Aplicativo

source: Learn how to create a reactive application with Quarkus and explore the different features offered by Quarkus.
es: Aprenda a crear una aplicación reactiva con Quarkus y explore las diferentes características que ofrece Quarkus.
pt_br: Saiba como criar um aplicativo reativo com o Quarkus e explore os diferentes recursos oferecidos pelo Quarkus.

source: Getting Started with Reactive
es: Introducción a Reactive
pt_br: Introdução ao Reativo

source: Create a portable Java API to write serverless functions deployable to AWS Lambda, Azure Functions, Knative, and more.
es: Cree una API Java portátil para escribir funciones sin servidor desplegables en AWS Lambda, Azure Functions, Knative, etc.
pt_br: Crie uma API Java portátil para escrever funções sem servidor implantáveis no AWS Lambda, Azure Functions, Knative e muito mais.

source: Start with Serverless
es: Empezar con el Serverless
pt_br: Comece com Serverless

source: Use the Quarkus Spring Data REST compatibility layer to create a sample CRUD application.
es: Utilice la capa de compatibilidad REST de Quarkus Spring Data para crear una aplicación CRUD de ejemplo.
pt_br: Use a camada de compatibilidade REST do Quarkus Spring Data para criar um aplicativo CRUD de exemplo.

source: Write a Spring Data Application
es: Escribir una aplicación de datos de Spring
pt_br: Escrever uma aplicação Spring Data

source: Want to learn more? Check out the <a href='https://quarkus.io/guides/'>guides</a> to continue your journey
es: ¿Quiere saber más? Consulte las <a href='https://quarkus.io/guides/'>guías</a> para continuar su viaje
pt_br: Quer saber mais? Confira os <a href='https://quarkus.io/guides/'>guias</a> para continuar sua jornada
