Repository: quarkusio/pt.quarkus.io
Catalog: l10n/po/*/_data/getstarted-videos.yaml.po
Languages: pt_br

source: Videos
pt_br: Vídeos

source: November 19, 2019
pt_br: 19 de novembro de 2019

source: Use Quarkus to build a Kafka Streams Application.
pt_br: Use o Quarkus para criar um aplicativo Kafka Streams.

source: Kafka Streams with Quarkus
pt_br: Kafka Streams com Quarkus

source: December 6, 2019
pt_br: 6 de dezembro de 2019

source: Create a microservice using your favorite Spring API.
pt_br: Crie um microsserviço usando sua API favorita do Spring.

source: Kubernetes-native Spring Apps on Quarkus
pt_br: Aplicativos Spring nativos do Kubernetes no Quarkus

source: May 2, 2019
pt_br: maio 2, 2019

source: Build and deploy a native Quarkus application to Kubernetes.
pt_br: Crie e implante um aplicativo nativo do Quarkus no Kubernetes.

source: Quarkus on Kubernetes
pt_br: Quarkus no Kubernetes

source: September 24, 2019
pt_br: 24 de setembro de 2019

source: Learn Quarkus basics by standing up a straightforward application serving a hello endpoint.
pt_br: Aprenda os conceitos básicos do Quarkus levantando um aplicativo direto que atende a um ponto de extremidade de saudação.

source: Visual Studio Code Extension For Quarkus
pt_br: Visual Studio Code Extension para Quarkus
