Repository: quarkusio/pt.quarkus.io
Catalog: l10n/po/*/_data/getstarted-nextsteps.yaml.po
Languages: pt_br

source: Next Steps
pt_br: Próximos Passos

source: Read the Guide
pt_br: Leia o Guia

source: Build native executables with GraalVM or Mandrel.
pt_br: Crie executáveis nativos com GraalVM ou Mandrel.

source: Building Native Executables
pt_br: Criando executáveis nativos

source: Learn how to use continuous testing in your Quarkus Application.
pt_br: Saiba como usar o teste contínuo em sua aplicação Quarkus.

source: Continuous Testing
pt_br: Testes contínuos

source: Create a portable Java API to write serverless functions deployable to AWS Lambda, Azure Functions, Knative, and more.
pt_br: Crie uma API Java portátil para escrever funções sem servidor implantáveis no AWS Lambda, Azure Functions, Knative e muito mais.

source: Start with Serverless
pt_br: Comece com Serverless

source: Every developer has their favorite IDE. Learn how to use Quarkus in yours.
pt_br: Cada desenvolvedor tem seu IDE favorito. Saiba como usar o Quarkus no seu.

source: Quarkus Tools in Your Favorite IDE
pt_br: Ferramentas do Quarkus em seu IDE favorito

source: JSON is now the lingua franca between microservices. See how you can get your REST services to consume and produce JSON payloads.
pt_br: JSON é agora a língua franca entre microsserviços. Veja como você pode fazer com que seus serviços REST consumam e produzam cargas JSON úteis.

source: Writing JSON REST services
pt_br: Escrevendo serviços JSON REST

source: Learn more about developing reactive applications with Quarkus.
pt_br: Saiba mais sobre como desenvolver aplicações reativas com o Quarkus.

source: Getting Started with Reactive
pt_br: Introdução ao Reativo

source: This guide covers how to deploy a native application on Kubernetes.
pt_br: Este guia aborda como implantar um aplicativo nativo no Kubernetes.

source: Deploying Quarkus Applications on Kubernetes
pt_br: Implantando Aplicações Quarkus no Kubernetes

source: Want to learn more? Check out the <a href='/guides/'>guides</a> to continue your journey.
pt_br: Quer saber mais? Confira os <a href='/guides/'>guias</a> para continuar sua jornada.
