Repository: quarkusio/pt.quarkus.io
Catalog: l10n/po/*/_data/guides-latest.yaml.po
Languages: es, pt_br

source: This guide demonstrates how to add a RESTEasy Reactive filter to help prevent CSRF attacks.
pt_br: Este guia demonstra como adicionar um filtro RESTEasy Reactive para ajudar a evitar ataques CSRF.

source: Cross Site Request Forgery (CSRF) prevention
pt_br: Prevenção de falsificação de solicitação entre sites (CSRF)

source: Kogito Dev Services
pt_br: Dev Services Kogito

source: Learn how to use SmallRye Stork for service discovery and load balancing.
pt_br: Saiba como usar o SmallRye Stork para descoberta de serviços e balanceamento de carga.

source: Learn more about Quarkus extensions metadata
pt_br: Saiba mais sobre os metadados das extensões do Quarkus

source: Extension metadata
pt_br: Metadados de extensão

source: Learn how to benefit from Java 19 virtual threads when writing REST services in Quarkus.
pt_br: Saiba como se beneficiar dos threads virtuais Java 19 ao escrever serviços REST no Quarkus.

source: Virtual Threads support
pt_br: Suporte a threads virtuais
