Repository: quarkusio/pt.quarkus.io
Catalog: l10n/po/*/_data/guides-latest.yaml.po
Languages: es, pt_br

source: This guide covers how to use the Flyway extension to manage your schema migrations.
es: Esta guía explica cómo utilizar la extensión Flyway para gestionar sus migraciones de esquemas.
pt_br: Este guia aborda como usar a extensão Flyway para gerenciar suas migrações de esquema de banco de dados.

source: Schema Migration with Flyway
es: Migración de esquemas con Flyway
pt_br: Migração de esquemas com o Flyway

source: This guide covers how to use the Liquibase extension to manage your schema migrations.
es: Esta guía cubre cómo utilizar la extensión Liquibase para gestionar sus migraciones de esquemas.
pt_br: Este guia aborda como usar a extensão Liquibase para gerenciar suas migrações de esquema.

source: Schema Migration with Liquibase
es: Migración de esquemas con Liquibase
pt_br: Migração de esquemas com o Liquibase

source: This guide covers how to use the Reactive SQL Clients in Quarkus.
es: Esta guía cubre cómo usar los Clientes SQL Reactivos en Quarkus.
pt_br: Este guia aborda como usar os clientes SQL reativos no Quarkus.

source: Reactive SQL Clients
es: Clientes SQL reactivos
pt_br: Clientes SQL reativos

source: Reactive API for Hibernate ORM
es: API reactiva para Hibernate ORM
pt_br: API reativa para Hibernate ORM

source: Using Hibernate Reactive
es: Uso de Hibernate Reactive
pt_br: Usando o Hibernate Reactive

source: Simplified reactive ORM layer based on Hibernate Reactive.
es: Capa ORM reactiva simplificada basada en Hibernate Reactive.
pt_br: Camada ORM reativa simplificada baseada no Hibernate Reactive.

source: Simplified Hibernate Reactive with Panache
es: Hibernate Reactivo Simplificado con Panache
pt_br: Hibernate Reativo Simplificado com Panache

source: Infinispan is an in memory data grid that allows running in a server outside of application processes. This extension provides functionality to allow the client that can connect to said server when running in Quarkus.
es: Infinispan es una rejilla de datos en memoria que permite ejecutar en un servidor fuera de los procesos de la aplicación. Esta extensión proporciona la funcionalidad para permitir que el cliente que puede conectarse a dicho servidor cuando se ejecuta en Quarkus.
pt_br: Infinispan é uma malha de dados em memória que permite a execução em um servidor externo aos processos de uma aplicação. Essa extensão fornece funcionalidade para permitir que o cliente que pode se conectar ao referido servidor ao executar no Quarkus.

source: Using Infinispan Client
es: Uso del cliente Infinispan
pt_br: Usando o cliente Infinispan

source: This guide covers how to use an Elasticsearch cluster using the low level or high level REST clients.
es: Esta guía cubre cómo usar un cluster de Elasticsearch usando los clientes REST de bajo o alto nivel.
pt_br: Este guia aborda como usar um cluster do Elasticsearch usando os clientes REST de baixo ou alto nível.

source: Elasticsearch Clients
es: Clientes de Elasticsearch
pt_br: Clientes Elasticsearch

source: Start Elasticsearch automatically in dev and test modes.
es: Inicie Elasticsearch automáticamente en los modos de desarrollo y prueba.
pt_br: Inicie o Elasticsearch automaticamente nos modos de desenvolvimento e teste.

source: Elasticsearch Dev Services
es: Servicios de desarrollo de Elasticsearch
pt_br: Dev Services Elasticsearch

source: This guide covers how to use MongoDB in Quarkus.
es: Esta guía cubre cómo utilizar MongoDB en Quarkus.
pt_br: Este guia aborda como usar o MongoDB no Quarkus.

source: MongoDB Client
es: Cliente MongoDB
pt_br: Cliente MongoDB

source: Manage your MongoDB schema migrations with Liquibase.
es: Gestione sus migraciones de esquemas MongoDB con Liquibase.
pt_br: Gerencie suas migrações de esquema do MongoDB com o Liquibase.

source: This guide covers the usage of MongoDB using active records and repositories.
es: Esta guía cubre el uso de MongoDB utilizando registros y repositorios activos.
pt_br: Este guia aborda o uso do MongoDB usando <i>active records</i> e repositórios.

source: MongoDB with Panache
es: MongoDB con estilo
pt_br: MongoDB com Panache

source: This guide covers the usage of MongoDB using active records and repositories in a Kotlin project.
es: Esta guía cubre el uso de MongoDB utilizando registros y repositorios activos en un proyecto Kotlin.
pt_br: Este guia aborda o uso do MongoDB usando <i>active records</i> e repositórios em um projeto Kotlin.

source: MongoDB with Panache and Kotlin
es: MongoDB con Panache y Kotlin
pt_br: MongoDB com Panache e Kotlin

source: This guide covers how to use a Redis datastore in Quarkus.
es: Esta guía cubre cómo utilizar un almacén de datos Redis en Quarkus.
pt_br: Este guia aborda como usar um datastore Redis no Quarkus.

source: Redis Client
es: Cliente Redis
pt_br: Cliente Redis

source: Learn how to customize the Redis client to your needs.
es: Aprende a personalizar el cliente Redis según tus necesidades.
pt_br: Saiba como personalizar o cliente Redis de acordo com suas necessidades.

source: Redis Reference
es: Referencia de Redis
pt_br: Referência do Redis

source: Start Redis automatically in dev and test modes.
es: Inicie Redis automáticamente en los modos de desarrollo y prueba.
pt_br: Iniciar o Redis automaticamente nos modos de desenvolvimento e teste.

source: Redis Dev Services
es: Servicios de desarrollo de Redis
pt_br: Dev Services Redis

source: This guide covers how to use the Neo4j graph database in Quarkus.
es: Esta guía cubre cómo utilizar la base de datos gráfica Neo4j en Quarkus.
pt_br: Este guia aborda como usar o banco de dados baseado em grafos Neo4j no Quarkus.

source: Neo4j Client
es: Cliente Neo4j
pt_br: Cliente Neo4j

source: This guide covers how to use the Apache Cassandra NoSQL database in Quarkus.
es: Esta guía cubre cómo utilizar la base de datos Apache Cassandra NoSQL en Quarkus.
pt_br: Este guia aborda como usar o banco de dados Apache Cassandra NoSQL no Quarkus.

source: Apache Cassandra Client
es: Cliente Apache Cassandra
pt_br: Cliente Apache Cassandra

source: This guide covers how to use the Amazon DynamoDB database in Quarkus.
es: Esta guía cubre cómo utilizar la base de datos Amazon DynamoDB en Quarkus.
pt_br: Este guia aborda como usar o banco de dados do Amazon DynamoDB no Quarkus.

source: This guide covers how to use the Amazon S3 cloud storage in Quarkus.
es: Esta guía cubre cómo utilizar el almacenamiento en la nube Amazon S3 en Quarkus.
pt_br: Este guia aborda como usar o armazenamento em nuvem do Amazon S3 no Quarkus.

source: This guide covers how to use GCP BigQuery in Quarkus.
es: Esta guía cubre cómo utilizar GCP BigQuery en Quarkus.
pt_br: Este guia aborda como usar o GCP BigQuery no Quarkus.

source: This guide covers how to use GCP Bigtable in Quarkus.
es: Esta guía cubre cómo utilizar GCP Bigtable en Quarkus.
pt_br: Este guia aborda como usar o GCP Bigtable no Quarkus.

source: This guide covers how to use GCP Firestore in Quarkus.
es: Esta guía cubre cómo utilizar GCP Firestore en Quarkus.
pt_br: Este guia aborda como usar o GCP Firestore no Quarkus.

source: This guide covers how to use GCP Spanner in Quarkus.
es: Esta guía cubre cómo utilizar GCP Spanner en Quarkus.
pt_br: Este guia explica como utilizar o GCP Spanner no Quarkus.

source: This guide covers how to use GCP Storage in Quarkus.
es: Esta guía cubre cómo utilizar el Almacenamiento GCP en Quarkus.
pt_br: Este guia aborda como usar o armazenamento GCP no Quarkus.

source: Google Cloud Storage
es: Almacenamiento en la nube de Google

source: This guides covers the usage of Software Transactional Memory (STM).
es: Esta guía cubre el uso de la Memoria Transaccional de Software (STM).
pt_br: Este guia aborda o uso da Memória Transacional de Software (STM).

source: Using Software Transactional Memory
es: Uso de la memoria transaccional del software
pt_br: Usando a memória transacional de software

source: This guides covers the usage of LRA to coordinate activities across services.
es: Esta guía cubre el uso del ERS para coordinar las actividades entre los servicios.
pt_br: Este guia abrange o uso do LRA para coordenar atividades entre serviços.

source: Using LRA (Long Running Actions)
es: Uso de LRA (Acciones de larga duración)
pt_br: Usando LRA (Ações de Longa Duração)

source: messaging
es: mensajería

source: Messaging
es: Mensajería
pt_br: Mensagens

source: This guide demonstrates how your Quarkus application can utilize SmallRye Reactive Messaging to interact with Apache Kafka.
es: Esta guía demuestra cómo su aplicación Quarkus puede utilizar SmallRye Reactive Messaging para interactuar con Apache Kafka.
pt_br: Este guia demonstra como sua aplicação Quarkus pode utilizar o SmallRye Reactive Messaging para interagir com o Apache Kafka.

source: Getting Started to SmallRye Reactive Messaging with Apache Kafka
es: Introducción a SmallRye Reactive Messaging con Apache Kafka
pt_br: Introdução ao SmallRye Reactive Messaging com o Apache Kafka

source: This reference guide provides an in-depth look on Apache Kafka and Smallrye Reactive Messaging framework.
es: Esta guía de referencia proporciona una mirada en profundidad sobre Apache Kafka y el marco de mensajería reactiva Smallrye.
pt_br: Este guia de referência fornece uma visão detalhada da estrutura Apache Kafka e Smallrye Reactive Messaging.

source: Apache Kafka Reference Guide
es: Guía de referencia de Apache Kafka
pt_br: Guia de referência do Apache Kafka

source: Start Apache Kafka automatically in dev and test modes.
es: Inicie Apache Kafka automáticamente en los modos de desarrollo y prueba.
pt_br: Iniciar o Apache Kafka automaticamente nos modos de desenvolvimento e teste.

source: Apache Kafka Dev Services
es: Servicios de desarrollo de Apache Kafka
pt_br: Dev Services Apache Kafka

source: Use Apache Kafka, Avro serialized records, and connect to a schema registry.
es: Utilice Apache Kafka, registros serializados Avro y conecte con un registro de esquemas.
pt_br: Use o Apache Kafka, Avro serialized records e conecte-se a um Schema Registry.

source: Using Apache Kafka with Schema Registry and Avro
es: Uso de Apache Kafka con Schema Registry y Avro
pt_br: Utilização do Apache Kafka com o Schema Registry e o Avro

source: Start Apicurio Registry automatically in dev and test modes.
es: Inicie el Registro de Apicurio automáticamente en los modos de desarrollo y prueba.
pt_br: Iniciar o Apicurio Registry automaticamente nos modos de desenvolvimento e teste.

source: Apicurio Registry Dev Services
es: Servicios de desarrollo de registros de Apicurio
pt_br: Dev Services Apicurio

source: This guide demonstrates how your Quarkus application can utilize SmallRye Reactive Messaging to interact with AMQP.
es: Esta guía demuestra cómo su aplicación Quarkus puede utilizar SmallRye Reactive Messaging para interactuar con AMQP.
pt_br: Este guia demonstra como sua aplicação Quarkus pode utilizar o SmallRye Reactive Messaging para interagir com o AMQP.

source: Using AMQP with Reactive Messaging
es: Uso de AMQP con mensajería reactiva
pt_br: Usando AMQP com mensagens reativas

source: Reference guide for SmallRye Reactive Messaging and AMQP.
es: Guía de referencia para SmallRye Reactive Messaging y AMQP.
pt_br: Guia de referência para SmallRye Reactive Messaging e AMQP.

source: AMQP Reference
es: Referencia AMQP
pt_br: Referência AMQP

source: Start AMQP automatically in dev and test modes.
es: Inicie AMQP automáticamente en los modos de desarrollo y prueba.
pt_br: Iniciar o AMQP automaticamente nos modos de desenvolvimento e teste.

source: AMQP Dev Services
es: Servicios de desarrollo AMQP
pt_br: Dev Services AMQP

source: This guide demonstrates how your Quarkus application can utilize SmallRye Reactive Messaging to interact with RabbitMQ.
es: Esta guía demuestra cómo su aplicación Quarkus puede utilizar SmallRye Reactive Messaging para interactuar con RabbitMQ.
pt_br: Este guia demonstra como sua aplicação Quarkus pode utilizar o SmallRye Reactive Messaging para interagir com o RabbitMQ.

source: Using RabbitMQ with Reactive Messaging
es: Uso de RabbitMQ con mensajería reactiva
pt_br: Usando o RabbitMQ com mensagens reativas

source: Reference guide for SmallRye Reactive Messaging and RabbitMQ.
es: Guía de referencia para SmallRye Reactive Messaging y RabbitMQ.
pt_br: Guia de referência para SmallRye Reactive Messaging e RabbitMQ.

source: RabbitMQ Reference
es: Referencia de RabbitMQ
pt_br: Referência do RabbitMQ

source: Start RabbitMQ automatically in dev and test modes.
es: Inicie RabbitMQ automáticamente en los modos de desarrollo y prueba.
pt_br: Iniciar o RabbitMQ automaticamente nos modos de desenvolvimento e teste.

source: RabbitMQ Dev Services
es: Servicios de desarrollo de RabbitMQ
pt_br: Dev Services RabbitMQ

source: This guide demonstrates how your Quarkus application can utilize SmallRye Reactive Messaging to consume and produce HTTP messages.
es: Esta guía demuestra cómo su aplicación Quarkus puede utilizar SmallRye Reactive Messaging para consumir y producir mensajes HTTP.
pt_br: Este guia demonstra como a sua aplicação Quarkus pode utilizar o SmallRye Reactive Messaging para consumir e produzir mensagens HTTP.

source: Using HTTP with Reactive Messaging
es: Uso de HTTP con mensajería reactiva
pt_br: Usando HTTP com mensagens reativas

source: This guide demonstrates how your Quarkus application can utilize SmallRye Reactive Messaging to consume and produce messages via WebSockets.
es: Esta guía demuestra cómo su aplicación Quarkus puede utilizar SmallRye Reactive Messaging para consumir y producir mensajes a través de WebSockets.
pt_br: Este guia demonstra como sua aplicação Quarkus pode utilizar o SmallRye Reactive Messaging para consumir e produzir mensagens via WebSockets.

source: Using WebSockets with Reactive Messaging
es: Uso de WebSockets con mensajería reactiva
pt_br: Usando WebSockets com mensagens reativas

source: This guide demonstrates how your Quarkus application can utilize the Apache Kafka Streams API to implement stream processing applications based on Apache Kafka.
es: Esta guía demuestra cómo su aplicación Quarkus puede utilizar la API Apache Kafka Streams para implementar aplicaciones de procesamiento de flujos basadas en Apache Kafka.
pt_br: Este guia demonstra como a sua aplicação Quarkus pode utilizar a API Apache Kafka Streams para implementar aplicações de processamento de fluxo baseadas no Apache Kafka.

source: Using Apache Kafka Streams
es: Uso de Apache Kafka Streams
pt_br: Usando Apache Kafka Streams

source: This guide explains how different beans can interact using the event bus.
es: Esta guía explica cómo los diferentes beans pueden interactuar utilizando el bus de eventos.
pt_br: Este guia explica como diferentes beans podem interagir usando o barramento de eventos.

source: Using the event bus
es: Uso del bus de eventos
pt_br: Utilizar o barramento de eventos

source: This guide demonstrates how your Quarkus application can use JMS messaging with AMQP 1.0 using Apache Qpid JMS, or using Apache ActiveMQ Artemis JMS.
es: Esta guía demuestra cómo su aplicación Quarkus puede usar la mensajería JMS con AMQP 1.0 usando Apache Qpid JMS, o usando Apache ActiveMQ Artemis JMS.
pt_br: Este guia demonstra como a sua aplicação Quarkus pode utilizar mensagens JMS com AMQP 1.0 utilizando o Apache Qpid JMS, ou utilizando o Apache ActiveMQ Artemis JMS.

source: Using JMS
es: Uso de JMS
pt_br: Usando JMS

source: This guide covers how to use GCP PubSub in Quarkus.
es: Esta guía cubre cómo utilizar GCP PubSub en Quarkus.
pt_br: Este guia explica como utilizar o GCP PubSub no Quarkus.

source: security
es: seguridad

source: Security
es: Seguridad
pt_br: Segurança

source: This guide is the entry point for everything security in Quarkus.
es: Esta guía es el punto de entrada para todo lo relacionado con la seguridad en Quarkus.
pt_br: Este guia é o ponto de entrada para tudo o que diz respeito à segurança em Quarkus.

source: Security Overview
es: Visión general de la seguridad
pt_br: Visão geral de segurança

source: Secure your web endpoints with authorizations.
es: Asegure sus puntos finales de la web con autorizaciones.
pt_br: Proteja os seus Web Endpoints com autorizações.

source: Authorization of Web Endpoints
es: Autorización de los puntos finales de la web
pt_br: Autorização de Web Endpoints

source: Learn more about how Quarkus handles authentication.
es: Aprenda más sobre cómo Quarkus maneja la autenticación.
pt_br: Saiba mais sobre como o Quarkus lida com a autenticação.

source: Built-In Authentication Support
es: Soporte de autenticación incorporado
pt_br: Suporte de autenticação integrado

source: Customize Quarkus' security layer behavior.
es: Personalizar el comportamiento de la capa de seguridad de Quarkus.
pt_br: Personalize o comportamento da camada de segurança do Quarkus.

source: Security Customization
es: Personalización de la seguridad
pt_br: Personalização de segurança

source: Test the security of your Quarkus applications.
es: Pruebe la seguridad de sus aplicaciones Quarkus.
pt_br: Teste a segurança das suas aplicações Quarkus.

source: Security Testing
es: Pruebas de seguridad
pt_br: Testes de segurança

source: This guide demonstrates how your Quarkus application can use a .properties file to store your user identities.
es: Esta guía demuestra cómo su aplicación Quarkus puede utilizar un archivo .properties para almacenar sus identidades de usuario.
pt_br: Este guia demonstra como seu aplicativo Quarkus pode usar um arquivo .properties para armazenar suas identidades de usuário.

source: Using Security with .properties File
es: Uso de la seguridad con el archivo .properties
pt_br: Usando a segurança com o arquivo .properties

source: This guide demonstrates how your Quarkus application can use a database to store your user identities with Hibernate ORM.
es: Esta guía demuestra cómo su aplicación Quarkus puede utilizar una base de datos para almacenar sus identidades de usuario con Hibernate ORM.

source: Using Security with JPA
es: Uso de la seguridad con JPA

source: This guide demonstrates how your Quarkus application can use a database to store your user identities.
es: Esta guía demuestra cómo su aplicación Quarkus puede utilizar una base de datos para almacenar sus identidades de usuario.
pt_br: Este guia demonstra como seu aplicativo Quarkus pode usar um banco de dados para armazenar suas identidades de usuário.

source: Using Security with JDBC
es: Uso de la seguridad con JDBC
pt_br: Usando a segurança com JDBC

source: This guide demonstrates how your Quarkus application can use a LDAP directory to store your user identities.
es: Esta guía demuestra cómo su aplicación Quarkus puede utilizar un directorio LDAP para almacenar sus identidades de usuario.
pt_br: Este guia demonstra como sua aplicação Quarkus pode usar um diretório LDAP para armazenar suas identidades de usuário.

source: Using Security with LDAP
es: Uso de la seguridad con LDAP
pt_br: Usando a segurança com LDAP

source: This guide demonstrates how to use the OpenID Connect extension to protect your Quarkus JAX-RS service application using Bearer Token Authorization where the tokens are issued by OpenID Connect Providers such as Keycloak.
es: Esta guía demuestra cómo utilizar la extensión de OpenID Connect para proteger su aplicación de servicio JAX-RS de Quarkus utilizando la autorización de tokens de portador donde los tokens son emitidos por proveedores de OpenId Connect como Keycloak.
pt_br: Este guia demonstra como utilizar a extensão OpenID Connect para proteger a sua aplicação de serviço Quarkus JAX-RS utilizando a Autorização de Token de Portador em que os tokens são emitidos por Fornecedores OpenID Connect como o Keycloak.

source: sso,jwt,security
es: sso,jwt,seguridad

source: Using OpenID Connect (OIDC) to Protect Service Applications
es: Uso de OpenID Connect (OIDC) para proteger las aplicaciones de servicios
pt_br: Utilizar o OpenID Connect (OIDC) para proteger aplicações de serviço

source: This guide demonstrates how to use the OpenID Connect extension to protect your Quarkus JAX-RS web application using the Authorization Code Flow and OpenID Connect Providers such as Keycloak.
es: Esta guía demuestra cómo utilizar la extensión OpenID Connect para proteger su aplicación web JAX-RS de Quarkus utilizando el flujo de código de autorización y los proveedores de OpenId Connect como Keycloak.
pt_br: Este guia demonstra como usar a extensão OpenID Connect para proteger sua aplicação Web Quarkus JAX-RS usando o Authorization Code Flow e OpenID Connect Providers, como Keycloak.

source: sso,security
es: sso,seguridad

source: Using OpenID Connect (OIDC) to Protect Web Applications
es: Uso de OpenID Connect (OIDC) para proteger las aplicaciones web
pt_br: Usando o OpenID Connect (OIDC) para proteger aplicativos Web

source: This guide demonstrates how your OpenID Connect application can support multi-tenancy so that you can serve multiple tenants from a single application.
es: Esta guía muestra cómo su aplicación de OpenID Connect puede admitir el multi-tenancy para que pueda servir a varios inquilinos desde una sola aplicación.
pt_br: Este guia demonstra como seu aplicativo OpenID Connect pode oferecer suporte a multilocação para que você possa atender vários locatários de um único aplicativo.

source: Using OpenID Connect (OIDC) Multi-Tenancy
es: Uso de OpenID Connect (OIDC) Multi-Tenancy
pt_br: Usando o OpenID Connect (OIDC) Multi-Tenancy

source: This guide demonstrates how your Quarkus application can authorize access to protected resources using Keycloak Authorization Services.
es: Esta guía demuestra cómo su aplicación Quarkus puede autorizar el acceso a recursos protegidos utilizando los Servicios de Autorización de Keycloak.
pt_br: Este guia demonstra como a sua aplicação Quarkus pode autorizar o acesso a recursos protegidos utilizando os Serviços de Autorização Keycloak.

source: Using OpenID Connect (OIDC) and Keycloak to Centralize Authorizations
es: Uso de OpenID Connect (OIDC) y Keycloak para centralizar las autorizaciones
pt_br: Usando OpenID Connect (OIDC) e Keycloak para centralizar autorizações

source: This guide explains how to use OpenID Connect and OAuth2 Client and Filters to acquire, refresh and propagate access tokens.
es: Esta guía explica cómo utilizar el cliente y los filtros de OpenID Connect y OAuth2 para adquirir, actualizar y propagar tokens de acceso.
pt_br: Este guia explica como usar clientes e filtros OpenID Connect e o OAuth2 para adquirir, atualizar e propagar tokens de acesso.

source: Using OpenID Connect (OIDC) and OAuth2 Client and Filters
es: Uso de OpenID Connect (OIDC) y OAuth2 Client y Filtros
pt_br: Usando clientes e filtros OpenID Connect (OIDC) e OAuth2

source: Reference guide for OpenID Connect and OAuth2 Client and Filters.
es: Uso de OpenID Connect (OIDC) y OAuth2 Client y Filtros.
pt_br: Guia de referência para clientes e filtros OpenID Connect e OAuth2.

source: OpenID Connect (OIDC) and OAuth2 Client and Filters Reference
es: Uso de OpenID Connect (OIDC) y OAuth2 Client y Filtros
pt_br: Referência de clientes e filtros OpenID Connect (OIDC) e OAuth2

source: This guide explains how to configure Quarkus to authenticate against well-known OpenID Connect providers such as GitHub, Google, Microsoft, Apple...
es: Esta guía explica cómo configurar Quarkus para que se autentique contra proveedores conocidos de OpenID Connect como GitHub, Google, Microsoft, Apple...
pt_br: Este guia explica como configurar o Quarkus para se autenticar em provedores OpenID Connect bem conhecidos, como GitHub, Google, Microsoft, Apple...

source: Configuring Well-Known OpenID Connect (OIDC) Providers
es: Servicios de desarrollo de OpenID Connect (OIDC)
pt_br: Configurando provedores conhecidos do OpenID Connect (OIDC)
