Repository: quarkusio/pt.quarkus.io
Catalog: l10n/po/*/_data/guides-latest.yaml.po
Languages: es, pt_br

source: Start Keycloak or other providers automatically in dev and test modes.
es: Inicie Keycloak u otros proveedores automáticamente en los modos de desarrollo y prueba.
pt_br: Inicie o Keycloak ou outros provedores automaticamente nos modos de desenvolvimento e teste.

source: OpenID Connect (OIDC) Dev Services
es: Servicios de desarrollo de OpenID Connect (OIDC)

source: This guide explains how your application can utilize SmallRye JWT to verify JWT tokens and provide secured access to the JAX-RS endpoints.
es: Esta guía explica cómo su aplicación puede utilizar SmallRye JWT para verificar los tokens JWT y proporcionar acceso seguro a los puntos finales JAX-RS.
pt_br: Este guia explica como seu aplicativo pode utilizar o SmallRye JWT para verificar tokens JWT e fornecer acesso seguro aos endpoints JAX-RS.

source: Using JWT RBAC
es: Uso de JWT RBAC
pt_br: Usando JWT RBAC

source: This guide explains how your application can build, sign and/or encrypt JWT tokens with a fluent and configurable SmallRye JWT Build API.
es: Esta guía explica cómo su aplicación puede construir, firmar y/o encriptar tokens JWT con una API SmallRye JWT Build fluida y configurable.
pt_br: Este guia explica como sua aplicação pode construir, assinar e/ou criptografar tokens JWT com uma API SmallRye JWT Build fluente e configurável.

source: jwt,security
es: jwt,seguridad

source: Build, Sign and Encrypt JSON Web Tokens (JWT)
es: Construir, firmar y cifrar tokens web JSON (JWT)
pt_br: Criar, assinar e encriptar tokens Web JSON (JWT)

source: This guide explains how your Quarkus application can utilize OAuth2 tokens to provide secured access to the JAX-RS endpoints.
es: Esta guía explica cómo su aplicación Quarkus puede utilizar tokens OAuth2 para proporcionar acceso seguro a los puntos finales JAX-RS.
pt_br: Este guia explica como a sua aplicação Quarkus pode utilizar tokens OAuth2 para fornecer acesso seguro aos pontos de extremidade JAX-RS.

source: Using OAuth2 RBAC
es: Uso de OAuth2 RBAC
pt_br: Usando OAuth2 RBAC

source: This guide explains how you can use HashiCorp Vault to securely store your credentials in Quarkus.
es: Esta guía explica cómo puede utilizar HashiCorp Vault para almacenar de forma segura sus credenciales en Quarkus.
pt_br: Este guia explica como pode utilizar o HashiCorp Vault para armazenar de forma segura as suas credenciais no Quarkus.

source: Using Vault
es: Uso de Vault
pt_br: Usando o Vault

source: This guide explains how you can use HashiCorp Vault for "encryption as a service".
es: Esta guía explica cómo puede utilizar HashiCorp Vault para el "cifrado como servicio".
pt_br: Este guia explica como você pode usar o HashiCorp Vault para "criptografia como serviço".

source: Using Vault Transit Secret Engine
es: Uso del motor secreto de Vault Transit
pt_br: Usando o Vault Transit Secret Engine

source: Keep confidential your database credentials by storing them in Vault.
es: Mantenga la confidencialidad de sus credenciales de la base de datos almacenándolas en Vault.
pt_br: Mantenha confidenciais suas credenciais de banco de dados armazenando-as no Vault.

source: Using HashiCorp Vault with Databases
es: Uso de HashiCorp Vault con bases de datos
pt_br: Usando o HashiCorp Vault com bancos de dados

source: This guide explains the various methods supported by Quarkus to authenticate to your Vault.
es: Esta guía explica los distintos métodos que soporta Quarkus para autenticarse en su Vault.
pt_br: Este guia explica os vários métodos suportados pelo Quarkus para autenticar no seu Vault.

source: Working with HashiCorp Vault’s Authentication
es: Trabajar con la autenticación de HashiCorp Vault
pt_br: Trabalhando com a autenticação do HashiCorp Vault

source: Generate X.509 certificates with Vault’s PKI Secret Engine.
es: Generar certificados X.509 con el motor PKI Secret de Vault.
pt_br: Gere certificados X.509 com o PKI Secret Engine do Vault.

source: Using HashiCorp Vault’s PKI Secret Engine
es: Uso del motor secreto PKI de HashiCorp Vault
pt_br: Usando o PKI Secret Engine do HashiCorp Vault

source: This guides explains how to use the Vault credentials provider or implement your own custom one.
es: Esta guía explica cómo utilizar el proveedor de credenciales de Vault o implementar uno propio personalizado.
pt_br: Este guia explica como usar o provedor de credenciais do Vault ou implementar seu próprio provedor personalizado.

source: Credentials Provider
es: Proveedor de credenciales
pt_br: Provedor de credenciais

source: This guide demonstrates how your Quarkus application can use WebAuthn authentication instead of passwords.
es: Esta guía demuestra cómo su aplicación Quarkus puede utilizar una base de datos para almacenar sus identidades de usuario.
pt_br: Este guia demonstra como seu aplicativo Quarkus pode usar a autenticação WebAuthn em vez de senhas.

source: security,webauthn
es: seguridad,webauthn

source: Using Security with WebAuthn
es: Uso de la seguridad con WebAuthn
pt_br: Usando a segurança com WebAuthn

source: business-automation
es: negocio-automatización

source: Business Automation
es: Automatización de negocio
pt_br: Automação comercial

source: This guide demonstrates how your Quarkus application can use Kogito to add business automation to power it up with business processes and rules.
es: Esta guía demuestra cómo su aplicación Quarkus puede utilizar Kogito para añadir automatización de negocios para potenciarla con procesos y reglas de negocios.
pt_br: Este guia demonstra como seu aplicativo Quarkus pode usar o Kogito para adicionar automação comercial para aprimorá-lo com processos e regras de negócios.

source: Using Kogito to add business automation capabilities to an application
es: Uso de Kogito para añadir capacidades de automatización de negocio a una aplicación
pt_br: Usando o Kogito para adicionar recursos de automação comercial a um aplicativo

source: Use Kogito to add business automation and power it up with DMN decision support.
es: Utilice Kogito para añadir la automatización del negocio y potenciarla con el apoyo a la toma de decisiones de DMN.
pt_br: Use o Kogito para adicionar automação comercial e aprimorá-la com o suporte a decisões DMN.

source: Using Kogito DMN support to add decision automation capabilities to an application
es: Uso del soporte de Kogito DMN para añadir capacidades de automatización de decisiones a una aplicación
pt_br: Usando o suporte ao Kogito DMN para adicionar recursos de automação de decisões a um aplicativo

source: Use Kogito to add DRL files with rules.
es: Utilice Kogito para añadir archivos DRL con reglas.
pt_br: Use o Kogito para adicionar arquivos DRL com regras.

source: Using Kogito to add rule engine capabilities to an application
es: Uso de Kogito para añadir capacidades de motor de reglas a una aplicación
pt_br: Usando o Kogito para adicionar recursos de mecanismo de regras a um aplicativo

source: Use Kogito to add business automation to power it up with predictions.
es: Utiliza Kogito para añadir la automatización del negocio y potenciarlo con predicciones.
pt_br: Use o Kogito para adicionar automação comercial para potencializá-lo com previsões.

source: Using Kogito to add prediction capabilities to an application
es: Uso de Kogito para añadir capacidades de predicción a una aplicación
pt_br: Usando o Kogito para adicionar recursos de previsão a um aplicativo

source: Start Kogito automatically in dev and test modes.
es: Inicie Kogito automáticamente en los modos de desarrollo y prueba.
pt_br: Inicie o Kogito automaticamente nos modos de desenvolvimento e teste.

source: This guide walks you through the process of creating a Quarkus application with OptaPlanner's constraint solving Artificial Intelligence (AI).
es: Esta guía le guía a través del proceso de creación de una aplicación Quarkus con la Inteligencia Artificial (IA) de OptaPlanner para la resolución de restricciones.
pt_br: Este guia orienta você pelo processo de criação de um aplicativo Quarkus com a Inteligência Artificial (IA) de resolução de restrições do OptaPlanner.

source: Using AI to optimize a schedule with OptaPlanner
es: Utilización de la IA para optimizar un horario con OptaPlanner
pt_br: Usando IA para otimizar um cronograma com o OptaPlanner

source: integration
es: integración

source: Integration
es: Integración
pt_br: Integração

source: This guide covers the systems integration with Apache Camel
es: Esta guía cubre la integración de sistemas con Apache Camel
pt_br: Este guia aborda a integração de sistemas com o Apache Camel

source: command-line
es: línea de comandos
pt_br: linha de comando

source: Command Line Applications
es: Aplicaciones de línea de comandos
pt_br: Aplicativos de linha de comando

source: Simplify command line applications creation with the Picocli extension.
es: Simplifique la creación de aplicaciones de línea de comandos con la extensión Picocli.
pt_br: Simplifique a criação de aplicativos de linha de comando com a extensão Picocli.

source: Easy Quarkus-based scripting with jbang.
es: Fácil de usar, basado en Quarkus, con jbang.
pt_br: Script fácil baseado em Quarkus com jbang.

source: jbang Integration
es: integración jbang
pt_br: integração jbang

source: cloud
es: nube

source: Cloud
es: Nube

source: Learn how to use SmallRye Stork for service discovery and load balacing.
es: Aprenda a utilizar SmallRye Stork para el descubrimiento de servicios y el equilibrio de carga.

source: Service discovery and load balancing with Stork
es: Descubrimiento de servicios y equilibrio de carga con Stork
pt_br: Descoberta de serviços e balanceamento de carga com o Stork

source: Learn how to use SmallRye Stork in a Kubernetes environment.
es: Aprenda a utilizar SmallRye Stork para el descubrimiento de servicios y el equilibrio de carga.
pt_br: Saiba como usar o SmallRye Stork em um ambiente Kubernetes.

source: Using Stork with Kubernetes
es: Uso de la seguridad con el archivo .properties
pt_br: Usando o Stork com o Kubernetes

source: Have a more in-depth look at how SmallRye Stork can be configured and used.
es: Vea con más detalle cómo se puede configurar y utilizar SmallRye Stork.
pt_br: Veja mais detalhadamente como o SmallRye Stork pode ser configurado e usado.

source: Stork Reference
es: Referencia de la cigüeña
pt_br: Referência do Stork

source: Learn how to build and push container images with Jib, S2I or Docker as part of the Quarkus build.
es: Aprende a construir y empujar imágenes de contenedores con Jib, S2I o Docker como parte de la construcción de Quarkus.
pt_br: Saiba como criar e enviar imagens de contêiner com Jib, S2I ou Docker como parte da compilação do Quarkus.

source: Build Container Images
es: Construir imágenes de contenedores
pt_br: Criar imagens de contêiner

source: Use Podman instead of Docker for running containers.
es: Utilice Podman en lugar de Docker para ejecutar contenedores.
pt_br: Use o Podman em vez do Docker para executar contêineres.

source: Using Podman
es: Uso de Kotlin
pt_br: Usando o Podman

source: This guide covers how to deploy a native application on Kubernetes.
es: Esta guía cubre cómo desplegar una aplicación nativa en Kubernetes.
pt_br: Este guia aborda como implantar um aplicativo nativo no Kubernetes.

source: Deploying Quarkus Applications on Kubernetes
es: Despliegue de aplicaciones Quarkus en Kubernetes
pt_br: Implantando Aplicações Quarkus no Kubernetes

source: This guide covers how to deploy a native application on OpenShift.
es: Esta guía cubre cómo desplegar una aplicación nativa en OpenShift.
pt_br: Este guia aborda como implantar um aplicativo nativo no OpenShift.

source: Deploying Quarkus Applications on OpenShift
es: Despliegue de aplicaciones Quarkus en OpenShift
pt_br: Implantando Aplicações Quarkus no OpenShift

source: Use ConfigMaps as a configuration source for your Quarkus applications.
es: Utilice ConfigMaps como fuente de configuración para sus aplicaciones Quarkus.
pt_br: Use ConfigMaps como uma fonte de configuração para seus aplicativos Quarkus.

source: Consuming Kubernetes ConfigMaps
es: Consumir Kubernetes ConfigMaps
pt_br: Consumindo o Kubernetes ConfigMaps

source: This guide demonstrates how to use the Fabric8 Kubernetes client to interact with your Kubernetes cluster.
es: Esta guía muestra cómo utilizar el cliente Fabric8 Kubernetes para interactuar con su clúster Kubernetes.
pt_br: Este guia demonstra como usar o Fabric8 Kubernetes Client para interagir com seu cluster Kubernetes.

source: Using the Kubernetes Client to Interact with a Kubernetes Cluster
es: Uso del cliente de Kubernetes para interactuar con un clúster de Kubernetes
pt_br: Usando o Kubernetes Client para interagir com um cluster Kubernetes

source: This guide explains how to deploy a Quarkus application to Microsoft Azure Cloud.
es: Esta guía explica cómo desplegar una aplicación Quarkus en Microsoft Azure Cloud.
pt_br: Este guia explica como implantar um aplicativo Quarkus na Nuvem do Microsoft Azure.

source: Deploying to Microsoft Azure Cloud
es: Despliegue en la nube de Microsoft Azure
pt_br: Implantando na nuvem do Microsoft Azure

source: This guide explains how you can deploy Vert.x Web, Servlet, or RESTEasy microservices as an Azure Function.
es: Esta guía explica cómo puede desplegar los microservicios Vert.x Web, Servlet o RESTEasy como una función Azure.
pt_br: Este guia explica como você pode implantar microsserviços Vert.x Web, Servlet ou RESTEasy como uma Função do Azure.

source: Azure Functions (Serverless) with Vert.x Web, Servlet, or RESTEasy
es: Azure Functions (Serverless) con Vert.x Web, Servlet o RESTEasy
pt_br: Azure Functions (Serverless) com Vert.x Web, Servlet ou RESTEasy

source: This guide explains how you can deploy Quarkus-based Amazon Lambdas.
es: Esta guía explica cómo puede desplegar Amazon Lambdas basado en Quarkus.
pt_br: Este guia explica como você pode implantar o Amazon Lambdas baseado em Quarkus.

source: This guide explains how you can deploy Vert.x Web, Servlet, or RESTEasy microservices as an Amazon Lambda.
es: En esta guía se explica cómo puede implementar microservicios Vert.x Web, Servlet o RESTEasy como Amazon Lambda.
pt_br: Este guia explica como você pode implantar microsserviços Vert.x Web, Servlet ou RESTEasy como um Amazon Lambda.

source: Amazon Lambda with Vert.x Web, Servlet, or RESTEasy
es: Amazon Lambda con Vert.x Web, Servlet o RESTEasy
pt_br: Amazon Lambda com Vert.x Web, Servlet ou RESTEasy

source: This guide explains how to deploy a Quarkus application to Google Cloud.
es: Esta guía explica cómo desplegar una aplicación Quarkus en Google Cloud.
pt_br: Este guia explica como implantar um aplicativo Quarkus no Google Cloud.

source: Deploying to Google Cloud
es: Implantación en Google Cloud
pt_br: Implantação no Google Cloud

source: This guide explains how you can deploy Quarkus-based Google Cloud Functions.
es: Esta guía explica cómo puede desplegar Google Cloud Functions basado en Quarkus.
pt_br: Este guia explica como você pode implantar o Google Cloud Functions baseado em Quarkus.

source: Google Cloud Functions
es: Funciones de Google Cloud

source: This guide explains how you can deploy Vert.x Web, Servlet, or RESTEasy microservices as a Google Cloud Function.
es: Esta guía explica cómo puede desplegar microservicios Vert.x Web, Servlet o RESTEasy como una función de Google Cloud.
pt_br: Este guia explica como você pode implantar microsserviços Vert.x Web, Servlet ou RESTEasy como uma função do Google Cloud.

source: Google Cloud Functions with Vert.x Web, Servlet, or RESTEasy
es: Google Cloud Functions con Vert.x Web, Servlet o RESTEasy
pt_br: Google Cloud Functions com Vert.x Web, Servlet ou RESTEasy

source: Deploy your Quarkus applications on Heroku.
es: Despliegue sus aplicaciones Quarkus en Heroku.
pt_br: Implante seus aplicativos Quarkus na Heroku.

source: Deploying to Heroku
es: Despliegue en Heroku
pt_br: Implantando na Heroku

source: This guide explains basics of the Funqy framework, a simple portable cross-provider cloud function API.
es: Esta guía explica los fundamentos del marco de trabajo Funqy, una sencilla y portátil API de funciones en la nube entre proveedores.
pt_br: Este guia explica os conceitos básicos da estrutura Funqy, uma API de função de nuvem portátil simples entre provedores.

source: This guide explains Funqy's HTTP binding.
es: Esta guía explica el enlace HTTP de Funqy.
pt_br: Este guia explica a associação HTTP do Funqy.

source: This guide explains Funqy's Amazon Lambda binding.
es: Esta guía explica el enlace de Amazon Lambda de Funqy.
pt_br: Este guia explica a associação do Amazon Lambda do Funqy.

source: This guide explains Funqy's Amazon Lambda HTTP binding.
es: Esta guía explica el enlace HTTP de Amazon Lambda de Funqy.
pt_br: Este guia explica a associação HTTP do Amazon Lambda do Funqy.

source: This guide explains Funqy's Knative Events binding.
es: Esta guía explica la vinculación de Knative Events de Funqy.
pt_br: Este guia explica a associação Knative Events do Funqy.

source: Quarkus Funqy Knative Events
es: Eventos de Quarkus Funqy Knative

source: This guide explains Funqy's Azure Functions HTTP binding.
es: Esta guía explica el enlace HTTP de Azure Functions de Funqy.
pt_br: Este guia explica a associação HTTP do Azure Functions do Funqy.

source: This guide explains Funqy's Google Cloud Platform Functions binding.
es: Esta guía explica la vinculación de Funqy con Google Cloud Platform Functions.
pt_br: Este guia explica a vinculação do Google Cloud Platform Functions da Funqy.

source: This guide explains Funqy's Google Cloud Platform Functions HTTP binding.
es: Esta guía explica el enlace HTTP de las funciones de Google Cloud Platform de Funqy.
pt_br: Este guia explica a vinculação HTTP do Google Cloud Platform Functions da Funqy.

source: This guide covers how to use the Amazon Key Management Service in Quarkus.
es: Esta guía cubre cómo utilizar el Servicio de Gestión de Claves de Amazon en Quarkus.
pt_br: Este guia aborda como usar o Amazon Key Management Service no Quarkus.

source: Amazon KMS
es: KMS de Amazon

source: This guide covers how to use the Amazon Identity and Access Management in Quarkus.
es: Esta guía cubre cómo utilizar Amazon Identity and Access Management en Quarkus.
pt_br: Este guia aborda como usar o Amazon Identity and Access Management no Quarkus.

source: This guide covers how to use the Amazon Simple Email Service in Quarkus.
es: Esta guía cubre cómo utilizar el Amazon Simple Email Service en Quarkus.
pt_br: Este guia aborda como usar o Amazon Simple Email Service no Quarkus.

source: This guide covers how to use the Amazon Simple Notification Service in Quarkus.
es: Esta guía cubre cómo utilizar el Servicio de Notificación Simple de Amazon en Quarkus.
pt_br: Este guia aborda como usar o Amazon Simple Notification Service no Quarkus.

source: This guide covers how to use the Amazon Simple Queue Service in Quarkus.
es: Esta guía cubre cómo utilizar Amazon Simple Queue Service en Quarkus.
pt_br: Este guia aborda como usar o Amazon Simple Queue Service no Quarkus.

source: This guide covers how to use the AWS Systems Manager in Quarkus.
es: Esta guía cubre cómo usar el AWS Systems Manager en Quarkus.
pt_br: Este guia aborda como usar o AWS Systems Manager no Quarkus.

source: This guide covers how to use multiple GCP services.
es: Esta guía cubre cómo utilizar múltiples servicios de GCP.
pt_br: Este guia aborda como usar vários serviços GCP.

source: Access Google Cloud services
es: Acceder a los servicios de Google Cloud

source: observability
es: observabilidad

source: Observability
es: Observabilidad
pt_br: Observabilidade

source: This guide demonstrates how your Quarkus application can utilize the SmallRye Health extension.
es: Esta guía demuestra cómo su aplicación Quarkus puede utilizar la extensión SmallRye Health.
pt_br: Este guia demonstra como sua aplicação Quarkus pode utilizar a extensão SmallRye Health.

source: Using Health Check
es: Uso del chequeo de salud
pt_br: Usando Health Check

source: This guide explains how your Quarkus application can utilize OpenTelemetry to provide distributed tracing for interactive web applications.
es: Esta guía explica cómo su aplicación Quarkus puede utilizar OpenTelemetry para proporcionar rastreo distribuido para aplicaciones web interactivas.
pt_br: Este guia explica como sua aplicação Quarkus pode utilizar o OpenTelemetry para fornecer rastreamento distribuído para aplicativos Web interativos.

source: Using OpenTelemetry
es: Uso de OpenTelemetry
pt_br: Usando OpenTelemetry

source: This guide explains how your Quarkus application can utilize OpenTracing to provide distributed tracing for interactive web applications.
es: Esta guía explica cómo su aplicación Quarkus puede utilizar OpenTracing para proporcionar un rastreo distribuido para aplicaciones web interactivas.
pt_br: Este guia explica como sua aplicação Quarkus pode utilizar o OpenTracing para fornecer rastreamento distribuído para aplicativos Web interativos.

source: Using OpenTracing
es: Uso de OpenTracing
pt_br: Usando o OpenTracing

source: This guide demonstrates how your Quarkus application can collect metrics using the Micrometer extension.
es: Esta guía demuestra cómo su aplicación Quarkus puede recoger métricas utilizando la extensión Micrometer.
pt_br: Este guia demonstra como sua aplicação Quarkus pode coletar métricas usando a extensão Micrometer.

source: Collecting Metrics with Micrometer
es: Recogida de métricas con Micrometer
pt_br: Coletando métricas com Micrometer

source: This guide demonstrates how your Quarkus application can utilize the SmallRye Metrics extension.
es: Esta guía demuestra cómo su aplicación Quarkus puede utilizar la extensión SmallRye Metrics.
pt_br: Este guia demonstra como sua aplicação Quarkus pode utilizar a extensão SmallRye Metrics.

source: Collecting Metrics with SmallRye Metrics
es: Recogida de métricas con SmallRye Metrics
pt_br: Coletando métricas com o SmallRye Metrics

source: This guide demonstrates how your Quarkus application can utilize the SmallRye Fault Tolerance extension.
es: Esta guía demuestra cómo su aplicación Quarkus puede utilizar la extensión SmallRye Fault Tolerance.
pt_br: Este guia demonstra como sua aplicação Quarkus pode utilizar a extensão SmallRye Fault Tolerance.

source: This guide explains how to use Sentry to monitor your application and be notified when exceptions occur.
es: Esta guía explica cómo utilizar Sentry para supervisar su aplicación y ser notificado cuando se producen excepciones.
pt_br: Este guia explica como usar o Sentry para monitorar sua aplicação e ser notificado quando ocorrerem exceções.

source: Using Sentry to Monitor your Logs
es: Uso de Sentry para supervisar sus registros
pt_br: Utilizar o Sentry para monitorizar os seus registos

source: This guide explains how to centralize your logs with Logstash or Fluentd using the Graylog Extended Log Format (GELF).
es: Esta guía explica cómo centralizar sus registros con Logstash o Fluentd utilizando el formato de registro extendido Graylog (GELF).
pt_br: Este guia explica como centralizar seus logs com Logstash ou Fluentd usando o Graylog Extended Log Format (GELF).

source: Centralized Log Management
es: Gestión centralizada de registros
pt_br: Gerenciamento centralizado de logs

source: serialization
es: serialización

source: Serialization
es: Serialización
pt_br: Serialização

source: Writing REST JSON Services
es: Escribir servicios REST JSON
pt_br: Escrevendo serviços JSON REST

source: Entry point for everything gRPC.
es: Punto de entrada para todo lo relacionado con gRPC.
pt_br: Ponto de entrada para tudo o que é gRPC.
