Repository: quarkusio/pt.quarkus.io
Catalog: l10n/po/*/_data/guides-latest.yaml.po
Languages: es, pt_br

source: getting-started
es: para-empezar

source: Getting Started
es: Para empezar
pt_br: Primeiros passos

source: Discover how to create your first Quarkus application.
es: Descubra cómo crear su primera aplicación Quarkus.
pt_br: Descubra como criar sua primeira aplicação Quarkus.

source: Be Guided Through First Application
es: Ser guiado a través de la primera aplicación
pt_br: Ser guiado na primeira aplicação

source: Learn more about developing reactive applications with Quarkus.
es: Aprenda más sobre el desarrollo de aplicaciones reactivas con Quarkus.
pt_br: Saiba mais sobre como desenvolver aplicações reativas com o Quarkus.

source: Getting Started with Reactive
es: Introducción a Reactive
pt_br: Introdução ao Reativo

source: Build native executables with GraalVM or Mandrel.
es: Construir ejecutables nativos con GraalVM o Mandrel.
pt_br: Crie executáveis nativos com GraalVM ou Mandrel.

source: Building Native Executables
es: Creación de ejecutables nativos
pt_br: Criando executáveis nativos

source: Explore the Quarkus developer toolchain which makes Quarkus development so fast and enjoyable.
es: Explore las herramientas para desarrolladores de Quarkus que hace que el desarrollo de Quarkus sea tan rápido y agradable.
pt_br: Explore a cadeia de ferramentas para desenvolvedores do Quarkus, que torna o desenvolvimento do Quarkus tão rápido e agradável.

source: Using our Tooling
es: Utilización de nuestras herramientas
pt_br: Usando nossas ferramentas

source: Learn more about Quarkus integrations in IDEs.
es: Aprenda más sobre las integraciones de Quarkus en IDEs.
pt_br: Saiba mais sobre as integrações do Quarkus em IDEs.

source: Quarkus Tools in your favorite IDE
es: Herramientas Quarkus en su IDE favorito
pt_br: Ferramentas do Quarkus no seu IDE favorito

source: core
es: núcleo
pt_br: núcleo

source: Core
es: Núcleo
pt_br: Núcleo

source: Hardcoded values in your code is a no go (even if we all did it at some point ;-)). In this guide, we learn how to configure your application.
es: Los valores con codificación fija en tu código son inapropiados (aunque todos lo hayamos hecho alguna vez ;-)). En esta guía, aprenderemos a configurar su aplicación.
pt_br: Os valores codificados no seu código não são permitidos (mesmo que todos nós o tenhamos feito em algum momento ;-)). Neste guia, vamos aprender a configurar a sua aplicação.

source: Configuring Your Application
es: Configuración de la aplicación
pt_br: Configurar a sua aplicação

source: Learn more about how to configure your Quarkus applications.
es: Aprenda más sobre cómo configurar sus aplicaciones Quarkus.
pt_br: Saiba mais sobre como configurar as suas aplicações Quarkus.

source: Configuration Reference
es: Referencia de configuración
pt_br: Referência de configuração

source: Group multiple configuration properties into an object.
es: Agrupa varias propiedades de configuración en un objeto.
pt_br: Agrupa várias propriedades de configuração num objeto.

source: Mapping Configuration to Objects
es: Asignación de la configuración a los objetos
pt_br: Mapeando a configuração para objetos

source: Extend and customize the Configuration.
es: Amplía y personaliza la Configuración.
pt_br: Estenda e personalize a Configuração.

source: Extending Configuration Support
es: Ampliación del soporte de configuración
pt_br: Estendendo o suporte à configuração

source: YAML as a Configuration Source.
es: YAML como fuente de configuración.
pt_br: YAML como uma fonte de configuração.

source: YAML Configuration
es: Configuración YAML
pt_br: Configuração YAML

source: List all the configuration properties per extensions
es: Lista de todas las propiedades de configuración por extensiones
pt_br: Listar todas as propriedades de configuração por extensões

source: All Configuration Properties
es: Todas las propiedades de configuración
pt_br: Todas as propriedades de configuração

source: You often need to execute custom actions when the application starts and clean up everything when the application stops. This guide explains how to be notified when an application stops or starts.
es: A menudo es necesario ejecutar acciones personalizadas cuando la aplicación se inicia y limpiar todo cuando la aplicación se detiene. Esta guía explica cómo recibir notificaciones cuando una aplicación se detiene o se inicia.
pt_br: Muitas vezes, você precisa executar ações personalizadas quando a aplicação é iniciada e limpar tudo quando o aplicativo para. Este guia explica como ser notificado quando um aplicativo para ou é iniciado.

source: lifecycle event
es: evento del ciclo de vida
pt_br: evento do ciclo de vida

source: Application Initialization and Termination
es: Inicialización y terminación de la aplicación
pt_br: Inicialização e encerramento da aplicação

source: Quarkus DI solution is based on the [Contexts and Dependency Injection for Java 2.0](https://docs.jboss.org/cdi/spec/2.0/cdi-spec) specification. This guide explains the basics of CDI.
es: La solución DI de Quarkus está basada en la especificación [Contextos e Inyección de Dependencia para Java 2.0](https://docs.jboss.org/cdi/spec/2.0/cdi-spec). Esta guía explica los fundamentos de CDI.
pt_br: A solução Quarkus DI é baseada na especificação [Contexts and Dependency Injection for Java 2.0] https://docs.jboss.org/cdi/spec/2.0/cdi-spec . Este guia explica os princípios básicos do CDI.

source: qualifier event interceptor observer arc
es: calificador interceptor de eventos arco observador

source: Introduction to CDI
es: Introducción al CDI
pt_br: Introdução à CDI

source: Go more in depth into the Quarkus implementation of CDI.
es: Profundizar en la implementación de Quarkus de CDI.
pt_br: Aprofunde-se na implementação do CDI no Quarkus.

source: arc
es: arco

source: CDI Reference
es: Referencia CDI
pt_br: Referência CDI

source: Learn more about how to develop reactive applications with Quarkus.
es: Aprenda más sobre cómo desarrollar aplicaciones reactivas con Quarkus.
pt_br: Saiba mais sobre como desenvolver aplicações reactivas com o Quarkus.

source: Mutiny, Reactive for Bare Mortals
es: Mutiny, reactivo para mortales desnudos
pt_br: Mutiny, reativo para simples mortais

source: This guide covers: * Testing in JVM mode * Testing in native mode * Injection of resources into tests
es: Esta guía cubre: * Pruebas en modo JVM * Pruebas en modo nativo * Inyección de recursos en las pruebas
pt_br: Este guia aborda: * Testes no modo JVM * Testes no modo nativo * Injeção de recursos nos testes

source: Testing Your Application
es: Probar su aplicación
pt_br: Testando a sua aplicação

source: Get early test feedback with Continuous Testing.
es: Obtenga una retroalimentación temprana de las pruebas con las pruebas continuas.
pt_br: Obtenha feedback antecipado sobre os testes com o Teste Contínuo.

source: Continuous Testing
es: Pruebas continuas
pt_br: Testes contínuos

source: A list of all extensions that support Dev Services and their configuration options.
es: Una lista de todas las extensiones que soportan Dev Services y sus opciones de configuración.
pt_br: Uma lista de todas as extensões que suportam Dev Services e as suas opções de configuração.

source: Automatic Service Setup with Dev Services
es: Configuración automática de servicios con Dev Services
pt_br: Configuração automática de serviços com Dev Services

source: This guide explains logging and how to configure it.
es: Esta guía explica el registro y cómo configurarlo.
pt_br: Este guia explica o registro em log e como configurá-lo.

source: Configuring Logging
es: Configuración del registro
pt_br: Configurando o registro em log

source: This reference guide explains how to develop command line applications with Quarkus.
es: Esta guía de referencia explica cómo desarrollar aplicaciones de línea de comandos con Quarkus.
pt_br: Este guia de referência explica como desenvolver aplicações de linha de comandos com o Quarkus.

source: Command Mode Reference
es: Referencia del Modo de Comando
pt_br: Referência do modo de comando

source: Learn more about how you can pass contextual information with SmallRye Context Propagation.
es: Obtenga más información sobre cómo puede pasar información contextual con SmallRye Context Propagation.
pt_br: Saiba mais sobre como você pode passar informações contextuais com o SmallRye Context Propagation.

source: Context Propagation
es: Propagación del contexto
pt_br: Propagação de contexto

source: In this guide, we will discuss how you can get your native executables to support SSL, as native executables don't support it out of the box.
es: En esta guía, discutiremos cómo puedes hacer que tus ejecutables nativos soporten SSL, ya que los ejecutables nativos no lo soportan de forma inmediata.
pt_br: Neste guia, discutiremos como você pode obter seus executáveis nativos para oferecer suporte a SSL, já que os executáveis nativos não oferecem suporte imediato a ele.

source: Using SSL With Native Executables
es: Uso de SSL con ejecutables nativos
pt_br: Usando SSL com executáveis nativos

source: Learn more about the base runtime image used by Quarkus for native executables and how you can tweak it.
es: Aprenda más sobre la imagen base de tiempo de ejecución utilizada por Quarkus para los ejecutables nativos y cómo puede ajustarla.
pt_br: Saiba mais sobre a imagem de tempo de execução base usada pelo Quarkus para executáveis nativos e como você pode ajustá-la.

source: Base Runtime Image for Native Executables
es: Imagen base de tiempo de ejecución para ejecutables nativos
pt_br: Imagem de tempo de execução base para executáveis nativos

source: Learn how you can reduce the size of your native executables with UPX.
es: Aprenda cómo puede reducir el tamaño de sus ejecutables nativos con UPX.
pt_br: Saiba como você pode reduzir o tamanho de seus executáveis nativos com UPX.

source: Compress Native Executables with UPX
es: Comprimir ejecutables nativos con UPX
pt_br: Compactar executáveis nativos com UPX

source: This guide is a collection of tips to help you solve the problems you encounter when compiling applications to native executable.
es: Esta guía es una recopilación de consejos que le ayudarán a resolver los problemas que encuentre al compilar aplicaciones en un ejecutable nativo.
pt_br: Este guia é uma coleção de dicas para ajudá-lo a resolver os problemas encontrados ao compilar aplicativos para executável nativo.

source: Writing Native Applications
es: Escribir aplicaciones nativas
pt_br: Escrever aplicações nativas

source: Explore in more details how to debug native executables.
es: Explora con más detalle cómo depurar ejecutables nativos.
pt_br: Explore com mais detalhes como depurar executáveis nativos.

source: Native Reference
es: Referencia nativa
pt_br: Referência nativa

source: JSON is now the lingua franca between microservices. In this guide, we see how you can get your REST services to consume and produce JSON payloads.
es: JSON es ahora la lengua franca entre los microservicios. En esta guía, vemos cómo puedes conseguir que tus servicios REST consuman y produzcan JSON payloads.
pt_br: O JSON é agora a língua franca entre os microsserviços. Neste guia, veremos como você pode fazer com que seus serviços REST consumam e produzam JSON.

source: Introduction to writing REST JSON Services
es: Introducción a la escritura de servicios REST JSON
pt_br: Introdução à escrita de serviços REST JSON

source: Discover how to develop highly scalable REST services with JAX-RS and RESTEasy Reactive.
es: Descubra cómo desarrollar servicios REST altamente escalables con JAX-RS y RESTEasy Reactive.
pt_br: Descubra como desenvolver serviços REST altamente escaláveis com JAX-RS e RESTEasy Reactive.

source: Writing REST Services Reference
es: Escribir servicios REST de referencia
pt_br: Referência de escrita de serviços REST

source: This guide explains how to use the RESTEasy Reactive REST Client.
es: Esta guía explica cómo utilizar el Cliente REST Reactivo de RESTEasy.
pt_br: Este guia explica como utilizar o cliente RESTEasy Reactive REST.

source: Using the REST Client (including JSON)
es: Uso del cliente REST (incluyendo JSON)
pt_br: Utilizar o cliente REST (incluindo JSON)

source: This guide explains how to migrate an application from RESTEasy Classic to RESTEasy Reactive.
es: Esta guía explica cómo migrar una aplicación de RESTEasy Classic a RESTEasy Reactive.
pt_br: Este guia explica como migrar um aplicativo do RESTEasy Classic para o RESTEasy Reactive.

source: Migrating from RESTEasy Classic to RESTEasy Reactive
es: Migración de RESTEasy Classic a RESTEasy Reactive
pt_br: Migrando do RESTEasy Classic para o RESTEasy Reactive

source: Hibernate ORM REST Data with Panache simplifies the creation of CRUD applications based on JAX-RS and Hibernate ORM.
es: Hibernate ORM REST Data with Panache simplifica la creación de aplicaciones CRUD basadas en JAX-RS y Hibernate ORM.
pt_br: Hibernate ORM REST Data with Panache simplifica a criação de aplicativos CRUD baseados em JAX-RS e Hibernate ORM.

source: Writing Simple REST CRUD Services
es: Escribir servicios REST CRUD sencillos
pt_br: Escrevendo serviços REST CRUD simples

source: This guide covers how to use Hibernate Validator/Bean Validation in your REST services.
es: Esta guía cubre cómo utilizar Hibernate Validator/Bean Validation en sus servicios REST.
pt_br: Este guia aborda a forma de utilizar o validador Hibernate/Bean Validation nos seus serviços REST.

source: Validation with Hibernate Validator
es: Validación con Hibernate Validator
pt_br: Validação com o Hibernate Validator

source: This guide explains how to use the RESTEasy REST Client to send multipart REST requests, typically to upload documents.
es: Esta guía explica cómo utilizar el Cliente REST de RESTEasy para enviar solicitudes REST multiparte, normalmente para cargar documentos.
pt_br: Este guia explica como usar o RESTEasy REST Client para enviar solicitações REST multipart, normalmente para carregar documentos.

source: Using the REST Client with Multipart
es: Uso del cliente REST con Multipart
pt_br: Utilizar o cliente REST com Multipart

source: This guide explains how your Quarkus application can utilize web sockets to create interactive web applications. Because it’s the canonical web socket application, we are going to create a simple chat application.
es: Esta guía explica cómo su aplicación Quarkus puede utilizar los sockets web para crear aplicaciones web interactivas. Debido a que es la aplicación de sockets web canónica, vamos a crear una aplicación de chat simple.
pt_br: Este guia explica como seu aplicativo Quarkus pode utilizar Websockets para criar aplicações web interativos. Como é um aplicativo websocket canônico, vamos criar um aplicativo de bate-papo simples.

source: Using WebSockets
es: Uso de WebSockets
pt_br: Usando WebSockets

source: This guide explains how to use the OpenAPI extension to generate an OpenAPI descriptor and get a Swagger UI frontend to test your REST endpoints.
es: Esta guía explica cómo utilizar la extensión OpenAPI para generar un descriptor OpenAPI y obtener un frontend de Swagger UI para probar tus endpoints REST.
pt_br: Este guia explica como usar a extensão OpenAPI para gerar um descritor OpenAPI e obter um front-end da interface do usuário do Swagger para testar seus endpoints REST.

source: Using OpenAPI and Swagger UI
es: Uso de OpenAPI y Swagger UI
pt_br: Utilizar OpenAPI e Swagger UI

source: This guide explains how to use the RESTEasy REST Client in order to interact with REST APIs (JSON and other) with very little effort.
es: Esta guía explica cómo utilizar el cliente RESTEasy REST para interactuar con las APIs REST (JSON y otras) con muy poco esfuerzo.
pt_br: Este guia explica como utilizar o RESTEasy REST Client para interagir com APIs REST (JSON e outras) com muito pouco esforço.

source: Developing REST Services with RESTEasy Classic
es: Desarrollo de servicios REST con RESTEasy Classic
pt_br: Desenvolvimento de serviços REST com o RESTEasy Classic

source: Using the RESTEasy Classic REST Client (including JSON)
es: Uso del cliente REST clásico de RESTEasy (incluyendo JSON)
pt_br: Usando o cliente RESTEasy Classic REST (incluindo JSON)

source: Learn more about configuring Quarkus' Vert.x based HTTP layer - and Undertow if you are using servlets.
es: Aprenda más sobre la configuración de la capa HTTP basada en Vert.x de Quarkus - y Undertow si está usando servlets.
pt_br: Saiba mais sobre como configurar a camada HTTP baseada em Vert.x do Quarkus - e Undertow se você estiver usando servlets.

source: HTTP Reference Documentation
es: Documentación de referencia HTTP
pt_br: Documentação de referência HTTP

source: This guide demonstrates how your Quarkus application can utilize the SmallRye Fault Tolerance specification through the SmallRye Fault Tolerance extension.
es: Esta guía demuestra cómo su aplicación Quarkus puede utilizar la especificación SmallRye Fault Tolerance a través de la extensión SmallRye Fault Tolerance.
pt_br: Este guia demonstra como a sua aplicação Quarkus pode utilizar a especificação SmallRye Fault Tolerance através da extensão SmallRye Fault Tolerance.

source: Using Fault Tolerance
es: Uso de la tolerancia a fallos
pt_br: Usando tolerância a falhas

source: This guide demonstrates how to use reactive routes.
es: Esta guía muestra cómo utilizar las rutas reactivas.
pt_br: Este guia demonstra como usar rotas reativas.

source: Using Reactive Routes
es: Uso de rutas reactivas
pt_br: Usando rotas reativas

source: This guide explains how to leverage SmallRye GraphQL to implement GraphQL services.
es: Esta guía explica cómo aprovechar SmallRye GraphQL para implementar servicios GraphQL.
pt_br: Este guia explica como aproveitar o SmallRye GraphQL para implementar serviços GraphQL.

source: Implementing GraphQL Services
es: Implementación de servicios GraphQL
pt_br: Implementando serviços GraphQL

source: This guide explains how to leverage SmallRye GraphQL Client to consume GraphQL services.
es: Esta guía explica cómo aprovechar SmallRye GraphQL Client para consumir servicios GraphQL.
pt_br: Este guia explica como aproveitar o Cliente SmallRye GraphQL para consumir serviços GraphQL.

source: Consuming GraphQL Services
es: Consumo de servicios GraphQL
pt_br: Consumindo serviços GraphQL

source: data
es: datos

source: Data
es: Datos
pt_br: Dados

source: With Quarkus, you can easily configure a datasource, or several if need be.
es: Con Quarkus, puede configurar fácilmente una fuente de datos, o varias si es necesario.
pt_br: Com o Quarkus, você pode configurar facilmente uma fonte de dados ou várias, se necessário.

source: Configuring your datasources
es: Configurar sus fuentes de datos
pt_br: Configurando suas fontes de dados

source: Automatically start database containers with Dev Services.
es: Configuración automática de servicios con Dev Services.
pt_br: Inicie automaticamente contêineres de banco de dados com Dev Services.

source: Database Dev Services
es: Servicios de desarrollo de Elasticsearch
pt_br: Dev Services de banco de dados

source: Hibernate ORM is the de facto JPA implementation and offers you the full breath of an Object Relational Mapper. It works beautifully in Quarkus.
es: Hibernate ORM es la implementación de facto de JPA y le ofrece todo el aliento de un mapeador relacional de objetos. Funciona muy bien en Quarkus.
pt_br: O Hibernate ORM é a implementação JPA de facto e oferece a você o fôlego completo de um Mapeador Relacional de Objetos. Ele funciona muito bem no Quarkus.

source: Using Hibernate ORM and JPA
es: Uso de Hibernate ORM y JPA
pt_br: Usando Hibernate ORM e JPA

source: Hibernate ORM is the de facto JPA implementation and offers you the full breadth of an Object Relational Mapper. It makes complex mappings possible, but it does not make simple and common mappings trivial. Panache focuses on making your entities trivial and fun to write.
es: Hibernate ORM es la implementación de facto de JPA y le ofrece toda la amplitud de un mapeador relacional de objetos. Hace posible mapeos complejos, pero no hace triviales los mapeos simples y comunes. Panache se centra en hacer que sus entidades sean triviales y divertidas de escribir.
pt_br: O Hibernate ORM é a implementação JPA de fato e oferece toda a amplitude de um Mapeador Relacional de Objetos. Ele possibilita mapeamentos complexos, mas não torna triviais mapeamentos simples e comuns. Panache se concentra em tornar suas entidades triviais e divertidas de escrever.

source: Simplified Hibernate ORM with Panache
es: Hibernate ORM simplificado con Panache
pt_br: Hibernate ORM simplificado com Panache

source: This explain the specifics of using Hibernate ORM with Panache in a Kotlin project.
es: Aquí se explican los detalles del uso de Hibernate ORM con Panache en un proyecto Kotlin.
pt_br: Isso explica as especificidades do uso do Hibernate ORM com o Panache em um projeto Kotlin.

source: Simplified Hibernate ORM with Panache and Kotlin
es: Hibernate ORM simplificado con Panache y Kotlin
pt_br: Hibernate ORM simplificado com Panache e Kotlin

source: Hibernate Search allows you to index your entities in an Elasticsearch cluster and easily offer full text search in all your Hibernate ORM-based applications.
es: Hibernate Search le permite indexar sus entidades en un clúster de Elasticsearch y ofrecer fácilmente búsquedas de texto completo en todas sus aplicaciones basadas en Hibernate ORM.
pt_br: O Hibernate Search permite indexar suas entidades em um cluster do Elasticsearch e oferecer facilmente pesquisa de texto completo em todos os aplicativos baseados no Hibernate ORM.

source: Hibernate Search + Elasticsearch
es: Búsqueda en Hibernate + Elasticsearch

source: Quarkus comes with a Transaction Manager and uses it to coordinate and expose transactions to your applications. Each extension dealing with persistence will integrate with it for you. And you will explicitly interact with transactions via CDI. This guide will walk you through all that.
es: Quarkus viene con un Gestor de Transacciones y lo utiliza para coordinar y exponer las transacciones a sus aplicaciones. Cada extensión que se ocupe de la persistencia se integrará con ella por ti. Y usted interactuará explícitamente con las transacciones a través de CDI. Esta guía le guiará a través de todo esto.
pt_br: O Quarkus vem com um Gerenciador de Transações e o usa para coordenar e expor transações para suas aplicações. Cada extensão que lida com persistência irá se integrar com ele para você. E você interagirá explicitamente com as transações via CDI. Este guia irá guiá-lo através de tudo isso.

source: Using Transactions
es: Uso de las transacciones
pt_br: Usando transações

source: This guide explains how to use Blaze-Persistence to simplify your data and DTO layers.
es: Esta guía explica cómo utilizar Blaze-Persistence para simplificar sus datos y capas DTO.
pt_br: Este guia explica como usar o Blaze-Persistence para simplificar suas camadas de dados e DTO.

source: Using Blaze-Persistence
es: Uso de Blaze-Persistence
pt_br: Usando o Blaze-Persistence

source: This guide explains how to cache expensive method calls of your CDI beans using simple annotations.
es: Esta guía explica cómo almacenar en caché las costosas llamadas a métodos de sus beans CDI utilizando simples anotaciones.
pt_br: Este guia explica como armazenar em cache chamadas de método custosas de seus beans CDI usando anotações simples.

source: Cache your application data
es: Almacene los datos de su aplicación en la caché
pt_br: Armazenar em cache os dados da aplicação
