Repository: quarkusio/pt.quarkus.io
Catalog: l10n/po/*/_data/guides-latest.yaml.po
Languages: es, pt_br

source: This guide explains how to start using gRPC in your Quarkus application.
es: Esta guía explica cómo empezar a utilizar gRPC en su aplicación Quarkus.
pt_br: Este guia explica como começar a utilizar o gRPC na sua aplicação Quarkus.

source: Getting Started with gRPC
es: Introducción a gRPC
pt_br: Introdução ao gRPC

source: This guide explains how to implement gRPC services in your Quarkus application.
es: Esta guía explica cómo implementar los servicios gRPC en su aplicación Quarkus.
pt_br: Este guia explica como implementar serviços gRPC na sua aplicação Quarkus.

source: Implementing gRPC Services
es: Implementación de los servicios gRPC
pt_br: Implementando serviços gRPC

source: This guide explains how to consume gRPC services in your Quarkus application.
es: Esta guía explica cómo consumir servicios gRPC en su aplicación Quarkus.
pt_br: Este guia explica como consumir serviços gRPC na sua aplicação Quarkus.

source: Consuming gRPC Services
es: Consumo de servicios gRPC
pt_br: Consumindo serviços gRPC

source: tooling
es: utillaje

source: Tooling
es: Herramientas
pt_br: Ferramentas

source: Use the Quarkus CLI to create, build, run, and manage extensions for Quarkus projects.
es: Utilice la CLI de Quarkus para crear, construir, ejecutar y gestionar extensiones para proyectos de Quarkus.
pt_br: Use a CLI do Quarkus para criar, compilar, executar e gerenciar extensões para projetos Quarkus.

source: Using the Quarkus CLI
es: Uso de la CLI de Quarkus
pt_br: Usando a CLI do Quarkus

source: This guide covers: * Maven configuration * Creating a new project * Dealing with extensions * Development mode * Debugging * Import in your IDE * Building a native executable * Build a container friendly executable
es: Esta guía cubre: * La configuración de Maven * La creación de un nuevo proyecto * El tratamiento de las extensiones * El modo de desarrollo * La depuración * La importación en su IDE * La construcción de un ejecutable nativo * La construcción de un ejecutable amigable con el contenedor
pt_br: Este guia abrange: * Configuração do Maven * Criação de um novo projeto * Lidar com extensões * Modo de desenvolvimento *Depuração * Importar em seu IDE * Construção de um executável nativo * Construa um executável amigável para contêineres

source: Building Applications with Maven
es: Creación de aplicaciones con Maven
pt_br: Criando aplicativos com o Maven

source: This guide covers: * Gradle configuration * Creating a new project * Dealing with extensions * Development mode * Debugging * Import in your IDE * Building a native executable * Build a container friendly executable
es: Esta guía cubre: * La configuración de Gradle * La creación de un nuevo proyecto * El tratamiento de las extensiones * El modo de desarrollo * La depuración * La importación en su IDE * La construcción de un ejecutable nativo * La construcción de un ejecutable amigable con el contenedor
pt_br: Este guia abrange: * Configuração Gradle * Criação de um novo projeto * Lidar com extensões * Modo de desenvolvimento *Depuração * Importar em seu IDE * Construção de um executável nativo * Construa um executável amigável para contêineres

source: Building Applications with Gradle
es: Creación de aplicaciones con Gradle
pt_br: Construindo aplicativos com o Gradle

source: Discover how you can streamline the release process of your Quarkus applications with JReleaser.
es: Descubra cómo puede agilizar el proceso de liberación de sus aplicaciones Quarkus con JReleaser.
pt_br: Descubra como você pode agilizar o processo de release de suas aplicações Quarkus com o JReleaser.

source: Releasing your Quarkus applications with JReleaser
es: Liberación de sus aplicaciones Quarkus con JReleaser
pt_br: Liberando seus aplicativos Quarkus com o JReleaser

source: This guide explains how to measure the test coverage of your Quarkus application.
es: Esta guía explica cómo medir la cobertura de las pruebas de su aplicación Quarkus.
pt_br: Este guia explica como medir a cobertura de teste da sua aplicação Quarkus.

source: Measuring the coverage of your tests
es: Medir la cobertura de sus pruebas
pt_br: Medindo a cobertura de seus testes

source: Use mutable jars to rebuild your application with different build time configurations.
es: Utilice jars mutables para reconstruir su aplicación con diferentes configuraciones de tiempo de compilación.
pt_br: Use JARs mutáveis para reconstruir sua aplicação com diferentes configurações de tempo de compilação.

source: Re-augment a Quarkus Application
es: Volver a medir una aplicación de Quarkus
pt_br: Reajustar uma aplicação Quarkus

source: compatibility
es: compatibilidad

source: Compatibility
es: Compatibilidad
pt_br: Compatibilidade

source: While you are encouraged to use CDI annotations for injection, Quarkus provides a compatibility layer for Spring dependency injection in the form of the spring-di extension.
es: Aunque se recomienda utilizar anotaciones CDI para la inyección, Quarkus proporciona una capa de compatibilidad para la inyección de dependencias de Spring en forma de la extensión spring-di.
pt_br: Embora você seja encorajado a usar anotações CDI para injeção, o Quarkus fornece uma camada de compatibilidade para injeção de dependência do Spring na forma da extensão spring-di.

source: Using the Quarkus Extension for Spring DI API
es: Uso de la extensión de Quarkus para la API de Spring DI
pt_br: Usando a extensão Quarkus para a API do Spring DI

source: While you are encouraged to use JAX-RS annotations for defining REST endpoints, Quarkus provides a compatibility layer for Spring Web in the form of the spring-web extension.
es: Aunque se recomienda utilizar las anotaciones JAX-RS para definir los puntos finales REST, Quarkus proporciona una capa de compatibilidad para Spring Web en forma de la extensión spring-web.
pt_br: Embora você seja encorajado a usar anotações JAX-RS para definir pontos de extremidade REST, o Quarkus fornece uma camada de compatibilidade para o Spring Web na forma da extensão spring-web.

source: Using the Quarkus Extension for Spring Web API
es: Uso de la extensión de Quarkus para la API web de Spring
pt_br: Usando a extensão Quarkus para Spring Web API

source: While you are encouraged to use Hibernate ORM with Panache for your data layer, Quarkus provides a compatibility layer for Spring Data JPA in the form of the spring-data-jpa extension.
es: Aunque se recomienda utilizar Hibernate ORM con Panache para su capa de datos, Quarkus proporciona una capa de compatibilidad para Spring Data JPA en forma de la extensión spring-data-jpa.
pt_br: Embora você seja encorajado a usar o Hibernate ORM com o Panache para sua camada de dados, o Quarkus fornece uma camada de compatibilidade para o Spring Data JPA na forma da extensão spring-data-jpa.

source: Using the Quarkus Extension for Spring Data JPA API
es: Uso de la extensión de Quarkus para la API JPA de Spring Data
pt_br: Usando a extensão Quarkus para a API JPA do Spring Data

source: Spring Data REST simplifies the creation of CRUD applications based on our Spring Data compatibility layer.
es: Spring Data REST simplifica la creación de aplicaciones CRUD basadas en nuestra capa de compatibilidad con Spring Data.
pt_br: O Spring Data REST simplifica a criação de aplicativos CRUD com base em nossa camada de compatibilidade Spring Data.

source: Writing Simple CRUD Applications with Spring Data
es: Escribir aplicaciones CRUD simples con Spring Data
pt_br: Escrevendo aplicativos CRUD simples com Spring Data

source: While you are encouraged to use the Quarkus security layer to secure your applications, Quarkus provides a compatibility layer for Spring Security in the form of the spring-security extension.
es: Aunque se le anima a utilizar la capa de seguridad de Quarkus para asegurar sus aplicaciones, Quarkus proporciona una capa de compatibilidad para Spring Security en la forma de la extensión spring-security.
pt_br: Embora você seja encorajado a usar a camada de segurança do Quarkus para proteger seus aplicativos, o Quarkus fornece uma camada de compatibilidade para o Spring Security na forma da extensão spring-security.

source: Using the Quarkus Extension for Spring Security API
es: Uso de la extensión de Quarkus para la API de seguridad de Spring
pt_br: Usando a extensão Quarkus para a Spring Security API

source: While you are encouraged to use the Cache extension for your application-level caching, Quarkus provides a compatibility layer for Spring Cache in the form of the spring-cache extension.
es: Aunque se recomienda utilizar la extensión Cache para el almacenamiento en caché a nivel de aplicación, Quarkus proporciona una capa de compatibilidad para Spring Cache en forma de la extensión spring-cache.
pt_br: Embora você seja encorajado a usar a extensão Cache para seu cache no nível do aplicativo, o Quarkus fornece uma camada de compatibilidade para o Spring Cache na forma da extensão spring-cache.

source: Using the Quarkus Extension for Spring Cache
es: Uso de la extensión de Quarkus para Spring Cache
pt_br: Usando a extensão Quarkus para Spring Cache

source: While you are encouraged to use the Scheduler or Quartz extensions to schedule tasks, Quarkus provides a compatibility layer for Spring Scheduled in the form of the spring-scheduled extension.
es: Mientras que se le anima a utilizar las extensiones Scheduler o Quartz para programar tareas, Quarkus proporciona una capa de compatibilidad para Spring Scheduled en la forma de la extensión spring-scheduled.
pt_br: Embora você seja encorajado a usar as extensões Scheduler ou Quartz para agendar tarefas, o Quarkus fornece uma camada de compatibilidade para o Spring Scheduled na forma da extensão agendada para primavera.

source: Using the Quarkus Extension for Spring Scheduled
es: Uso de la extensión de Quarkus para Spring Scheduled
pt_br: Usando a extensão Quarkus para Spring Scheduled

source: Use Spring Boot's `@ConfigurationProperties` in place of MicroProfile Config annotations
es: Utilice `@ConfigurationProperties` de Spring Boot en lugar de las anotaciones de configuración de MicroProfile
pt_br: Use o '@ConfigurationProperties' do Spring Boot no lugar das anotações do MicroProfile Config

source: Using Spring Boot's ConfigurationProperties
es: Uso de ConfigurationProperties de Spring Boot
pt_br: Usando ConfigurationProperties do Spring Boot

source: Quarkus provides a compatibility layer for Spring Cloud Config in the form of the spring-cloud-config-client extension.
es: Quarkus proporciona una capa de compatibilidad para Spring Cloud Config en forma de la extensión spring-cloud-config-client.
pt_br: O Quarkus fornece uma camada de compatibilidade para o Spring Cloud Config na forma da extensão spring-cloud-config-client.

source: Using the Quarkus Extension for Spring Cloud Config
es: Uso de la extensión de Quarkus para Spring Cloud Config
pt_br: Usando a extensão Quarkus para o Spring Cloud Config

source: miscellaneous
es: varios

source: Miscellaneous
es: Varios
pt_br: Diversos

source: Modern applications often need to run specific tasks periodically. In this guide, you learn how to schedule periodic tasks.
es: Las aplicaciones modernas a menudo necesitan ejecutar tareas específicas periódicamente. En esta guía, aprenderá a programar tareas periódicas.
pt_br: Aplicações modernas geralmente precisam executar tarefas específicas periodicamente. Neste guia, você aprenderá a agendar tarefas periódicas.

source: Scheduling Periodic Tasks
es: Programación de tareas periódicas
pt_br: Agendamento de Tarefas Periódicas

source: Learn more about the Scheduler extension.
es: Más información sobre la extensión Scheduler.
pt_br: Saiba mais sobre a extensão Scheduler.

source: Scheduler Reference
es: Referencia del programador
pt_br: Referência do Scheduler

source: You need clustering support for your scheduled tasks? This guide explains how to use the Quartz extension for that.
es: ¿Necesita soporte de clustering para sus tareas programadas? Esta guía explica cómo utilizar la extensión Quartz para ello.
pt_br: Você precisa de suporte a clustering para suas tarefas agendadas? Este guia explica como usar a extensão Quartz para isso.

source: Scheduling Clustered Tasks with Quartz
es: Programación de tareas en clúster con Quartz
pt_br: Agendando tarefas clusterizadas com o Quartz

source: Learn more about how you can send email from a Quarkus application with our reactive email client.
es: Aprenda más sobre cómo puede enviar correo electrónico desde una aplicación de Quarkus con nuestro cliente de correo electrónico reactivo.
pt_br: Saiba mais sobre como você pode enviar e-mails de uma aplicação Quarkus com nosso cliente de e-mail reativo.

source: Sending Emails using SMTP
es: Envío de correos electrónicos mediante SMTP
pt_br: Enviando e-mails usando SMTP

source: This reference guide explains in more details the configuration and usage of the Quarkus Mailer.
es: Esta guía de referencia explica con más detalle la configuración y el uso de Quarkus Mailer.
pt_br: Este guia de referência explica com mais detalhes a configuração e o uso do Quarkus Mailer.

source: Mailer Reference Guide
es: Guía de referencia de Mailer
pt_br: Guia de Referência do Mailer

source: Learn more about how you can use templating in your applications with the Qute template engine.
es: Aprenda más sobre cómo puede utilizar las plantillas en sus aplicaciones con el motor de plantillas de Qute.
pt_br: Saiba mais sobre como você pode usar o modelo de modelagem em seus aplicativos com o mecanismo de modelo do Qute.

source: Templating with Qute
es: Plantillas con Qute
pt_br: Modelagem com Qute

source: Learn everything you need to know about the Qute template engine.
es: Aprenda todo lo que necesita saber sobre el motor de plantillas de Qute.
pt_br: Saiba tudo o que você precisa saber sobre o mecanismo de modelo do Qute.

source: Qute Reference Guide
es: Guía de referencia de Qute
pt_br: Guia de Referência do Qute

source: Learn more about how you extract content from documents using the Apache Tika toolkit.
es: Aprenda más sobre cómo extraer contenido de los documentos utilizando el kit de herramientas de Apache Tika.
pt_br: Saiba mais sobre como extrair conteúdo de documentos usando o kit de ferramentas Apache Tika.

source: Extracting Content with Apache Tika
es: Extracción de contenidos con Apache Tika
pt_br: Extraindo conteúdo com o Apache Tika

source: This guide explains how to use Vert.x in Quarkus to build reactive applications.
es: Esta guía explica cómo utilizar Vert.x en Quarkus para construir aplicaciones reactivas.
pt_br: Este guia explica como usar o Vert.x no Quarkus para criar aplicativos reativos.

source: Using Vert.x
es: Uso de Vert.x
pt_br: Usando o Vert.x

source: This reference guide provides advanced details about the usage and the configuration of the Vert.x instance used by Quarkus.
es: Esta guía de referencia proporciona detalles avanzados sobre el uso y la configuración de la instancia Vert.x utilizada por Quarkus.
pt_br: Este guia de referência fornece detalhes avançados sobre o uso e a configuração da instância Vert.x usada pelo Quarkus.

source: Vert.x Reference Guide
es: Guía de referencia de Vert.x
pt_br: Guia de referência do Vert.x

source: This guide explains how you can access Git repositories with JGit.
es: Esta guía explica cómo se puede acceder a los repositorios Git con JGit.
pt_br: Este guia explica como você pode acessar repositórios Git com o JGit.

source: Access Git repositories with JGit
es: Acceder a los repositorios Git con JGit
pt_br: Acesse repositórios Git com JGit

source: This guide explains how your Quarkus application can read configuration properties at runtime from Consul.
es: Esta guía explica cómo su aplicación Quarkus puede leer las propiedades de configuración en tiempo de ejecución desde Consul.
pt_br: Este guia explica como seu aplicativo Quarkus pode ler propriedades de configuração em tempo de execução do Consul.

source: Consume Configuration from Consul
es: Consumir la configuración desde el cónsul
pt_br: Consumindo configuração do Consul

source: This guide explains how to best measure the footprint of a Quarkus application.
es: Esta guía explica cómo medir mejor la huella de una aplicación Quarkus.
pt_br: Este guia explica como medir melhor o rastro de uma aplicação Quarkus.

source: Measuring Performance
es: Medición del rendimiento
pt_br: Medindo o desempenho

source: This guide covers how to use GCP Secret Manager in Quarkus to consume configuration properties directly or via your `application.properties`.
es: Esta guía cubre cómo usar GCP Secret Manager en Quarkus para consumir las propiedades de configuración directamente o a través de su `application.properties` .
pt_br: Este guia aborda como usar o GCP Secret Manager no Quarkus para consumir propriedades de configuração diretamente ou por meio de seu 'application.properties'.

source: Consume Configuration from Google Cloud Secret Manager
es: Consumir la configuración de Google Cloud Secret Manager
pt_br: Consumindo configuração do Google Cloud Secret Manager

source: alternative-languages
es: idiomas alternativos

source: Alternative Languages
es: Lenguas alternativas
pt_br: Idiomas Alternativos

source: This guide explains how to use Kotlin.
es: Esta guía explica cómo utilizar Kotlin.
pt_br: Este guia explica como usar o Kotlin.

source: Using Kotlin
es: Uso de Kotlin
pt_br: Usando Kotlin

source: writing-extensions
es: escritura-extensiones

source: Writing Extensions
es: Extensiones de la escritura
pt_br: Escrevendo extensões

source: Learn step by step how to build a simple extension.
es: Aprenda paso a paso cómo construir una extensión sencilla.
pt_br: Aprenda passo a passo como construir uma extensão simples.

source: Building My First Extension
es: Construir mi primera extensión
pt_br: Construindo minha primeira extensão

source: Learn how to integrate your extension with Quarkus' CDI container.
es: Aprenda a integrar su extensión con el contenedor CDI de Quarkus.
pt_br: Saiba como integrar sua extensão com o contêiner CDI do Quarkus.

source: CDI Integration
es: Integración del CDI
pt_br: Integração CDI

source: Learn how to get your extension contribute features to the Dev UI.
es: Aprenda cómo hacer que su extensión contribuya con características a la interfaz de usuario de desarrollo.
pt_br: Saiba como fazer com que a sua extensão contribua com funcionalidades para a interface do usuário do desenvolvedor.

source: Contributing to Dev UI
es: Contribuir a la interfaz de usuario de desarrollo
pt_br: Contribuindo para a interface do usuário do desenvolvedor

source: Explore all the BuildItems you can consume/produce in your extensions.
es: Explora todos los BuildItems que puedes consumir/producir en tus extensiones.
pt_br: Explore todos os BuildItems que você pode consumir/produzir em suas extensões.

source: All BuildItems
es: Todos los BuildItems
pt_br: Todos os BuildItems

source: How capabilities are implemented and used in Quarkus.
es: Cómo se implementan y utilizan las capacidades en Quarkus.
pt_br: Como as capacidades são implementadas e utilizadas no Quarkus.

source: Capabilities
es: Capacidades
pt_br: Capacidades

source: Trigger the inclusion on additional extensions based on certain conditions.
es: Activar la inclusión en extensiones adicionales en función de determinadas condiciones.
pt_br: Acione a inclusão de extensões adicionais com base em determinadas condições.

source: Conditional Extension Dependencies
es: Dependencias de extensión condicional
pt_br: Dependências de extensão condicional

source: Quarkus extensions optimize your applications by pushing as much work as possible to the build operation. This guide explains the rationale of Quarkus extensions and guides you through authoring your own extensions.
es: Las extensiones de Quarkus optimizan sus aplicaciones empujando todo el trabajo posible a la operación de construcción. Esta guía explica los fundamentos de las extensiones de Quarkus y le guía en la creación de sus propias extensiones.
pt_br: As extensões do Quarkus otimizam suas aplicações enviando o máximo de trabalho possível para a operação de compilação. Este guia explica a lógica das extensões do Quarkus e orienta você através da criação de suas próprias extensões.

source: Writing Your Own Extension
es: Escribir su propia extensión
pt_br: Escrevendo sua própria extensão

source: Provide users with initial code for extensions when generating Quarkus applications on code.quarkus.io and all the Quarkus tooling. This guide explains how to create and configure a Codestart for an extension.
es: Proporcionar a los usuarios el código inicial de las extensiones al generar las aplicaciones de Quarkus en code.quarkus.io y todas las herramientas de Quarkus. Esta guía explica cómo crear y configurar un Codestart para una extensión.
pt_br: Forneça aos usuários o código inicial para extensões ao gerar aplicativos Quarkus no code.quarkus.io e todas as ferramentas do Quarkus. Este guia explica como criar e configurar um Codestart para uma extensão.

source: Writing a Codestart for an extension
es: Escribir un Codestart para una extensión
pt_br: Escrevendo um Codestart para uma extensão

source: architecture
es: arquitectura

source: Architecture
es: Arquitectura
pt_br: Arquitetura

source: Learn more about Quarkus reactive architecture.
es: Más información sobre la arquitectura reactiva de Quarkus.
pt_br: Saiba mais sobre a arquitetura reativa do Quarkus.

source: Quarkus Reactive Architecture
es: Arquitectura reactiva de Quarkus
pt_br: Arquitetura Reativa do Quarkus

source: Learn more about Quarkus class loading infrastructure.
es: Más información sobre la infraestructura de carga de clases de Quarkus.
pt_br: Saiba mais sobre a infraestrutura de carregamento de classes do Quarkus.

source: Class Loading Reference
es: Referencia a la carga de clases
pt_br: Referência de carregamento de classe

source: Learn more about what we call a Platform in the Quarkus world.
es: Conozca más sobre lo que llamamos Plataforma en el mundo de Quarkus.
pt_br: Saiba mais sobre o que chamamos de Plataforma no mundo Quarkus.

source: Understanding the Platform concept
es: Entender el concepto de plataforma
pt_br: Entendendo o conceito de Plataforma

source: Learn more about the notion of extension registry and how you can use your own.
es: Aprenda más sobre el concepto de registro de extensiones y cómo puede utilizar el suyo propio.
pt_br: Saiba mais sobre a noção de registro de extensão e como você pode usar o seu próprio.

source: Quarkus Extension Registry
es: Registro de extensiones de Quarkus
pt_br: Catálogo de Extensões do Quarkus

source: How dev mode differs from a production application
es: En qué se diferencia el modo de desarrollo de una aplicación de producción
pt_br: Como é que o modo de desenvolvimento difere de uma aplicação de produção

source: Dev Mode Differences
es: Diferencias en el modo de desarrollo
pt_br: Diferenças no modo de desenvolvimento

source: /guides/getting-started
pt_br: /guias/começar

source: This guide demonstrates how to get started with Quarkus security using Basic authentication and a database to store your user identities with Hibernate ORM.
pt_br: Este guia demonstra como começar a usar a segurança do Quarkus usando a autenticação básica e um banco de dados para armazenar suas identidades de usuário com o Hibernate ORM.

source: Security with Basic authentication and JPA
pt_br: Segurança com autenticação básica e JPA

source: Inject a preconfigured Keycloak Admin Client.
pt_br: Injete um Keycloak Admin Client pré-configurado.

source: Keycloak Admin Client
pt_br: Cliente de administração Keycloak
