Repository: quarkusio/pt.quarkus.io
Catalog: l10n/po/*/_versions/2.16/guides/getting-started-reactive.adoc.po
Languages: pt_br

source: Getting Started With Reactive
pt_br: Introdução ao Reativo

source: _Reactive_ is a set of principles to build robust, efficient, and concurrent applications and systems. These principles let you handle more load than traditional approaches while using the resources (CPU and memory) more efficiently while also reacting to failures gracefully.
pt_br: _Reativo_ é um conjunto de princípios para criar aplicações e sistemas robustos, eficientes e concorrentes. Esses princípios permitem lidar com mais carga do que as abordagens tradicionais e, ao mesmo tempo, usar os recursos (CPU e memória) de forma mais eficiente e reagir a falhas com elegância.

source: Quarkus is a _Reactive_ framework. Since the beginning, _Reactive_ has been an essential tenet of the Quarkus architecture. It includes many reactive features and offers a broad ecosystem.
pt_br: O Quarkus é um framework _Reativo_ . Desde o início, a _Reatividade_ tem sido um princípio essencial da arquitetura do Quarkus. Ela inclui muitos recursos reativos e oferece um amplo ecossistema.

source: This guide is not an in-depth article about what _Reactive_ is and how Quarkus enables reactive architectures. If you want to read more about these topics, refer to the xref:quarkus-reactive-architecture.adoc[Reactive Architecture guide], which provides an overview of the Quarkus reactive ecosystem.
pt_br: Este guia não é um artigo detalhado sobre o que é _Reativo_ e como o Quarkus permite arquiteturas reativas. Se quiser ler mais sobre esses tópicos, consulte o xref:quarkus-reactive-architecture.adoc[guia de Arquitetura Reativa] , que fornece uma visão geral do ecossistema reativo do Quarkus.

source: In this guide, we will get you started with some reactive features of Quarkus. We are going to implement a simple CRUD application. Yet, unlike in the xref:hibernate-orm-panache.adoc[Hibernate with Panache guide], it uses the reactive features of Quarkus.
pt_br: Neste guia, vamos te introduzir a alguns recursos reativos do Quarkus. Vamos implementar um aplicativo CRUD simples. No entanto, diferentemente do xref:hibernate-orm-panache.adoc[guia do Hibernate com Panache] , ele usa os recursos reativos do Quarkus.

source: This guide will help you with:
pt_br: Este guia vai ajudá-lo a:

source: Bootstrapping a reactive CRUD application with Quarkus
pt_br: Criar uma aplicação CRUD reativa com o Quarkus

source: Using Hibernate Reactive with Panache to interact with a database in a reactive fashion
pt_br: Utilizar o Hibernate Reactive com o Panache para interagir com uma base de dados de forma reativa

source: Using RESTEasy Reactive to implement HTTP API while enforcing the reactive principle
pt_br: Usar o RESTEasy Reactive para implementar a API HTTP, aplicando o princípio reativo

source: Packaging and Running the application
pt_br: Empacotar e Executar a aplicação

source: Prerequisites
pt_br: Pré-requisitos

source: Verify that Maven is using the Java version you expect. If you have multiple JDKs installed, make sure Maven is using the expected one. You can verify which JDK Maven uses by running `mvn --version.`
pt_br: Verifique se o Maven está usando a versão do Java que você espera. Se você tiver vários JDKs instalados, certifique-se de que o Maven esteja usando a versão esperada. Você pode verificar qual JDK o Maven usa executando `mvn --version.`

source: Imperative vs. Reactive: a question of threads
pt_br: Imperativo vs. Reativo: uma questão de threads

source: As mentioned above, in this guide, we are going to implement a reactive CRUD application. But you may wonder what the differences and benefits are in comparison to the traditional and imperative model.
pt_br: Conforme mencionado acima, neste guia, vamos implementar um aplicativo CRUD reativo. Mas você pode se perguntar quais são as diferenças e os benefícios em comparação com o modelo tradicional e imperativo.

source: To better understand the contrast, we need to explain the difference between the reactive and imperative execution models. It's essential to comprehend that _Reactive_ is not just a different execution model, but that distinction is necessary to understand this guide.
pt_br: Para entender melhor o contraste, precisamos explicar a diferença entre os modelos de execução reativo e imperativo. É essencial compreender que o _Reativo_ não é apenas um modelo de execução diferente, mas essa distinção é necessária para entender este guia.

source: In the traditional and imperative approach, frameworks assign a thread to handle the request. So, the whole processing of the request runs on this worker thread. This model does not scale very well. Indeed, to handle multiple concurrent requests, you need multiple threads; and so your application concurrency is constrained by the number of threads. In addition, these threads are blocked as soon as your code interacts with remote services. So, it leads to inefficient usage of the resources, as you may need more threads, and each thread, as they are mapped to OS threads, has a cost in terms of memory and CPU.
pt_br: Na abordagem tradicional e imperativa, os frameworks atribuem um thread para tratar a requisição. Assim, todo o processamento da requisição é executado nesse thread de trabalho. Esse modelo não escala muito bem. De fato, para lidar com várias requisições concorrentes, são necessários vários threads e, portanto, a concorrência da aplicação é limitada pelo número de threads. Além disso, esses threads são bloqueados assim que o código interage com os serviços remotos. Portanto, isso leva ao uso ineficiente dos recursos, pois você pode precisar de mais threads, e cada thread, como são mapeados para threads do sistema operacional, tem um custo em termos de memória e CPU.

source: On the other side, the reactive model relies on non-blocking I/Os and a different execution model. Non-blocking I/O provides an efficient way to deal with concurrent I/O. A minimal amount of threads called I/O threads, can handle many concurrent I/O. With such a model, request processing is not delegated to a worker thread but uses these I/O threads directly.It saves memory and CPU as there is no need to create worker threads to handle the requests. It also improves the concurrency as it removes the constraint on the number of threads. Finally, it also improves response time as it reduces the number of thread switches.
pt_br: Por outro lado, o modelo reativo se baseia em E/S sem bloqueio e em um modelo de execução diferente. A E/S sem bloqueio oferece uma maneira eficiente de lidar com E/S concorrente. Um número mínimo de threads, chamados threads de E/S, pode lidar com muitas E/S concorrentes. Com esse modelo, o processamento de solicitações não é delegado a um thread de trabalho, mas usa esses threads de E/S diretamente, o que economiza memória e CPU, pois não há necessidade de criar threads de trabalho para lidar com as requisições. Ele também melhora a concorrência, pois remove a restrição do número de threads. Por fim, ele também melhora o tempo de resposta, pois reduz o número de trocas de thread.

source: From sequential to continuation style
pt_br: Do estilo sequencial ao estilo de continuação

source: So, with the reactive execution model, the requests are processed using I/O threads. But that's not all. An I/O thread can handle multiple concurrent requests. How? Here is the trick and one of the most significant differences between reactive and imperative.
pt_br: Portanto, com o modelo de execução reativa, as requisições são processadas usando threads de E/S. Mas isso não é tudo. Um thread de E/S pode lidar com várias solicitações concorrentes. Como? Aqui está o truque e uma das diferenças mais significativas entre o reativo e o imperativo.

source: When processing a request requires interacting with a remote service, like an HTTP API or a database, it does not block the execution while waiting for the response. Instead, it schedules the I/O operation and attaches a continuation, i.e., the request processing remaining code. This continuation can be passed as a callback (a function invoked with the I/O outcome), or use more advanced constructs such as reactive programming or co-routines. Regardless of how the continuation is expressed, the essential aspect is the release of the I/O thread and, as a consequence, the fact that this thread can be used to process another request. When the scheduled I/O completes, the I/O thread executes the continuation, and the processing of the pending request continues.
pt_br: Quando o processamento de uma requisição exige a interação com um serviço remoto, como uma API HTTP ou um banco de dados, ele não bloqueia a execução enquanto aguarda a resposta. Em vez disso, ele agenda a operação de E/S e anexa uma continuação, ou seja, o código restante do processamento da requisição. Essa continuação pode ser passada como um retorno de chamada (uma função invocada com o resultado de E/S) ou usar construções mais avançadas, como programação reativa ou corrotinas. Independentemente de como a continuação é expressa, o aspecto essencial é a liberação do thread de E/S e, como consequência, o fato de que esse thread pode ser usado para processar outra requisição. Quando a E/S programada é concluída, o thread de E/S executa a continuação e o processamento da requisição pendente continua.

source: So, unlike the imperative model, where I/O blocks the execution, reactive switches to a continuation-based design, where the I/O threads are released, and continuation invoked when the I/Os complete. As a result, the I/O thread can handle multiple concurrent requests, improving the overall concurrency of the application.
pt_br: Portanto, ao contrário do modelo imperativo, em que a E/S bloqueia a execução, o reativo muda para um design baseado em continuação, em que os threads de E/S são liberados e a continuação é invocada quando as E/S são concluídas. Como resultado, o thread de E/S pode lidar com várias requisições concorrentes, melhorando a concorrência geral da aplicação.

source: But, there is a catch. We need a way to write continuation-passing code. There are many ways of doing this. In Quarkus, we propose:
pt_br: Mas há um problema. Precisamos de uma maneira de escrever código de passagem de continuação. Há muitas maneiras de fazer isso. No Quarkus, nós propomos:

source: Mutiny - an intuitive and event-driven reactive programming library
pt_br: Mutiny - uma biblioteca de programação reativa intuitiva e orientada a eventos

source: Kotlin co-routines - a way to write asynchronous code in a sequential manner
pt_br: Corrotinas Kotlin - uma forma de escrever código assíncrono de forma sequencial

source: In this guide, we will use Mutiny. To know more about Mutiny, check the xref:mutiny-primer.adoc[Mutiny documentation].
pt_br: Neste guia, usaremos o Mutiny. Para saber mais sobre o Mutiny, consulte a xref:mutiny-primer.adoc[documentação do Mutiny] .

source: Project Loom is coming to the JDK soon and proposes a virtual thread-based model. The Quarkus architecture is ready to support Loom as soon as it's become globally available.
pt_br: O Projeto Loom chegará ao JDK em breve e propõe um modelo virtual baseado em thread. A arquitetura Quarkus está pronta para suportar o Loom assim que ele estiver disponível globalmente.

source: Bootstrapping the Reactive Fruits application
pt_br: Criando a aplicação Reactive Fruits

source: With this in mind, let's see how we can develop a CRUD application with Quarkus, which will use the I/O thread to handle the HTTP requests, interact with a database, process the result, and write the HTTP response; in other words: a reactive CRUD application.
pt_br: Com isto em mente, vamos ver como podemos desenvolver uma aplicação CRUD com o Quarkus, que utilizará o thread de E/S para tratar as requisições HTTP, interagir com uma base de dados, processar o resultado e escrever a resposta HTTP; em outras palavras: uma aplicação CRUD reativa.

source: While we recommend you to follow the step-by-step instructions, you can find the final solution on https://github.com/quarkusio/quarkus-quickstarts/tree/main/hibernate-reactive-panache-quickstart.
pt_br: Embora recomendemos que siga as instruções passo a passo, você pode encontrar a solução final em https://github.com/quarkusio/quarkus-quickstarts/tree/main/hibernate-reactive-panache-quickstart.

source: First, go to https://code.quarkus.io[code.quarkus.io] and select the following extensions:
pt_br: Primeiro, vá para link:https://code.quarkus.io[code.quarkus.io] e selecione as seguintes extensões:

source: The last extension is the reactive database driver for PostgreSQL. Hibernate Reactive uses that driver to interact with the database without blocking the caller thread.
pt_br: A última extensão é o driver de banco de dados reativo para o PostgreSQL. O Hibernate Reativo usa esse driver para interagir com o banco de dados sem bloquear o thread do chamador.

source: Once selected, click on "Generate your application", download the zip file, unzip it and open the code in your favorite IDE.
pt_br: Uma vez selecionadas, clique em "Generate your application", baixe o ficheiro zip, descompacte-o e abra o código no seu IDE favorito.

source: Reactive Panache Entity
pt_br: Entidade Panache Reativa

source: Let's start with the `Fruit` entity.Create the `src/main/java/org/acme/hibernate/orm/panache/Fruit.java` file with the following content:
pt_br: Vamos começar com a entidade `Fruit`. Crie o arquivo `src/main/java/org/acme/hibernate/orm/panache/Fruit.java` com o seguinte conteúdo:

source: Make sure you import the reactive variant of `PanacheEntity`.
pt_br: Certifique-se de importar a variante reativa de `PanacheEntity`.

source: This class represents `Fruits`. It's a straightforward entity with a single field (`name`). Note that it uses `io.quarkus.hibernate.reactive.panache.PanacheEntity`, the reactive variant of `PanacheEntity`. So, behind the scenes, Hibernate uses the execution model we described above. It interacts with the database without blocking the thread. In addition, this reactive `PanacheEntity` proposes a reactive API. We will use this API to implement the REST endpoint.
pt_br: Essa classe representa `Fruits` . É uma entidade simples com um único campo ( `name` ). Observe que ela usa `io.quarkus.hibernate.reactive.panache.PanacheEntity` , a variante reativa de `PanacheEntity` . Portanto, por debaixo dos panos, o Hibernate usa o modelo de execução que descrevemos acima. Ele interage com o banco de dados sem bloquear o thread. Além disso, esse `PanacheEntity` reativo propõe uma API reativa. Usaremos essa API para implementar o endpoint REST.

source: It instructs the application to use PostgreSQL for the database and to handle the database schema generation.
pt_br: Ele instrui a aplicação a utilizar o PostgreSQL para a base de dados e para tratar da geração do esquema da base de dados.

source: In the same directory, create an `import.sql` file, which inserts a few fruits, so we don't start with an empty database in dev mode:
pt_br: No mesmo diretório, crie um arquivo `import.sql`, que insere algumas frutas, para não começarmos com uma base de dados vazia no modo de desenvolvimento:

source: In a terminal, launch the application in dev mode using: `./mvnw quarkus:dev`. Quarkus automatically starts a database instance for you and configure the application. Now we only need to implement the HTTP endpoint.
pt_br: Em um terminal, inicie a aplicação no modo de desenvolvimento usando: `./mvnw quarkus:dev` . O Quarkus inicia automaticamente uma instância de banco de dados para você e configura a aplicação. Agora só precisamos implementar o endpoint HTTP.

source: Reactive Resource
pt_br: Recurso Reativo

source: Because the interaction with the database is non-blocking and asynchronous, we need to use asynchronous constructs to implement our HTTP resource. Quarkus uses Mutiny as its central reactive programming model. So, it supports returning Mutiny types (`Uni` and `Multi`) from HTTP endpoints. Also, our Fruit Panache entity exposes methods using these types, so we only need to implement the _glue_.
pt_br: Como a interação com o banco de dados é assíncrona e sem bloqueio, precisamos usar construções assíncronas para implementar nosso recurso HTTP. O Quarkus usa o Mutiny como seu modelo central de programação reativa. Portanto, ele suporta o retorno de tipos Mutiny ( `Uni` e `Multi` ) a partir de endpoints HTTP. Além disso, nossa entidade Fruit Panache expõe métodos que usam esses tipos, portanto, só precisamos implementar a _cola_ .

source: Create the `src/main/java/org/acme/hibernate/orm/panache/FruitResource.java` file with the following content:
pt_br: Crie o arquivo `src/main/java/org/acme/hibernate/orm/panache/FruitResource.java` com o seguinte conteúdo:

source: Let's start with the `getAll` method. The `getAll` method returns all the fruits stored in the database. In the `FruitResource`, add the following code:
pt_br: Vamos começar com o método `getAll` . O método `getAll` retorna todas as frutas armazenadas no banco de dados. Em `FruitResource` , adicione o seguinte código:

source: Open http://localhost:8080/fruits to invoke this method:
pt_br: Abra http://localhost:8080/fruits para invocar este método:

source: We get the expected JSON array. RESTEasy Reactive automatically maps the list into a JSON Array, except if instructed otherwise.
pt_br: Obtemos o vetor JSON esperado. O RESTEasy Reactive mapeia automaticamente a lista em um vetor JSON, exceto se houver instruções em contrário.

source: Look at the return type; it returns a `Uni` of `List<Fruit>`. `Uni` is an asynchronous type. It's a bit like a future. It's a placeholder that will get its value (item) later. When it receives the item (Mutiny says it _emits_ its item), you can attach some behavior. That's how we express the continuation: get a uni, and when the uni emits its item, execute the rest of the processing.
pt_br: Observe o tipo de retorno; ele retorna um `Uni` de `List<Fruit>` . `Uni` é um tipo assíncrono. É um pouco como um future. É um espaço reservado que obterá seu valor (item) mais tarde. Quando ele recebe o item (o Mutiny diz que ele _emite_ seu item), você pode anexar algum comportamento. É assim que expressamos a continuação: obter um uni e, quando o uni emitir seu item, executar o restante do processamento.

source: Reactive developers may wonder why we can't return a stream of fruits directly. It tends to be a bad idea when dealing with a database. Relational databases do not handle streaming well. It’s a problem of protocols not designed for this use case. So, to stream rows from the database, you need to keep a connection (and sometimes a transaction) open until all the rows are consumed. If you have slow consumers, you break the golden rule of databases: don’t hold connections for too long. Indeed, the number of connections is rather low, and having consumers keeping them for too long will dramatically reduce the concurrency of your application. So, when possible, use a `Uni<List<T>>` and load the content. If you have a large set of results, implement pagination.
pt_br: Os desenvolvedores reativos podem se perguntar por que não podemos retornar um fluxo de frutas diretamente. Isso tende a ser uma má ideia quando se lida com um banco de dados. Os bancos de dados relacionais não lidam bem com o streaming. É um problema de protocolos não projetados para esse caso de uso. Portanto, para transmitir linhas do banco de dados, você precisa manter uma conexão (e, às vezes, uma transação) aberta até que todas as linhas sejam consumidas. Se os consumidores forem lentos, você quebra a regra de ouro dos bancos de dados: não mantenha as conexões por muito tempo. Na verdade, o número de conexões é bastante baixo, e ter consumidores mantendo-as por muito tempo reduzirá drasticamente a concorrência da sua aplicação. Portanto, quando possível, use um `Uni<List<T>>` e carregue o conteúdo. Se você tiver um grande conjunto de resultados, implemente a paginação.

source: Let's continue our API with `getSingle`:
pt_br: Vamos continuar a nossa API com `getSingle`:

source: In this case, we use `Fruit.findById` to retrieve the fruit. It returns a `Uni`, which will complete when the database has retrieved the row.
pt_br: Nesse caso, usamos `Fruit.findById` para recuperar a fruta. Ele retorna um `Uni` , que será concluído quando o banco de dados tiver recuperado a linha.

source: The `create` method allows adding a new fruit to the database:
pt_br: O método `create` permite acrescentar uma nova fruta na base de dados:

source: If you have https://curl.se/[curl] on your machine, you can try the endpoint using:
pt_br: Se tiver https://curl.se/[curl] na sua máquina, você pode testar o endpoint utilizando:

source: Following the same ideas, you can implement the other CRUD methods.
pt_br: Seguindo as mesmas ideias, pode implementar os outros métodos CRUD.

source: Testing and Running
pt_br: Testando e Executando

source: Testing a reactive application is similar to testing a non-reactive one: use the HTTP endpoint and verify the HTTP responses. The fact that the application is reactive does not change anything.
pt_br: O teste de uma aplicação reativa é semelhante ao teste de uma aplicação não reativa: use o endpoint HTTP e verifique as respostas HTTP. O fato de a aplicação ser reativa não muda nada.

source: In https://github.com/quarkusio/quarkus-quickstarts/blob/main/hibernate-reactive-panache-quickstart/src/test/java/org/acme/hibernate/orm/panache/FruitsEndpointTest.java[FruitsEndpointTest.java] you can see how the test for the fruit application can be implemented.
pt_br: Em https://github.com/quarkusio/quarkus-quickstarts/blob/main/hibernate-reactive-panache-quickstart/src/test/java/org/acme/hibernate/orm/panache/FruitsEndpointTest.java[FruitsEndpointTest.java] você pode ver como o teste da aplicação da fruta pode ser implementado.

source: Packaging and running the application does not change either.
pt_br: O empacotamento e a execução da aplicação também não mudam.

source: You can use the following command as usual:
pt_br: Você pode utilizar o seguinte comando como de costume:

source: or to build a native executable:
pt_br: ou para construir um executável nativo:

source: You can also package the application in a container.
pt_br: Também é possível empacotar a aplicação em um container.

source: To run the application, don’t forget to start a database and provide the configuration to your application.
pt_br: Para executar a aplicação, não se esqueça de iniciar uma base de dados e de fornecer a configuração à sua aplicação.

source: For example, you can use Docker to run your database:
pt_br: Por exemplo, pode utilizar o Docker para executar a sua base de dados:

source: Then, launch the application using:
pt_br: Em seguida, inicie a aplicação utilizando:

source: Or, if you packaged your application as native executable, use:
pt_br: Ou, se tiver empacotado a sua aplicação como executável nativo, utilize:

source: The parameters passed to the application are described in the datasource guide. There are other ways to configure the application - please check the xref:config-reference.adoc#configuration-sources[configuration guide] to have an overview of the possibilities (such as env variable, .env files and so on).
pt_br: Os parâmetros passados para a aplicação estão descritos no guia de fontes de dados. Há outras maneiras de configurar a aplicação - consulte o xref:config-reference.adoc#configuration-sources[guia de configuração] para ter uma visão geral das possibilidades (como variável de ambiente, arquivos .env e assim por diante).

source: Going further
pt_br: Indo mais longe
