Repository: quarkusio/pt.quarkus.io
Catalog: l10n/po/*/_versions/2.16/guides/getting-started-reactive.adoc.po
Languages: pt_br

source: This guide is a brief introduction to some reactive features offered by Quarkus. Quarkus is a reactive framework, and so offers a lot of reactive features.
pt_br: Este guia é uma breve introdução a alguns recursos reativos oferecidos pelo Quarkus. O Quarkus é um framework reativo e, portanto, oferece muitos recursos reativos.

source: If you want to continue on this topic check:
pt_br: Se quiser continuar neste tema, consulte:

source: xref:quarkus-reactive-architecture.adoc[The Quarkus Reactive Architecture]
pt_br: xref:quarkus-reactive-architecture.adoc[A Arquitetura Reativa Quarkus]

source: xref:mutiny-primer.adoc[Mutiny - an intuitive reactive programming library]
pt_br: xref:mutiny-primer.adoc[Mutiny - uma biblioteca de programação reativa intuitiva]
