Repository: quarkusio/pt.quarkus.io
Catalog: l10n/po/*/_versions/2.16/guides/kafka-reactive-getting-started.adoc.po
Languages: pt_br

source: Getting Started to SmallRye Reactive Messaging with Apache Kafka
pt_br: Introdução ao SmallRye Reactive Messaging com o Apache Kafka

source: This guide demonstrates how your Quarkus application can utilize SmallRye Reactive Messaging to interact with Apache Kafka.
pt_br: Este guia demonstra como sua aplicação Quarkus pode utilizar o SmallRye Reactive Messaging para interagir com o Apache Kafka.

source: Prerequisites
pt_br: Pré-requisitos

source: Architecture
pt_br: Arquitetura

source: In this guide, we are going to develop two applications communicating with Kafka. The first application sends a _quote request_ to Kafka and consumes Kafka messages from the _quote_ topic. The second application receives the _quote request_ and sends a _quote_ back.
pt_br: Neste guia, vamos desenvolver duas aplicações que se comunicam com o Kafka. A primeira aplicação envia um _quote request_ para o Kafka e consome mensagens Kafka do tópico _quote_. A segunda aplicação recebe o _quote request_ e envia uma _quote_ de volta.

source: The first application, the _producer_, will let the user request some quotes over an HTTP endpoint. For each quote request a random identifier is generated and returned to the user, to mark the quote request as _pending_. At the same time, the generated request id is sent over a Kafka topic `quote-requests`.
pt_br: A primeira aplicação, o _producer_, permitirá que o usuário solicite algumas cotações por meio de um endpoint HTTP. Para cada solicitação de cotação, um identificador aleatório é gerado e retornado ao usuário, para marcar a solicitação de cotação como _pending_. Ao mesmo tempo, o id de solicitação gerado é enviado por um tópico Kafka `quote-requests`.

source: The second application, the _processor_, will read from the `quote-requests` topic, put a random price to the quote, and send it to a Kafka topic named `quotes`.
pt_br: A segunda aplicação, o _processor_, lerá do tópico `quote-requests`, colocará um preço aleatório na cotação e a enviará para um tópico Kafka chamado `quotes`.

source: Lastly, the _producer_ will read the quotes and send them to the browser using server-sent events. The user will therefore see the quote price updated from _pending_ to the received price in real-time.
pt_br: Por fim, o _producer_ lerá as cotações e as enviará para o navegador usando Server-Sent Events. Assim, o usuário verá o preço da cotação atualizado de _pending_ para o preço recebido em tempo real.

source: Solution
pt_br: Solução

source: We recommend that you follow the instructions in the next sections and create applications step by step. However, you can go right to the completed example.
pt_br: Recomendamos que siga as instruções nas próximas seções e crie aplicativos passo a passo. No entanto, você pode ir direto para o exemplo concluído.

source: Clone the Git repository: `git clone {quickstarts-clone-url}`, or download an {quickstarts-archive-url}[archive].
pt_br: Clone o repositório Git: `git clone {quickstarts-clone-url}`, ou baixe um {quickstarts-archive-url}[arquivo].

source: Creating the Maven Project
pt_br: Criando o projeto Maven

source: First, we need to create two projects: the _producer_ and the _processor_.
pt_br: Em primeiro lugar, temos de criar dois projetos: o _producer_ e o _processor_.

source: To create the _producer_ project, in a terminal run:
pt_br: Para criar o projeto _producer_, em um terminal, execute:

source: This command creates the project structure and selects two Quarkus extensions we will be using:
pt_br: Esse comando cria a estrutura do projeto e seleciona duas extensões do Quarkus que usaremos:

source: The Kafka connector for Reactive Messaging
pt_br: O conector Kafka para Mensageria Reativa

source: To create the _processor_ project, from the same directory, run:
pt_br: Para criar o projeto _do processor_, a partir do mesmo diretório, execute:

source: At that point, you should have the following structure:
pt_br: Nesse ponto, você deve ter a seguinte estrutura:

source: Open the two projects in your favorite IDE.
pt_br: Abra os dois projetos no seu IDE preferido.

source: Dev Services
pt_br: Serviços de Desenvolvimento

source: No need to start a Kafka broker when using the dev mode or for tests. Quarkus starts a broker for you automatically. See xref:kafka-dev-services.adoc[Dev Services for Kafka] for details.
pt_br: Não é necessário iniciar um broker Kafka ao usar o modo de desenvolvimento ou para testes. O Quarkus inicia um broker para você automaticamente. Veja xref:kafka-dev-services.adoc[Dev Services para Kafka] para detalhes.

source: The Quote object
pt_br: O objeto Quote

source: The `Quote` class will be used in both _producer_ and _processor_ projects. For the sake of simplicity, we will duplicate the class. In both projects, create the `src/main/java/org/acme/kafka/model/Quote.java` file, with the following content:
pt_br: A classe `Quote` será usada tanto no projeto _producer_ quanto no _processor_. Para simplificar, duplicaremos a classe. Em ambos os projetos, crie o arquivo `src/main/java/org/acme/kafka/model/Quote.java`, com o seguinte conteúdo:

source: JSON representation of `Quote` objects will be used in messages sent to the Kafka topic and also in the server-sent events sent to web browsers.
pt_br: A representação JSON dos objetos `Quote` será usada nas mensagens enviadas para o tópico Kafka e também nos Server-Sent Events para navegadores web.

source: Quarkus has built-in capabilities to deal with JSON Kafka messages. In a following section, we will create serializer/deserializer classes for Jackson.
pt_br: O Quarkus possui capacidades integradas para lidar com mensagens Kafka JSON. Em uma seção seguinte, criaremos classes de serializador/deserializador para Jackson.

source: Sending quote request
pt_br: Enviando pedido de cotação

source: Inside the _producer_ project, create the `src/main/java/org/acme/kafka/producer/QuotesResource.java` file and add the following content:
pt_br: Dentro do projeto _producer_, crie o arquivo `src/main/java/org/acme/kafka/producer/QuotesResource.java` e adicione o seguinte conteúdo:

source: Inject a Reactive Messaging `Emitter` to send messages to the `quote-requests` channel.
pt_br: Injete um serviço de mensagens reativas `Emitter` para enviar mensagens para o canal `quote-requests`.

source: On a post request, generate a random UUID and send it to the Kafka topic using the emitter.
pt_br: Em uma solicitação post, gere um UUID aleatório e envie-o para o tópico Kafka usando o emissor.

source: Return the same UUID to the client.
pt_br: Retorne o mesmo UUID para o cliente.

source: The `quote-requests` channel is going to be managed as a Kafka topic, as that's the only connector on the classpath. If not indicated otherwise, like in this example, Quarkus uses the channel name as topic name. So, in this example, the application writes into the `quote-requests` topic. Quarkus also configures the serializer automatically, because it finds that the `Emitter` produces `String` values.
pt_br: O canal `quote-requests` será gerenciado como um tópico Kafka, pois esse é o único conector no classpath. Se não indicado de outra forma, como neste exemplo, o Quarkus usa o nome do canal como nome do tópico. Então, neste exemplo, a aplicação escreve no tópico `quote-requests`. O Quarkus também configura o serializador automaticamente, porque detecta que o `Emitter` produz valores `String`.

source: When you have multiple connectors, you would need to indicate which connector you want to use in the application configuration.
pt_br: Quando você tem vários conectores, você precisaria indicar qual conector deseja usar na configuração do aplicativo.

source: Processing quote requests
pt_br: Processamento de pedidos de cotação

source: Now let's consume the quote request and give out a price. Inside the _processor_ project, create the `src/main/java/org/acme/kafka/processor/QuotesProcessor.java` file and add the following content:
pt_br: Agora vamos consumir a solicitação de cotação e dar um preço. Dentro do projeto _processor_, crie o arquivo `src/main/java/org/acme/kafka/processor/QuotesProcessor.java` e adicione o seguinte conteúdo:

source: Indicates that the method consumes the items from the `requests` channel.
pt_br: Indica que o método consome os itens do canal `requests`.

source: Indicates that the objects returned by the method are sent to the `quotes` channel.
pt_br: Indica que os objetos retornados pelo método são enviados para o canal `quotes`.

source: Indicates that the processing is _blocking_ and cannot be run on the caller thread.
pt_br: Indica que o processamento está a _bloquear_ e não pode ser executado na thread do chamador.

source: For every Kafka _record_ from the `quote-requests` topic, Reactive Messaging calls the `process` method, and sends the returned `Quote` object to the `quotes` channel. In this case, we need to configure the channel in the `application.properties` file, to configures the `requests` and `quotes` channels:
pt_br: Para cada Kafka _record_ do tópico `quote-requests`, a Mensageria Reativa chama o método `process`, e envia o objeto `Quote` retornado para o canal `quotes`. Neste caso, precisamos configurar o canal no arquivo `application.properties`, para configurar os canais `requests` e `quotes`:

source: Note that in this case we have one incoming and one outgoing connector configuration, each one distinctly named. The configuration keys are structured as follows:
pt_br: Observe que, nesse caso, temos uma configuração de conector de entrada e outra de saída, cada uma com um nome distinto. As chaves de configuração são estruturadas da seguinte forma:

source: The `channel-name` segment must match the value set in the `@Incoming` and `@Outgoing` annotation:
pt_br: O segmento `channel-name` deve corresponder ao valor definido na anotação `@Incoming` e `@Outgoing`:

source: `quote-requests` -> Kafka topic from which we read the quote requests
pt_br: `quote-requests` -> Tópico Kafka do qual lemos as solicitações de cotação

source: `quotes` -> Kafka topic in which we write the quotes
pt_br: `quotes` -> Tópico Kafka no qual escrevemos as cotações

source: More details about this configuration is available on the https://kafka.apache.org/documentation/#producerconfigs[Producer configuration] and https://kafka.apache.org/documentation/#consumerconfigs[Consumer configuration] section from the Kafka documentation. These properties are configured with the prefix `kafka`. An exhaustive list of configuration properties is available in xref:kafka.adoc#kafka-configuration[Kafka Reference Guide - Configuration].
pt_br: Mais detalhes sobre esta configuração estão disponíveis na seção link:https://kafka.apache.org/documentation/#producerconfigs[Producer configuration] e link:https://kafka.apache.org/documentation/#consumerconfigs[Consumer configuration] da documentação do Kafka. Essas propriedades são configuradas com o prefixo `kafka`. Uma lista exaustiva de propriedades de configuração está disponível em xref:kafka.adoc#kafka-configuration[Kafka Reference Guide - Configuration].

source: `mp.messaging.incoming.requests.auto.offset.reset=earliest` instructs the application to start reading the topics from the first offset, when there is no committed offset for the consumer group. In other words, it will also process messages sent before we start the processor application.
pt_br: `mp.messaging.incoming.requests.auto.offset.reset=earliest` instrui a aplicação a começar a ler os tópicos a partir do primeiro offset, quando não há um offset registrado para o grupo de consumidores. Em outras palavras, também processará mensagens enviadas antes de iniciarmos a aplicação processadora.

source: There is no need to set serializers or deserializers. Quarkus detects them, and if none are found, generates them using JSON serialization.
pt_br: Não é necessário definir serializadores ou desserializadores. O Quarkus os detecta e, se nenhum for encontrado, gera-os usando serialização JSON.

source: Receiving quotes
pt_br: Recebendo cotações

source: Back to our _producer_ project. Let's modify the `QuotesResource` to consume quotes from Kafka and send them back to the client via Server-Sent Events:
pt_br: De volta ao nosso projeto _producer_. Vamos modificar o `QuotesResource` para consumir cotações do Kafka e enviá-las de volta ao cliente via Server-Sent Events:

source: Injects the `quotes` channel using the `@Channel` qualifier
pt_br: Injecta o canal `quotes` utilizando o qualificador `@Channel`

source: Indicates that the content is sent using `Server Sent Events`
pt_br: Indica que o conteúdo é enviado utilizando `Server Sent Events`

source: Returns the stream (_Reactive Stream_)
pt_br: Devolve o fluxo _(Reactive Stream_)

source: No need to configure anything, as Quarkus will automatically associate the `quotes` channel to the `quotes` Kafka topic. It will also generate a deserializer for the `Quote` class.
pt_br: Não há necessidade de configurar nada, pois o Quarkus associará automaticamente o canal `quotes` ao tópico `quotes` do Kafka. Ele também gerará um desserializador para a classe `Quote`.

source: Message serialization in Kafka
pt_br: Serialização de mensagens no Kafka

source: In this example we used Jackson to serialize/deserialize Kafka messages. For more options on message serialization, see xref:kafka.adoc#kafka-serialization[Kafka Reference Guide - Serialization].
pt_br: Neste exemplo, usamos Jackson para serializar/desserializar mensagens do Kafka. Para mais opções de serialização de mensagens, veja xref:kafka.adoc#kafka-serialization[Guia de Referência do Apache Kafka - Serialização JSON].

source: The HTML page
pt_br: A página HTML

source: Final touch, the HTML page requesting quotes and displaying the prices obtained over SSE.
pt_br: O toque final, a página HTML solicitando cotações e exibindo os preços obtidos por SSE.

source: Inside the _producer_ project, create the `src/main/resources/META-INF/resources/quotes.html` file with the following content:
pt_br: Dentro do projeto _producer_, crie o arquivo `src/main/resources/META-INF/resources/quotes.html` com o seguinte conteúdo:

source: Nothing spectacular here. When the user clicks the button, HTTP request is made to request a quote, and a pending quote is added to the list. On each quote received over SSE, the corresponding item in the list is updated.
pt_br: Nada espetacular aqui. Quando o usuário clica no botão, uma solicitação HTTP é feita para solicitar uma cotação, e uma cotação pendente é adicionada à lista. A cada cotação recebida por SSE, o item correspondente na lista é atualizado.

source: Get it running
pt_br: Executando a aplicação

source: You just need to run both applications. In one terminal, run:
pt_br: Você só precisa executar ambas as aplicações. Em um terminal, execute:

source: In another terminal, run:
pt_br: Em outro terminal, execute:

source: Quarkus starts a Kafka broker automatically, configures the application and shares the Kafka broker instance between different applications. See xref:kafka-dev-services.adoc[Dev Services for Kafka] for more details.
pt_br: O Quarkus inicia um broker Kafka automaticamente, configura a aplicação e compartilha a instância do broker Kafka entre diferentes aplicações. Veja xref:kafka-dev-services.adoc[Dev Services para o Kafka] para mais detalhes.

source: Open `http://localhost:8080/quotes.html` in your browser and request some quotes by clicking the button.
pt_br: Abra `http://localhost:8080/quotes.html` no seu browser e peça algumas cotações clicando no botão.

source: Running in JVM or Native mode
pt_br: Execução em modo JVM ou nativo

source: When not running in dev or test mode, you will need to start your Kafka broker. You can follow the instructions from the https://kafka.apache.org/quickstart[Apache Kafka website] or create a `docker-compose.yaml` file with the following content:
pt_br: Quando não estiver executando em modo de desenvolvimento ou teste, você precisará iniciar seu broker Kafka. Você pode seguir as instruções https://kafka.apache.org/quickstart[Site do Apache Kafka] ou criar um arquivo `docker-compose.yaml` com o seguinte conteúdo:

source: Make sure you first build both applications in JVM mode with:
pt_br: Certifique-se de construir primeiro ambas as aplicações no modo JVM com:

source: Once packaged, run `docker-compose up`.
pt_br: Uma vez empacotado, execute `docker-compose up`.

source: This is a development cluster, do not use in production.
pt_br: Este é um cluster de desenvolvimento, não use em produção.

source: You can also build and run our applications as native executables. First, compile both applications as native:
pt_br: Você também pode construir e executar nossas aplicações como executáveis nativos. Primeiro, compile ambas as aplicações como nativas:

source: Run the system with:
pt_br: Execute o sistema com:

source: Going further
pt_br: Indo mais longe

source: This guide has shown how you can interact with Kafka using Quarkus. It utilizes https://smallrye.io/smallrye-reactive-messaging[SmallRye Reactive Messaging] to build data streaming applications.
pt_br: Este guia mostrou como você pode interagir com o Kafka usando o Quarkus. Ele utiliza o link:https://smallrye.io/smallrye-reactive-messaging[SmallRye Reactive Messaging] para construir aplicações de streaming de dados.

source: For the exhaustive list of features and configuration options, check the xref:kafka.adoc[Reference guide for Apache Kafka Extension].
pt_br: Para a lista completa de recursos e opções de configuração, consulte o xref:kafka.adoc[Guia de Referência do Apache Kafka].
