Repository: quarkusio/pt.quarkus.io
Catalog: l10n/po/*/_includes/about.html.po
Languages: es, pt_br

source: What is Quarkus?
es: ¿Qué es Quarkus?
pt_br: O que é o Quarkus?

source: Traditional Java stacks were engineered for monolithic applications with long startup times and large memory requirements in a world where the cloud, containers, and Kubernetes did not exist. Java frameworks needed to evolve to meet the needs of this new world.
es: Los stack de Java tradicionales se diseñaron para aplicaciones monolíticas con largos tiempos de inicio y grandes requisitos de memoria en un mundo en el que no existían la nube, los contenedores ni Kubernetes. Los frameworks de Java debían evolucionar para satisfacer las necesidades de este nuevo mundo.
pt_br: As stacks Java tradicionais foram projetadas para aplicativos monolíticos com longos tempos de inicialização e grandes requisitos de memória em um mundo em que a nuvem, os contêineres e o Kubernetes não existiam. Os frameworks Java precisavam evoluir para atender às necessidades desse novo mundo.

source: Quarkus was created to enable Java developers to create applications for a modern, cloud-native world. Quarkus is a Kubernetes-native Java framework tailored for GraalVM and HotSpot, crafted from best-of-breed Java libraries and standards. The goal is to make Java the leading platform in Kubernetes and serverless environments while offering developers a framework to address a wider range of distributed application architectures.
es: Quarkus fue creado para permitir a los desarrolladores de Java crear aplicaciones para un mundo moderno y nativo de la nube. Quarkus es un marco Java nativo de Kubernetes adaptado a GraalVM y HotSpot, elaborado a partir de las mejores bibliotecas y estándares Java. El objetivo es convertir a Java en la plataforma líder en Kubernetes y entornos sin servidor, al tiempo que ofrece a los desarrolladores un marco para abordar una gama más amplia de arquitecturas de aplicaciones distribuidas.
pt_br: O Quarkus foi criado para permitir que os desenvolvedores Java criem aplicativos para um mundo moderno e nativo da nuvem. O Quarkus é uma estrutura Java nativa do Kubernetes adaptada para GraalVM e HotSpot, criada a partir das melhores bibliotecas e padrões Java. O objetivo é tornar o Java a plataforma líder em Kubernetes e ambientes sem servidor, oferecendo aos desenvolvedores uma estrutura para abordar uma ampla gama de arquiteturas de aplicações distribuídas.

source: Open Source Utterly and Absolutely
es: Código abierto de forma total y absoluta
pt_br: Código aberto total e absolutamente

source: Quarkus is an Open Source project licensed under the <a href="https://www.apache.org/licenses/LICENSE-2.0">Apache License version 2.0</a>. First and foremost, it is an open community where contributions, ideas and discussions are done in the open and contributors are welcome. Let’s join forces in building the future of Java applications.
es: Quarkus es un proyecto de código abierto con licencia <a href="https://www.apache.org/licenses/LICENSE-2.0">Licencia Apache versión 2.0</a>. Ante todo, es una comunidad abierta donde las contribuciones, ideas y discusiones se hacen en abierto y los colaboradores son bienvenidos. Unamos fuerzas para construir el futuro de las aplicaciones Java.
pt_br: Quarkus é um projeto Open Source licenciado sob a <a href="https://www.apache.org/licenses/LICENSE-2.0">Licença Apache versão 2.0.</a> Em primeiro lugar, é uma comunidade aberta, onde contribuições, ideias e discussões são feitas ao ar livre e os colaboradores são bem-vindos. Vamos unir forças na construção do futuro das aplicações Java.

source: What Makes Quarkus Different?
es: ¿Qué hace diferente a Quarkus?
pt_br: O que torna o Quarkus diferente?

source: Developer Joy
es: Alegría para el desarrollador
pt_br: Alegria em desenvolver

source: Developers are critical to the success of almost every organization and they need the tools to build cloud-native applications quickly and efficiently. Quarkus provides a frictionless development experience through a combination of tools, libraries, extensions, and more. Quarkus makes developers more efficient with tools to improve the inner loop development cycle while in dev mode.
es: Los desarrolladores son fundamentales para el éxito de casi todas las organizaciones y necesitan las herramientas para crear aplicaciones nativas de la nube de forma rápida y eficiente. Quarkus proporciona una experiencia de desarrollo sin fricciones a través de una combinación de herramientas, bibliotecas, extensiones y más. Quarkus hace que los desarrolladores sean más eficientes con herramientas para mejorar el ciclo de desarrollo del bucle interno mientras están en modo de desarrollo.
pt_br: Os desenvolvedores são fundamentais para o sucesso de quase todas as organizações e precisam das ferramentas para criar aplicativos nativos da nuvem de forma rápida e eficiente. O Quarkus fornece uma experiência de desenvolvimento sem atrito por meio de uma combinação de ferramentas, bibliotecas, extensões e muito mais. O Quarkus torna os desenvolvedores mais eficientes com ferramentas para melhorar o ciclo de desenvolvimento de loop interno enquanto estiver no modo de desenvolvimento.

source: <a href="/developer-joy/">Learn more about Developer Joy</a>
es: <a href="/developer-joy/">Conozca más sobre Alegría para el desarrollador</a>
pt_br: <a href="/developer-joy/">Saiba mais sobre o prazer em desenvolver</a>

source: Quarkus was built from the ground up for Kubernetes making it easy to deploy applications without having to understand all of the complexities of the platform. Quarkus allows developers to automatically generate Kubernetes resources including building and deploying container images without having to manually create YAML files.
es: Quarkus fue construido desde el principio para Kubernetes, facilitando el despliegue de aplicaciones sin tener que entender todas las complejidades de la plataforma. Quarkus permite a los desarrolladores generar automáticamente recursos de Kubernetes, incluyendo la construcción y el despliegue de imágenes de contenedores sin tener que crear manualmente archivos YAML.
pt_br: O Quarkus foi criado do zero para o Kubernetes, facilitando a implantação de aplicativos sem precisar entender todas as complexidades da plataforma. O Quarkus permite que os desenvolvedores gerem automaticamente recursos do Kubernetes, incluindo a criação e implantação de imagens de contêiner sem a necessidade de criar manualmente arquivos YAML.

source: <a href="/kubernetes-native/">Learn more about Kubernetes-native</a>
es: <a href="/kubernetes-native/">Aprenda más sobre Kubernetes-native</a>
pt_br: <a href="/kubernetes-native/">Saiba mais sobre o Kubernetes-native</a>

source: Best of Breed Libraries and Standards
es: Las mejores bibliotecas y estándares
pt_br: As melhores Bibliotecas e Padrões disponíveis

source: Quarkus provides a cohesive, fun to use, full-stack framework by leveraging a growing list of hundreds of best-of-breed libraries that you love and use. All wired on a standard backbone.
es: Quarkus proporciona un marco de trabajo cohesivo, divertido de usar, completo, aprovechando una lista creciente de cientos de bibliotecas de primera clase que usted ama y usa. Todo conectado en una columna vertebral estándar.
pt_br: O Quarkus fornece um framework coeso, divertido de usar e full-stack, aproveitando uma lista crescente de centenas de bibliotecas disponíveis que você ama e usa. Tudo conectado em um backbone padrão.

source: <a href="/standards/">Learn more about Standards</a>
es: <a href="/standards/">Más información sobre los estándares</a>
pt_br: <a href="/standards/">Saiba mais sobre Padrões</a>

source: Imperative and reactive code
es: Código imperativo y reactivo
pt_br: Código imperativo e reativo

source: Quarkus is designed to seamlessly combine the familiar imperative style code and the non-blocking, reactive style when developing applications.
es: Quarkus está diseñado para combinar a la perfección el familiar código de estilo imperativo y el estilo reactivo no bloqueante al desarrollar aplicaciones.
pt_br: O Quarkus foi projetado para combinar perfeitamente o código de estilo imperativo que você já conhece e o estilo reativo sem bloqueio ao desenvolver aplicações.

source: This is helpful for both Java developers who are used to working with the imperative model and don’t want to switch things up, and those working with a cloud-native/reactive approach. The Quarkus development model can adapt itself to whatever app you’re developing.
es: Esto es útil tanto para los desarrolladores de Java que están acostumbrados a trabajar con el modelo imperativo y no quieren cambiar las cosas, como para los que trabajan con un enfoque nativo en la nube/reactivo. El modelo de desarrollo de Quarkus puede adaptarse a cualquier aplicación que estés desarrollando.
pt_br: Isso é útil tanto para desenvolvedores Java que estão acostumados a trabalhar com o modelo imperativo e não querem mudar as coisas, quanto para aqueles que trabalham com uma abordagem nativa/reativa na nuvem. O modelo de desenvolvimento do Quarkus pode adaptar-se a qualquer aplicação que você esteja desenvolvendo.

source: <a href="/continuum/">Learn more about Reactive</a>
es: <a href="/continuum/">Más información sobre Reactive</a>
pt_br: <a href="/continuum/">Saiba mais sobre Reactive</a>
