Repository: quarkusio/pt.quarkus.io
Catalog: l10n/po/*/_includes/catalog-detail-band.html.po
Languages: es

source: <a href="{{site.baseurl}}/catalog">Extension Catalog</a> <i class="fas fa-chevron-right"></i> {{ page.title }}
es: <a href="{{site.baseurl}}/catalog">Catálogo de extensiones</a> <i class="fas fa-chevron-right"></i> {{ page.title }}

source: Extension Title Quarkiverse-JBeret
es: Título de la extensión Quarkiverse-JBeret

source: Provided by the JBeret Project Team
es: Proporcionado por el equipo del proyecto JBeret

source: The Quarkus JBeret Extension adds support for JSR-352 Batch Applications for the Java Platform. JBeret is an implementation of the JSR-352.
es: La extensión JBeret de Quarkus añade soporte para las aplicaciones por lotes JSR-352 para la plataforma Java. JBeret es una implementación de la JSR-352.

source: DOCUMENTATION
es: DOCUMENTACIÓN

source: Make sure use the documentation to have your questions answered.
es: Asegúrese de utilizar la documentación para obtener respuesta a sus preguntas.

source: QUARKUS GUIDES
es: GUÍAS DE QUARKUS

source: You can get a better understanding on how to use this extension in the Quarkus Guides.
es: Puede obtener una mejor comprensión de cómo utilizar esta extensión en las Guías de Quarkus.

source: Check out these applicable guides:
es: Consulte estas guías aplicables:

source: <a href="#">Use Jberet to do something cool</a>
es: <a href="#">Usa Jberet para hacer algo genial</a>

source: <a href="#">JBeret makes you jump higher</a>
es: <a href="#">JBeret te hace saltar más alto</a>

source: USAGE
es: USO

source: To use the extension, add the dependency to the target project:
es: Para utilizar la extensión, añada la dependencia al proyecto de destino:

source: The Batch API and Runtime will be available out of the box. Please refer to the <a href="#">Batch documentation</a>, or the <a href="#">JBeret documentation</a> to learn about Batch Applications.
es: La API de Batch y Runtime estarán disponibles de forma inmediata. Consulte la <a href="#">documentación de Batch</a>, o la <a href="#">documentación de JBeret</a> para conocer sobre las aplicaciones Batch.

source: CONFIGURATION
es: CONFIGURACIÓN

source: The JBeret Quarkus extension supports the following configuration:
es: La extensión JBeret Quarkus soporta la siguiente configuración:

source: Name
es: Nombre

source: Type
es: Tipo

source: Default
es: Por defecto

source: The repository type to store JBeret and Job data. A jdbc type requires a JDBC datasource.
es: El tipo de repositorio para almacenar los datos de JBeret y Job. Un tipo jdbc requiere una fuente de datos JDBC.

source: NON-STANDARD FEATURES
es: CARACTERÍSTICAS NO ESTÁNDAR

source: Non-standard Features
es: Características no estándar

source: The Batch API requires the @BatchProperty annotation to inject the specific configuration from the batch definition file. Instead, you can use the @ConfigProperty annotation, which is used to inject configuration properties in Quarkus using the MicroProfile Config API and keep consistency:
es: La API de Batch requiere la anotación @BatchProperty para inyectar la configuración específica del archivo de definición. En su lugar, se puede utilizar la anotación @ConfigProperty, que se utiliza para inyectar propiedades de configuración en Quarkus utilizando la API MicroProfile Config y mantener la coherencia:

source: Although, there is a slight limitation: since job configuration is mostly dynamic and only injected on job execution, Quarkus may fail to start due to invalid configuration (can’t find the Job configuration values). In this case, configuration injection points with the @ConfigProperty annotation need to set a default value or use an Optional.
es: Aunque, hay una pequeña limitación: como la configuración del trabajo es mayormente dinámica y sólo se inyecta en la ejecución del trabajo, Quarkus puede fallar al iniciar debido a una configuración inválida (no puede encontrar los valores de configuración del trabajo). En este caso, los puntos de inyección de configuración con la anotación @ConfigProperty necesitan establecer un valor por defecto o utilizar un Optional.

source: CDI Beans
es: Beans CDI

source: The Batch APIs JobOperator and JobRepository are available as CDI beans, so they can be injected directly into any code:
es: Las APIs JobOperator y JobRepository están disponibles como beans CDI, por lo que pueden ser inyectadas directamente en cualquier código:

source: Scheduler
es: Planificador

source: The JBeret Scheduler is integrated out of the box in this extension.
es: El planificador JBeret está integrado en esta extensión.

source: To schedule a Job execution, please refer to the quarkus.jberet.job.”job-name”.cron and quarkus.jberet.job.”job-name”.params.”param-key” configurations.
es: Para programar la ejecución de un trabajo, consulte las configuraciones quarkus.jberet.job."nombre-del-trabajo".cron y quarkus.jberet.job."nombre-del-trabajo".params."param-key".

source: A Job can also be scheduled programmatically, using the JobScheduler API and the Quarkus startup event:
es: Un trabajo también puede ser programado, utilizando la API JobScheduler y el evento de inicio de Quarkus:

source: The JobScheduler does not support persistent schedules.
es: El JobScheduler no admite las programaciones persistentes.

source: REST API
es: API REST

source: The JBeret REST is integrated as separate extension that can be easily added to the target project with the following dependency:
es: El JBeret REST está integrado como una extensión separada que se puede añadir fácilmente al proyecto de destino con la siguiente dependencia:

source: The JBeret REST API, provides REST resources to several operations around the Batch API: starting and stopping jobs, querying the status of a job, schedule a job, and many more. The extension includes a REST client to simplify the REST API calls:
es: La API REST de JBeret, proporciona recursos REST para varias operaciones en torno a la API Batch: iniciar y detener trabajos, consultar el estado de un trabajo, programar un trabajo, y muchas más. La extensión incluye un cliente REST para simplificar las llamadas a la API REST:

source: EXAMPLE APPLICATIONS
es: EJEMPLOS DE APLICACIONES

source: <code>chunk</code> - A simple Job that reads, processes, and stores data from a file.
es: <code>chunk</code> - Un simple trabajo que lee, procesa y almacena datos de un archivo.

source: <code>jdbc-repository</code> - A Job that uses a jdbc datasource to store JBeret and Job metadata.
es: <code>jdbc-repository</code> - Un trabajo que utiliza una fuente de datos jdbc para almacenar JBeret y los metadatos del trabajo.

source: <code>scheduler</code> - Schedule a Job to run every 10 seconds
es: <code>scheduler</code> - Programar un trabajo para que se ejecute cada 10 segundos

source: Or take a look into the World of Warcraft Auctions - Batch Application. It downloads the World of Warcraft Auction House data and provides statistics about items prices.
es: O echa un vistazo a la aplicación Batch Subastas de World of Warcraft. Descarga los datos de la Casa de Subastas de World of Warcraft y proporciona estadísticas sobre los precios de los artículos.

source: CONTRIBUTORS
es: COLABORADORES

source: Thanks goes to these wonderful people:
es: Gracias a estas maravillosas personas:

source: This project follows the <a href="#">all-contributors</a> specification. Contributions of any kind welcome!
es: Este proyecto sigue la especificación <a href="#">todos-colaboradores</a>. ¡Las contribuciones de cualquier tipo son bienvenidas!

source: LICENSE
es: LICENCIA

source: Apache-2.0 License
es: Licencia Apache-2.0

source: Extension Version
es: Versión ampliada

source: Compatible with Quarkus
es: Compatible con Quarkus

source: Platform
es: Plataforma

source: Compatibility
es: Compatibilidad

source: Native
es: Nativo

source: Build
es: Construir

source: <a href="#">Passing</a>
es: <a href="#">Pasar</a>

source: <a href="#">Version 0.0.2</a>
es: <a href="#">Versión 0.0.2</a>

source: Extension Repository
es: Repositorio de extensiones

source: <a href="#">Extension Repo</a>
es: <a href="#">Repositorio de extensiones</a>

source: Extension Documentation
es: Documentación de la extensión

source: <a href="#">Documentation</a>
es: <a href="#">Documentación</a>

source: Maintainer
es: Mantenedor

source: Project Homepage
es: Página web del proyecto

source: <a href="#">JBeret Project</a>
es: <a href="#">Proyecto JBeret</a>

source: Issues
es: Problemas

source: Pull Requests
es: Solicitudes de extracción

source: Size
es: Tamaño

source: Last Publish Date
es: Última fecha de publicación

source: Jan 01, 2021
es: 01 de enero de 2021

source: Weekly Builds
es: Construcciones semanales

source: Total Builds
es: Total de construcciones

source: Created on
es: Creado el

source: Jan 01, 2016
es: 01 de enero de 2016

source: License
es: Licencia

source: Category
es: Categoría

source: Contributors
es: Colaboradores

source: <a href="#">62 Contributors</a>
es: <a href="#">62 Colaboradores</a>
