Repository: quarkusio/pt.quarkus.io
Catalog: l10n/po/*/_includes/community-contrib-band.html.po
Languages: es

source: Contributing
es: Contribuyendo a

source: An Open Project
es: Un proyecto abierto

source: Quarkus is an Open Source project licensed under the <a href="https://www.apache.org/licenses/LICENSE-2.0">Apache License version 2.0</a>. First and foremost, it is an open community where contributions, ideas and discussions are done in the open and contributors are welcome. Let’s join forces in building the future of Java applications.
es: Quarkus es un proyecto de código abierto con licencia <a href="https://www.apache.org/licenses/LICENSE-2.0">Licencia Apache versión 2.0</a>. Ante todo, es una comunidad abierta donde las contribuciones, ideas y discusiones se hacen en abierto y los colaboradores son bienvenidos. Unamos fuerzas para construir el futuro de las aplicaciones Java.

source: Roadmap
es: Hoja de ruta

source: Read about the community plans for the future. Here is <a href="https://github.com/orgs/quarkusio/projects/5">our current roadmap</a>. This is driven by the community, come and tell us what <i>your</i> needs are.
es: Lea los planes de la comunidad para el futuro. Aquí está <a href="https://github.com/orgs/quarkusio/projects/5">nuestra hoja de ruta actual</a>. Esto es impulsado por la comunidad, ven y dinos cuáles son <i>tus</i> necesidades.

source: Code and Issue Tracker
es: Rastreador de código fuente y problemas

source: The source code is hosted on <a href="https://github.com/quarkusio/quarkus">GitHub</a>. If you need to report a bug or request a new feature, look for a similar one on our <a href="https://github.com/quarkusio/quarkus/issues">GitHub issue tracker</a>. If you don’t find any, <a href="https://github.com/quarkusio/quarkus/issues/new/choose">create a new issue</a>.
es: El código fuente está alojado en <a href="https://github.com/quarkusio/quarkus">GitHub</a>. Si necesitas informar de un error o solicitar una nueva función, busca uno similar en nuestro <a href="https://github.com/quarkusio/quarkus/issues">Rastreador de problemas de GitHub</a>;. Si no encuentras ninguno, <a href="https://github.com/quarkusio/quarkus/issues/new/choose">crea una nueva incidencia</a>.

source: Write QuickStart Guides
es: Escribir guías de inicio rápido

source: There are always new users trying to get started quickly. Share your experience with everyone by writing a Quickstart and submitting it for peer review.
es: Siempre hay nuevos usuarios que intentan empezar rápidamente. Comparte tu experiencia con todos escribiendo un Quickstart y enviándolo para que lo revisen otros usuarios.

source: Write New Extensions
es: Crear nuevas extensiones

source: If you are an extension developer or want to contribute to Quarkus development, join our mailing list either <a href="mailto:quarkus-dev+subscribe@googlegroups.com">emailing us</a> or by visiting our <a href="https://groups.google.com/d/forum/quarkus-dev">Google Groups page</a>. Make sure you visit our extensive <a href="{{site.baseurl}}/guides/writing-extensions">Writing extensions guide</a>.
es: Si eres un desarrollador de extensiones o quieres contribuir al desarrollo de Quarkus, únete a nuestra lista de correo ya sea <a href="mailto:quarkus-dev+subscribe@googlegroups.com">escríbenos un correo</a> o visitando nuestra <a href="https://groups.google.com/d/forum/quarkus-dev">página de Grupos de Google</a>. Asegúrese de visitar nuestra extensa <a href="{{site.baseurl}}/guides/writing-extensions">Guía de extensiones de escritura</a>.

source: Quarkus Insights Podcast
es: Podcast de Quarkus Insights

source: A periodical video podcast hosted by Quarkus Developers about things moving in and around Quarkus ecosystem. View the <a href="{{site.baseurl}}/insights">live podcasts</a> and check out older episodes on the Podcasts.
es: Un video podcast periódico presentado por los desarrolladores de Quarkus sobre las cosas que se mueven en el ecosistema de Quarkus y sus alrededores. Vea los <a href="{{site.baseurl}}/insights">podcasts en vivo</a> y consulte los episodios más antiguos en los Podcasts.

source: Follow Quarkus on Twitter
es: Siga a Quarkus en Twitter

source: Most of our updates go out on <a href="https://twitter.com/quarkusio">Twitter</a>. Sometimes our project team speaks at industry events, and sometimes they post cool ways people use Quarkus. Wash, rinse, and retweet.
es: La mayoría de nuestras actualizaciones se publican en <a href="https://twitter.com/quarkusio">Twitter</a>. A veces, nuestro equipo de proyectos habla en eventos de la industria, y a veces publican formas geniales en que la gente usa Quarkus. Lavar, enjuagar y retuitear.

source: Q Tips
es: Q Consejos

source: The Quarkus community publishes thoughtful how-to videos to help you get started. Check them out on <a href="https://www.youtube.com/playlist?list=PLsM3ZE5tGAVbMz1LJqc8L5LpnfxPPKloO">YouTube</a>.
es: La comunidad de Quarkus publica vídeos explicativos para ayudarte a empezar. Consúltalos en <a href="https://www.youtube.com/playlist?list=PLsM3ZE5tGAVbMz1LJqc8L5LpnfxPPKloO">YouTube</a>.

source: Publications
es: Publicaciones

source: There are heaps of helpful <a href="{{site.baseurl}}/publications">articles and blog posts</a> out there presenting interesting use-cases and examples of Quarkus in action.
es: Hay un montón de útiles <a href="{{site.baseurl}}/publications">artículos y entradas de blog</a> que presentan interesantes casos de uso y ejemplos de Quarkus en acción.

source: Newsletter
es: Boletín de noticias

source: Subscribe to the <a href="{{site.baseurl}}/newsletter">monthly newsletter</a> to have choice Quarkus content from across our community delivered to your inbox.
es: Suscríbase al <a href="{{site.baseurl}}/newsletter">boletín mensual</a> para recibir en su bandeja de entrada los contenidos de Quarkus más destacados de nuestra comunidad.

source: Awards
es: Premios

source: Share in our excitement when the project receives <a href="{{site.baseurl}}/awards">awards and recognition</a> for all of the hard work done by the community.
es: Comparte nuestra emoción cuando el proyecto reciba <a href="{{site.baseurl}}/awards">premios y reconocimientos</a> por todo el trabajo duro realizado por la comunidad.

source: Report a Vulnerability
es: Informar de una vulnerabilidad

source: Found a security vulnerability in Quarkus, its extensions or the dependencies they use? See the <a href="{{site.baseurl}}/security">security policy page</a> to learn to report it.
es: ¿Has encontrado una vulnerabilidad de seguridad en Quarkus, sus extensiones o las dependencias que utilizan? Consulte la página <a href="{{site.baseurl}}/security">política de seguridad</a> para aprender a informarla.

source: Books
es: Libros

source: Get new and deeper views into Quarkus from the community through <a href="{{site.baseurl}}/books">these great books</a>.
es: Obtenga nuevos y más profundos puntos de vista sobre Quarkus de la comunidad a través de <a href="{{site.baseurl}}/books">estos magníficos libros</a>.
