Repository: quarkusio/pt.quarkus.io
Catalog: l10n/po/*/_includes/continuum.html.po
Languages: es, pt_br

source: For years, the client-server architecture has been the de-facto standard to build applications. But a significant shift happened. The <em>one model rules them all</em> age is over. A new range of applications and architectural styles have emerged and transformed how code is written and how applications are deployed and executed. HTTP microservices, reactive applications, event-driven architecture, and serverless are now central players in modern systems.
es: Durante años, la arquitectura cliente-servidor ha sido el estándar de facto para construir aplicaciones. Pero se ha producido un cambio significativo. La era de <em>un modelo los gobierna a todos</em> ha terminado. Ha surgido una nueva gama de aplicaciones y estilos arquitectónicos que han transformado la forma de escribir el código y de desplegar y ejecutar las aplicaciones. Los microservicios HTTP, las aplicaciones reactivas, la arquitectura basada en eventos y la ausencia de servidor son ahora protagonistas de los sistemas modernos.
pt_br: Por anos, a arquitetura cliente-servidor tem sido o padrão de fato para criar aplicativos. Mas uma mudança significativa aconteceu. A era do <em>único modelo que rege todos eles</em> acabou. Uma nova gama de aplicativos e estilos de arquitetura surgiram e transformaram a forma como o código é escrito e como as aplicações são implantadas e executadas. Microsserviços HTTP, aplicações reativas, arquitetura orientada a eventos e sem servidor agora são atores centrais em sistemas modernos.

source: Quarkus has been designed with this new world in mind and provides first-class support for these different paradigms. That does not mean you cannot build monoliths with Quarkus; you can do it smoothly. On the contrary, it means that the Quarkus development model morphs to adapt itself to the type of application you are developing, monolith, microservice, reactive, event-driven, functions…
es: Quarkus ha sido diseñado con este nuevo mundo en mente y proporciona soporte de primera clase para estos diferentes paradigmas. Esto no significa que no puedas construir monolitos con Quarkus; puedes hacerlo sin problemas. Al contrario, significa que el modelo de desarrollo de Quarkus se transforma para adaptarse al tipo de aplicación que estés desarrollando, monolito, microservicio, reactivo, dirigido por eventos, funciones...
pt_br: O Quarkus foi projetado com esse novo mundo em mente e fornece suporte de primeira classe para esses diferentes paradigmas. Isso não significa que você não possa construir monólitos com Quarkus; você pode fazê-lo sem problemas. Pelo contrário, isso significa que o modelo de desenvolvimento do Quarkus se transforma para se adaptar ao tipo de aplicação que você está desenvolvendo, monólito, microsserviço, reativo, orientado a eventos, funções...

source: <a class="anchor" href="#http-microservices"></a>HTTP microservices
es: <a class="anchor" href="#http-microservices"></a>Microservicios HTTP
pt_br: <a class="anchor" href="#http-microservices"></a>Microsserviços HTTP

source: Let’s start with the basics: HTTP microservices. In this context, you need to develop an HTTP endpoint, often called REST or CRUD. You process incoming HTTP requests, and to do so you often need to rely on other services, such as databases, or another HTTP service.
es: Empecemos por lo básico: los microservicios HTTP. En este contexto, necesitas desarrollar un endpoint HTTP, a menudo llamado REST o CRUD. Procesas las peticiones HTTP entrantes, y para ello normalmente necesitas apoyarte en otros servicios, como bases de datos, o en otro servicio HTTP.
pt_br: Vamos começar com o básico: microsserviços HTTP. Nesse contexto, você precisa desenvolver um endpoint HTTP, geralmente chamado de REST ou CRUD. Você processa solicitações HTTP de entrada e, para isso, geralmente precisa confiar em outros serviços, como bancos de dados ou outro serviço HTTP.

source: For this type of application, Quarkus relies on well-known standards such as JAX-RS, JPA and MicroProfile Rest Client, but also Hibernate with Panache to simplify interactions with databases.
es: Para este tipo de aplicaciones, Quarkus se apoya en estándares conocidos como JAX-RS, JPA y MicroProfile Rest Client, pero también en Hibernate con Panache para simplificar las interacciones con las bases de datos.
pt_br: Para esse tipo de aplicação, o Quarkus conta com padrões bem conhecidos, como JAX-RS, JPA e MicroProfile Rest Client, mas também Hibernate com Panache para simplificar as interações com bancos de dados.

source: Let’s take a very simple application handling <em>elements</em> from the periodic table. The code would be something like:
es: Tomemos una aplicación muy sencilla que maneje <em>elementos</em> de la tabla periódica. El código sería algo así:
pt_br: Vamos pegar uma aplicação muito simples manipulando <em>elementos</em> da tabela periódica. O código seria algo como:

source: If you are a Java EE or Spring user, this development model should look familiar. You expose a resource containing methods annotated with <code>@GET</code>, <code>@POST</code>…&ZeroWidthSpace;&ZeroWidthSpace; to handle the different requests. The path is specified using the <code>@Path</code> annotation. Quarkus also supports <a href="https://quarkus.io/guides/spring-web">Spring controller</a> annotations such as <code>@GetMapping</code> or <code>@RestController</code>.
es: Si eres un usuario de Java EE o Spring, este modelo de desarrollo debería resultarte familiar. Se expone un recurso que contiene métodos anotados con <code>@GET</code>, <code>@POST</code>…&ZeroWidthSpace;&ZeroWidthSpace; ... para manejar las diferentes peticiones. La ruta se especifica utilizando la anotación <code>@Path</code>. Quarkus también soporta anotaciones del <a href="https://quarkus.io/guides/spring-web">Controlador de Spring</a> como <code>@GetMapping</code> or <code>@RestController</code>.
pt_br: Se você é um usuário Java EE ou Spring, esse modelo de desenvolvimento deve parecer familiar. Você expõe um recurso que contém métodos anotados com <code>@GET</code>, <code>@POST</code>... para lidar com as diferentes solicitações. O caminho é especificado usando a <code>@Path</code> anotação. O Quarkus também oferece suporte a anotações do <a href="https://quarkus.io/guides/spring-web">controlador Spring</a> , como <code>@GetMapping</code> ou <code>@RestController</code>.

source: You can use the JPA entity manager directly. Panache proposes an alternative removing boilerplate and exposing an active record and repository models.
es: Se puede utilizar el gestor de entidades JPA directamente. Panache propone una alternativa eliminando el boilerplate y exponiendo un registro activo y modelos de repositorio.
pt_br: Você pode usar o gerenciador de entidade JPA diretamente. Panache propõe uma alternativa removendo clichês e expondo uma solução active record e também modelado como um repositório.

source: With Panache, the <code>Element</code> class would be as simple as:
es: Con Panache, la clase <code>Element</code> sería tan simple como:
pt_br: Com o Panache, a classe <code>Element</code> seria tão simples quanto:

source: Microservices tend to come in systems. Let’s now imagine you need to access another HTTP endpoint. You can use an HTTP client directly; this is nothing more than repeating boilerplate code. Quarkus provides a way to call HTTP endpoints easily using the <a href="https://quarkus.io/guides/rest-client">MicroProfile Rest Client API</a>.
es: Los microservicios suelen venir en sistemas. Imaginemos ahora que necesitas acceder a otro endpoint HTTP. Puedes usar un cliente HTTP directamente; esto no es más que repetir código boilerplate. Quarkus proporciona una manera de llamar a los endpoints HTTP fácilmente utilizando la <a href="https://quarkus.io/guides/rest-client">API del cliente REST de MicroProfile</a>.
pt_br: Os microsserviços tendem a vir em sistemas. Agora vamos imaginar que você precise acessar outro endpoint HTTP. Você pode usar um cliente HTTP diretamente; isso nada mais é do que repetir código clichê. O Quarkus fornece uma maneira de chamar endpoints HTTP facilmente usando a <a href="https://quarkus.io/guides/rest-client">MicroProfile Rest Client API</a>.

source: First declare your service as follows:
es: Primero declare su servicio como sigue:
pt_br: Primeiro declare seu serviço da seguinte maneira:

source: For each call you are intending to do, add a method and use annotations to describe the behavior. You can combine the REST Client with the <a href="https://quarkus.io/guides/smallrye-fault-tolerance">fault tolerance extension</a> to handle failure gracefully. Then, in your resource, just use the <code>ElementService</code> interface:
es: Para cada llamada que pretendas hacer, añade un método y utiliza anotaciones para describir el comportamiento. Puedes combinar el cliente REST con la extensión <a href="https://quarkus.io/guides/smallrye-fault-tolerance">tolerancia a fallos</a> para manejar los fallos con elegancia. Luego, en tu recurso, sólo tienes que utilizar la interfaz <code>ElementService</code>:
pt_br: Para cada chamada que você pretende fazer, adicione um método e use anotações para descrever o comportamento. Você pode combinar o cliente REST com a <a href="https://quarkus.io/guides/smallrye-fault-tolerance">extensão de tolerância a falhas</a> para lidar com falhas normalmente. Depois, no seu recurso, basta utilizar a <code>ElementService</code> interface:

source: But you may be wondering where the URL is configured as it’s not in the code. Remember, it must not be hard-coded because the URL likely depends on the environment. The URL is configured in the application configuration:
es: Pero puede que te preguntes dónde está configurada la URL, ya que no está en el código. Recuerde que no debe estar codificado porque la URL probablemente depende del entorno. La URL se configura en la configuración de la aplicación:
pt_br: Mas você pode estar se perguntando onde a URL está configurada, pois não está no código. Lembre-se, ele não deve ser embutido em código porque a URL provavelmente depende do ambiente. A URL é configurada na configuração do aplicativo:

source: The URL can now be updated during the deployment or at launch time using system properties or environment variables.
es: Ahora se puede actualizar la URL durante el despliegue o en el momento del lanzamiento utilizando las propiedades del sistema o las variables de entorno.
pt_br: A URL agora pode ser atualizada durante a implantação ou no momento da inicialização usando propriedades do sistema ou variáveis de ambiente.

source: Quarkus is not limited to HTTP. You can use <a href="https://quarkus.io/guides/grpc-getting-started">gRPC</a> or <a href="https://quarkus.io/guides/smallrye-graphql">GraphQL</a>, two prominent alternatives in the microservice space.
es: Quarkus no se limita a HTTP. Puede utilizar <a href="https://quarkus.io/guides/grpc-getting-started">gRPC</a> o <a href="https://quarkus.io/guides/smallrye-graphql">GraphQL</a>, dos alternativas destacadas en el espacio de los microservicios.
pt_br: O Quarkus não está limitado a HTTP. Você pode usar <a href="https://quarkus.io/guides/grpc-getting-started">gRPC</a> ou <a href="https://quarkus.io/guides/smallrye-graphql">GraphQL</a>, duas alternativas proeminentes no espaço de microsserviços.

source: <a class="anchor" href="#being-reactive"></a>Being reactive
es: <a class="anchor" href="#being-reactive"></a>Ser reactivo
pt_br: <a class="anchor" href="#being-reactive"></a>Sendo reativo

source: Application requirements have changed drastically over the last few years. For any application to succeed in the era of cloud computing, Big Data, or IoT, going reactive is increasingly becoming the architecture style to follow.
es: Los requisitos de las aplicaciones han cambiado drásticamente en los últimos años. Para que cualquier aplicación tenga éxito en la era de la computación en la nube, el Big Data o el IoT, ser reactivo se está convirtiendo cada vez más en el estilo de arquitectura a seguir.
pt_br: Os requisitos das aplicações mudaram drasticamente nos últimos anos. Para que qualquer aplicação tenha sucesso na era da computação em nuvem, Big Data ou IoT, tornar-se reativo está se tornando cada vez mais o estilo de arquitetura a ser seguido.

source: Today’s users embrace applications with milliseconds of response time, 100% uptime, lower latency, push data instead of pull, higher throughput, and elasticity. However, these features are nearly impossible to achieve using yesterday’s software architecture without a considerable investment in resources, infrastructure, and tooling. The world changed, and having dozens of servers, long response times (&gt; 500 ms), downtime due to maintenance or waterfalls of failures does not meet the expected user experience.
es: Los usuarios de hoy en día prefieren aplicaciones con un tiempo de respuesta de milisegundos, un tiempo de actividad del 100%, menor latencia, datos push en lugar de pull, mayor rendimiento y elasticidad. Sin embargo, estas características son casi imposibles de conseguir con la arquitectura de software de ayer sin una inversión considerable en recursos, infraestructura y herramientas. El mundo ha cambiado, y tener docenas de servidores, largos tiempos de respuesta (&gt; 500 ms), tiempos de inactividad por mantenimiento o cascadas de fallos no satisface la experiencia de usuario esperada.
pt_br: Os usuários de hoje adotam aplicações com milissegundos de tempo de resposta, disponibilidade de 100%, menor latência, dados por push em vez de pull, maior taxa de transferência e elasticidade. No entanto, esses recursos são quase impossíveis de alcançar usando a arquitetura de software de ontem sem um investimento considerável em recursos, infraestrutura e ferramentas. O mundo mudou, e ter dezenas de servidores, longos tempos de resposta (&gt; de 500 ms), tempo de inatividade devido a manutenção ou cascatas de falhas não atende à experiência esperada do usuário.

source: Quarkus aids you on your journey to reactive. Quarkus is based on a <a href="https://quarkus.io/version/main/guides/quarkus-reactive-architecture">reactive core</a> allowing your application to mix reactive and imperative components. As an example, you can implement reactive HTTP endpoint using the <a href="https://quarkus.io/guides/resteasy-reactive">RESTEasy Reactive extension</a> as follows:
es: Quarkus te ayuda en tu viaje hacia lo reactivo. Quarkus se basa en un <a href="https://quarkus.io/version/main/guides/quarkus-reactive-architecture">núcleo reactivo</a>que permite a tu aplicación mezclar componentes reactivos e imperativos. Como ejemplo, puedes implementar un endpoint HTTP reactivo usando la extensión <a href="https://quarkus.io/guides/resteasy-reactive">RESTEasy Reactive</a> como sigue:
pt_br: Quarkus ajuda você em sua jornada para reativo. O Quarkus é baseado em um <a href="https://quarkus.io/version/main/guides/quarkus-reactive-architecture">núcleo reativo</a> , permitindo que sua aplicação misture componentes reativos e imperativos. Como exemplo, você pode implementar o endpoint HTTP reativo usando a <a href="https://quarkus.io/guides/resteasy-reactive">extensão RESTEasy Reactive</a> da seguinte maneira:

source: Thanks to the <a href="https://quarkus.io/version/main/guides/mutiny-primer">Mutiny Reactive API</a> , you can compose asynchronous operations and complete the result when everything is done without blocking the I/O threads. This greatly improves resource consumption and elasticity. Most Quarkus APIs are available in both imperative and reactive. As example, you can use the reactive version of the REST Client:
es: Gracias a la <a href="https://quarkus.io/version/main/guides/mutiny-primer">API Reactiva de Mutiny</a> , puedes componer operaciones asíncronas y completar el resultado cuando todo esté hecho sin bloquear los hilos de E/S. Esto mejora mucho el consumo de recursos y la elasticidad. La mayoría de las APIs de Quarkus están disponibles tanto en imperativo como en reactivo. Como ejemplo, puede utilizar la versión reactiva del Cliente REST:
pt_br: Graças à <a href="https://quarkus.io/version/main/guides/mutiny-primer">Mutiny Reactive API</a> , você pode compor operações assíncronas e concluir o resultado quando tudo for feito sem bloquear os threads de E/S. Isso melhora muito o consumo de recursos e a elasticidade. A maioria das APIs do Quarkus está disponível em imperativa e reativa. Como exemplo, você pode usar a versão reativa do cliente REST:

source: But, what about streams? Generating a <em>server-sent event</em> response with Quarkus is just as simple:
es: Pero, ¿qué pasa con los flujos? Generar una respuesta de <em>evento enviado por el servidor</em>; con Quarkus es igual de sencillo:
pt_br: Mas, e os streamings? Gerar uma resposta <em>server-sent event</em> com o Quarkus é igualmente simples:

source: <a class="anchor" href="#event-driven-architectures"></a>Event-driven Architectures
es: <a class="anchor" href="#event-driven-architectures"></a>Arquitecturas dirigidas por eventos
pt_br: <a class="anchor" href="#event-driven-architectures"></a>Arquiteturas orientadas a eventos

source: However, HTTP characteristics prohibit implementing <a href="https://www.reactivemanifesto.org/">reactive systems</a>, where all the components interact using asynchronous messages passing.
es: Sin embargo, las características de HTTP prohíben implementar <a href="https://www.reactivemanifesto.org/">sistemas reactivos</a>, en los que todos los componentes interactúan utilizando el paso de mensajes asíncronos.
pt_br: No entanto, as características HTTP proíbem a implementação de <a href="https://www.reactivemanifesto.org/">sistemas reativos</a>, onde todos os componentes interagem usando a passagem assíncrona de mensagens.

source: First, you can consume messages from various brokers such as AMQP or Apache Kafka, and process these messages smoothly:
es: En primer lugar, puede consumir mensajes de varios brokers como AMQP o Apache Kafka, y procesar estos mensajes sin problemas:
pt_br: Primeiro, você pode consumir mensagens de vários brokers, como AMQP ou Apache Kafka, e processar essas mensagens sem problemas:

source: The <code>@Incoming</code> and <code>@Outgoing</code> annotations are part of <a href="https://www.smallrye.io/smallrye-reactive-messaging">Reactive Messaging</a>. They are used to express from which <em>channel</em> you are consuming and to which <em>channel</em> you are sending. Thanks to Reactive Messaging you can consume and send messages from and to different brokers and transports such as HTTP, Kafka, or <a href="http://camel.apache.org">Apache Camel</a>.
es: Las anotaciones <code>@Incoming</code> y <code>@Outgoing</code> forman parte de <a href="https://www.smallrye.io/smallrye-reactive-messaging">Mensajería Reactiva</a>. Se utilizan para expresar desde qué <em>canal</em>estás consumiendo y a qué <em>canal</em> estás enviando. Gracias a la Mensajería Reactiva puedes consumir y enviar mensajes desde y hacia diferentes brokers y transportes como HTTP, Kafka, o <a href="http://camel.apache.org">Apache Camel</a>.
pt_br: As anotações<code>@Incoming</code> e <code>@Outgoing</code> fazem parte do <a href="https://www.smallrye.io/smallrye-reactive-messaging">Reactive Messaging</a>. Eles são usados para expressar de qual <em>channel</em> você está consumindo e para qual <em>channel</em> você está enviando. Graças ao Reactive Messaging, você pode consumir e enviar mensagens de e para diferentes brokers e transportes, como HTTP, Kafka ou <a href="http://camel.apache.org">Apache Camel</a>.

source: Sometimes you need more than just handling messages one by one. You can also express your message processing logic using reactive programming as illustrated in the following snippet:
es: A veces se necesita algo más que manejar los mensajes uno a uno. También puede expresar su lógica de procesamiento de mensajes utilizando la programación reactiva, como se ilustra en el siguiente fragmento:
pt_br: Às vezes, você precisa de mais do que apenas lidar com mensagens uma a uma. Você também pode expressar sua lógica de processamento de mensagens usando programação reativa, conforme ilustrado no trecho a seguir:

source: As for the reactive APIs exposed by Quarkus, stream manipulation uses the Mutiny API.
es: En cuanto a las APIs reactivas expuestas por Quarkus, la manipulación de flujos utiliza la API Mutiny.
pt_br: Quanto às APIs reativas expostas pelo Quarkus, a manipulação de fluxo usa a API Mutiny .

source: <a class="anchor" href="#functions-as-a-service-and-serverless"></a>Functions as a Service and Serverless
es: <a class="anchor" href="#functions-as-a-service-and-serverless"></a>Funciones como servicio y sin servidor

source: Thanks to their stellar startup time and low memory usage, you can implement functions using Quarkus to be used in serverless environments. Quarkus provides Funqy, an approach to writing functions that are deployable to various FaaS environments like AWS Lambda, Azure Functions, Knative, and Knative Events (Cloud Events). It is also usable as a standalone service.
es: Gracias a su tiempo de inicio estelar y su bajo uso de memoria, puedes implementar funciones usando Quarkus para ser utilizadas en entornos sin servidor. Quarkus proporciona Funqy, un enfoque para escribir funciones que se pueden desplegar en varios entornos FaaS como AWS Lambda, Azure Functions, Knative y Knative Events (Cloud Events). También se puede utilizar como un servicio independiente.
pt_br: Graças ao seu excelente tempo de inicialização e baixo uso de memória, você pode implementar funções usando o Quarkus para serem usadas em ambientes sem servidor. O Quarkus fornece o Funqy, uma abordagem para escrever funções que podem ser implantadas em vários ambientes FaaS, como AWS Lambda, Azure Functions, Knative, e Knative Events (Cloud Events). Também é utilizável como um serviço independente.

source: With Funqy, a function is just:
es: Con Funqy, una función es simplemente:
pt_br: Com o Funqy, uma função é apenas:

source: You can use any of the Quarkus features in your function and benefit from the fast startup and low memory utilization. With Quarkus, you can embrace this new world without having to change your programming language.
es: Puede utilizar cualquiera de las características de Quarkus en su función y beneficiarse de la rápida puesta en marcha y la baja utilización de la memoria. Con Quarkus, puedes abrazar este nuevo mundo sin tener que cambiar tu lenguaje de programación.
pt_br: Você pode usar qualquer um dos recursos do Quarkus em sua função e se beneficiar da inicialização rápida e da baixa utilização de memória. Com o Quarkus, você pode abraçar esse novo mundo sem ter que mudar sua linguagem de programação.
