Repository: quarkusio/pt.quarkus.io
Catalog: l10n/po/*/_includes/developer-joy.html.po
Languages: pt_br

source: Quarkus is not just about being great for writing Web Applications or Micro-Services. We’re focusing on more than the feature set: we make sure that every feature works well, simply, with little to no configuration, in the most intuitive way possible. It should be trivial to develop simple things, and easy to develop the more complex ones.
pt_br: O Quarkus não é apenas sobre ser ótimo para escrever Aplicações Web ou Micro-Serviços. Estamos nos concentrando em mais do que o conjunto de recursos: garantimos que todos os recursos funcionem bem, de forma simples, com pouca ou nenhuma configuração, da maneira mais intuitiva possível. Deve ser trivial desenvolver coisas simples, e fácil desenvolver as mais complexas.

source: Live Coding
pt_br: Codificação ao vivo

source: Improve and expedite the inner loop development process with live coding where code changes are automatically reflected in your running application. code -> refresh browser -> repeat
pt_br: Melhore e agilize o processo de desenvolvimento de loop interno com codificação em tempo real, onde as alterações de código são refletidas automaticamente em sua aplicação em execução. código -> atualizar navegador -> repetir

source: <a href="{{site.baseurl}}/guides/maven-tooling#dev-mode/">Read the Dev Mode guide</a>
pt_br: <a href="{{site.baseurl}}/guides/maven-tooling#dev-mode/">Leia o guia do Modo de Desenvolvimento</a>

source: Unified Config
pt_br: Configuração unificada

source: Gone are the days of a thousand configuration files and formats. A single configuration file is all it takes for Quarkus applications to configure every single extension.
pt_br: Foi-se o tempo de mil arquivos de configuração e formatos. Basta um único arquivo de configuração para que os aplicativos do Quarkus configurem cada extensão.

source: Opinionated
pt_br: Dogmático

source: Quarkus focuses on the simplest and most useful way to use a given feature, trimming it to its most useful essence. This includes upfront analysis on how to best use a feature and guiding you in what we think is the best way to do things.
pt_br: O Quarkus se concentra na maneira mais simples e útil de usar um determinado recurso, cortando-o para sua essência mais útil. Isso inclui uma análise inicial sobre como usar melhor um recurso e orientá-lo no que achamos ser a melhor maneira de fazer as coisas.

source: Dev UI
pt_br: Interface do usuário do desenvolvedor

source: Visualize and configure extensions as well as access to application logs and testing components
pt_br: Visualize e configure extensões, bem como acesso a logs de aplicativos e componentes de teste

source: <a href="{{site.baseurl}}/guides/dev-ui">Read the Dev UI guide</a>
pt_br: <a href="{{site.baseurl}}/guides/dev-ui">Leia o guia da interface do usuário do desenvolvedor</a>

source: Dev Services
pt_br: Serviços de Desenvolvimento

source: Automatic provisioning and application wiring of supporting services such as databases, identity servers, and more.
pt_br: Provisionamento automático e conexão de aplicações de serviços de suporte, como bancos de dados, servidores de identidade e muito mais.

source: <a href="{{site.baseurl}}/guides/dev-services">Read the Dev Services guide</a>
pt_br: <a href="{{site.baseurl}}/guides/dev-services">Leia o guia de Serviços de Desenvolvimento</a>

source: Continuous Testing
pt_br: Testes contínuos

source: Get instant feedback on code changes as tests run in the background on impacted code.
pt_br: Obtenha feedback instantâneo sobre alterações de código à medida que os testes são executados em segundo plano no código afetado.

source: <a href="{{site.baseurl}}/guides/continuous-testing">Read the Continuous Testing guide</a>
pt_br: <a href="{{site.baseurl}}/guides/continuous-testing">Leia o guia de Testes Contínuos</a>

source: Command Line Interface
pt_br: Interface da linha de comandos

source: Create projects, manage extensions, and execute essential build and dev commands.
pt_br: Crie projetos, gerencie extensões e execute comandos essenciais de compilação e desenvolvimento.

source: <a href="{{site.baseurl}}/guides/cli-tooling">Read the CLI Tooling guide</a>
pt_br: <a href="{{site.baseurl}}/guides/cli-tooling">Leia o guia de ferramentas da CLI</a>

source: Remote Development
pt_br: Desenvolvimento Remoto

source: Run <a href="{{site.baseurl}}/guides/maven-tooling#dev-mode">dev mode</a> remotely with changes to local files immediately available in a containerize environment.
pt_br: Execute o <a href="{{site.baseurl}}/guides/maven-tooling#dev-mode">modo de desenvolvimento</a> remotamente com alterações em arquivos locais imediatamente disponíveis em um ambiente de conteinerização.

source: <a href="{{site.baseurl}}/guides/maven-tooling#remote-development-mode">Read the Remote Development Mode guide</a>
pt_br: <a href="{{site.baseurl}}/guides/maven-tooling#remote-development-mode">Leia o guia do Modo de Desenvolvimento Remoto</a>
