Repository: quarkusio/pt.quarkus.io
Catalog: l10n/po/*/_includes/faq.html.po
Languages: es

source: What is your license?
es: ¿Qué licencia tiene?

source: Quarkus is an Open Source project licensed under the <a href="https://www.apache.org/licenses/LICENSE-2.0">Apache License version 2.0</a>.
es: Quarkus es un proyecto de código abierto con licencia <a href="https://www.apache.org/licenses/LICENSE-2.0">Licencia Apache versión 2.0</a>.

source: Where can I get it?
es: ¿Dónde puedo conseguirlo?

source: Quarkus is published in Maven Central, check out <a href="/extensions">which extensions</a> you need and just import them in your <code>pom.xml</code> to get Quarkus. We recommend you start your Quarkus experience via our <a href="/get-started">Getting Started guides</a>.
es: Quarkus está publicado en Maven Central, consulta <a href="/extensions">qué extensiones</a> necesitas y sólo tienes que importarlas en tu <code>pom.xml</code> para obtener Quarkus. Te recomendamos que comiences tu experiencia con Quarkus a través de nuestras <a href="/get-started">Guías de inicio</a>.

source: Quarkus is stable?
es: ¿Quarkus es estable?

source: Yes, we consider Quarkus stable. Remember 95% of the features Quarkus apps use are provided by the ecosystem like Hibernate ORM, Eclipse Vert.x, Netty, RESTEasy, etc. These libraries are rock solid :)
es: Sí, consideramos que Quarkus es estable. Recuerde que el 95% de las características que utilizan las aplicaciones de Quarkus son proporcionadas por el ecosistema como Hibernate ORM, Eclipse Vert.x, Netty, RESTEasy, etc. Estas bibliotecas son sólidas como una roca :)

source: You can go to <a href="https://code.quarkus.io/">code.quarkus.io</a> to see if a particular extension is <em>stable</em> (default) or <em>preview</em>.
es: Puedes ir a <a href="https://code.quarkus.io/">code.quarkus.io</a> para ver si una extensión concreta es <em>stable</em> (default) or <em>preview</em>.

source: What is a Quarkus extension?
es: ¿Qué es una extensión de Quarkus?

source: One of the main goals of Quarkus is ease of extensibility and to build a vibrant ecosystem.
es: Uno de los principales objetivos de Quarkus es la facilidad de extensibilidad y la construcción de un ecosistema vibrante.

source: Think of Quarkus extensions as your project dependencies. Extensions configure, boot and integrate a framework or technology into your Quarkus application. They also do all of the heavy lifting of providing the right information to GraalVM for your application to compile natively. This will allow 3rd party projects to easily take advantage of the work we have done to make it easier to target GraalVM.
es: Piense en las extensiones de Quarkus como en las dependencias de tu proyecto. Las extensiones configuran, arrancan e integran un framework o tecnologías en tu aplicación Quarkus. También hacen todo el trabajo pesado de proporcionar la información correcta a GraalVM para que su aplicación compile de forma nativa. Esto permite a los proyectos de terceros aprovechar fácilmente el trabajo que hemos realizado para que sea más fácil utilizar GraalVM.

source: What are the extension statuses?
es: ¿Cuáles son los estados de las extensiones?

source: Extensions have a various degree of maturity when they enter the Quarkus ecosystem. A status offers the expectations you can rely on.
es: Las extensiones tienen varios grados de madurez a medida que ingresan al ecosistema de Quarkus. El estado ofrece el valor esperado de confianza.

source: <strong>Stable</strong>: backward compatibility and presence in the ecosystem are taken very seriously. An application can safely rely on these extensions. Extensions not marked as preview or experimental (the majority) are stable.
es: <strong>Stable</strong>: la compatibilidad con versiones anteriores y la presencia en el ecosistema se toman muy en serio. Una aplicación puede confiar con seguridad en estas extensiones. Las extensiones que no están marcadas como preview o experimental (la mayoría) son estables.

source: <strong>Preview</strong>: backward compatibility and presence in the ecosystem is not guaranteed. Specific improvements might require to change configuration or APIs and plans to become <em>stable</em> are under way. Such extensions are in the middle of their maturation process.
es: <strong>Preview</strong>: la compatibilidad con versiones anteriores y la presencia en el ecosistema no están garantizadas. Ciertas mejoras podrían requerir cambios de configuración o API y los planes para convertirse en <em>stable</em> están en marcha. Estas extensiones están en pleno proceso de maduración.

source: <strong>Experimental</strong>: early feedback is requested to mature the idea. There is no guarantee of stability nor long term presence in the platform until the solution matures. Such extensions are at the beginning of their maturation process.
es: <strong>Experimental</strong>: se solicita un feedback temprano para madurar la idea. No se garantiza la estabilidad ni la presencia a largo plazo en la plataforma hasta que la solución madure. Dichas extensiones están en el inicio de su proceso de maduración.

source: You can find the extension status on <a href="https://code.quarkus.io">code.quarkus.io</a> or in the extension <a href="/guides/">guides</a>.
es: Puedes encontrar el estado de la extensión en <a href="https://code.quarkus.io">code.quarkus.io</a> o en las <a href="/guides/">guías de la extensión</a>.

source: Will the Quarkus team accept my extension?
es: ¿El equipo de Quarkus aceptará mi extensión?

source: Oh yeah! We had quite a few extensions written outside the Quarkus "initial" team.
es: ¡Por supuesto! Se ha creado un número significativo de extensiones fuera del equipo "inicial" de Quarkus.

source: Quarkus is an open ecosystem and we hope to see all the extensions people need to write their apps. We are working as we speak to allow an extension to be published in separate repos and separate GAVs and thus published in Maven repos independently of Quarkus core. This will greatly simplify the publication process. Expect news soon.
es: Quarkus es un ecosistema abierto y esperamos ver todas las extensiones que la gente necesita para escribir sus aplicaciones. Estamos trabajando mientras hablamos para permitir que una extensión se publique en repositorios y GAVs separados y por lo tanto se publique en repositorios de Maven independientes del core de Quarkus. Esto simplificará enormemente el proceso de publicación. Espere noticias pronto.

source: The one current restriction is that extensions should work in both OpenJDK and GraalVM native executables. That is the guarantee we give Quarkus users (a cross compilation for their app). We have a maturity model to improve an extension to be fully "Quarked" and benefit from Quarkus, all done in incremental steps. Just hop on our <a href="https://quarkus.io/community/#discussions">mailing list</a> to discuss your ideas and get help. And you can start reading our <a href="https://quarkus.io/guides/writing-extensions">Writing extensions guide</a> as well or more simply get inspiration from the <a href="https://github.com/quarkusio/quarkus/tree/master/extensions">existing ones</a>.
es: La única restricción actual es que las extensiones deben funcionar tanto en OpenJDK como en los ejecutables nativos de GraalVM. Esa es la garantía que damos a los usuarios de Quarkus (una compilación cruzada para su aplicación). Tenemos un modelo de madurez para mejorar una extensión para que sea totalmente "Quarked" y se beneficie de Quarkus, todo hecho en pasos incrementales. Sólo tienes que entrar en nuestra <a href="https://quarkus.io/community/#discussions">lista de correo</a> para discutir tus ideas y obtener ayuda. Y también puedes empezar a leer nuestra <a href="https://quarkus.io/guides/writing-extensions">Guía para escribir extensiones</a> o simplemente inspirarte en las <a href="https://github.com/quarkusio/quarkus/tree/master/extensions">existentes</a>.

source: What is GraalVM?
es: ¿Qué es GraalVM?

source: <a href="https://www.graalvm.org">GraalVM</a> is a universal virtual machine for running applications written in various different languages, as well as providing the ability to compile JVM bytecode to a native executable (this native executable runs a special virtual machine called SubstrateVM). These native executables start much faster and can use a lot less memory than a traditional JVM, however not every JVM feature is supported, and some are more limited than normal.
es: <a href="https://www.graalvm.org">GraalVM</a> es una máquina virtual universal para ejecutar aplicaciones escritas en varios lenguajes diferentes, además de proporcionar la capacidad de compilar bytecode de JVM a un ejecutable nativo (este ejecutable nativo ejecuta una máquina virtual especial llamada SubstrateVM). Estos ejecutables nativos se inician mucho más rápido y pueden utilizar mucha menos memoria que una JVM tradicional, sin embargo, no todas las características de la JVM son compatibles, y algunas están más limitadas de lo normal.

source: For example by default reflection in GraalVM will not work, unless a class/member has been explicitly registered for reflection. This is normally achieved by listing every class, method, field and constructor in a JSON file, and passing this as a parameter into the native image build. This obviously gets quite cumbersome for all but the most trivial projects. Quarkus provides a framework that makes it easy to work around these annotations, and programmatically determine what should be registered.
es: Por ejemplo, por defecto, la reflexión en GraalVM no funcionará, a menos que una clase/miembro se haya registrado explícitamente para la reflexión. Esto se consigue normalmente enumerando cada clase, método, campo y constructor en un archivo JSON, y pasando esto como un parámetro en la construcción de la imagen nativa. Esto, obviamente, se vuelve bastante engorroso para todos los proyectos, excepto los más triviales. Quarkus proporciona un marco que hace que sea fácil trabajar alrededor de estas anotaciones, y determinar mediante programación lo que debe ser registrado.

source: How do you unify imperative and reactive programming?
es: ¿Cómo se unifica la programación imperativa y la reactiva?

source: <a href="/vision/continuum">Learn more</a>.
es: <a href="/vision/continuum">Más información</a>.

source: What does Container First mean?
es: ¿Qué significa contenedor primero?

source: <a href="/vision/container-first">Learn more</a>.
es: <a href="/vision/container-first">Más información</a>.

source: What is your view on standards?
es: ¿Cuál es su punto de vista sobre los estándares?

source: <a href="/vision/standards">Learn more</a>.
es: <a href="/vision/standards">Más información</a>.

source: What are you doing to improve developer joy?
es: ¿Qué está haciendo para mejorar la alegría de los desarrolladores?

source: <a href="/vision/developer-joy">Learn more</a>.
es: <a href="/vision/developer-joy">Aprende más</a>.
