Repository: quarkusio/pt.quarkus.io
Catalog: l10n/po/*/_includes/feedback-community-band.html.po
Languages: es, pt_br

source: Feedback and Help
es: Comentarios y ayuda
pt_br: Feedback e ajuda

source: For usage questions, we recommend to:
es: Para preguntas sobre el uso, recomendamos:
pt_br: Para perguntas de uso, recomendamos:

source: Use the <a href="https://github.com/quarkusio/quarkus/discussions">Discussions</a> section on our GitHub project.
es: Utilice la sección <a href="https://github.com/quarkusio/quarkus/discussions">Discusiones</a> de nuestro proyecto GitHub.
pt_br: Use a seção <a href="https://github.com/quarkusio/quarkus/discussions">Discussões</a> em nosso projeto GitHub.

source: Ask on <a href="https://stackoverflow.com/questions/tagged/quarkus">Stack Overflow with the <code>quarkus</code> tag</a>
es: Pregunta en <a href="https://stackoverflow.com/questions/tagged/quarkus"Stack Overflow con la etiqueta <code>quarkus</code></a>
pt_br: Pergunte no <a href="https://stackoverflow.com/questions/tagged/quarkus">Stack Overflow com a tag <code>quarkus</code></a>

source: For questions related to the development of Quarkus:
es: Para cuestiones relacionadas con el desarrollo de Quarkus:
pt_br: Para questões relacionadas ao desenvolvimento do Quarkus:

source: The <a href="https://groups.google.com/d/forum/quarkus-dev" target="_blank">quarkus-dev Google Groups</a>
es: Los grupos de Google de <a href="https://groups.google.com/d/forum/quarkus-dev" target="_blank">quarkus-dev</a>
pt_br: O <a href="https://groups.google.com/d/forum/quarkus-dev" target="_blank">quarkus-dev Google Groups</a>

source: Chat using <a href="https://quarkusio.zulipchat.com" target="_blank">Zulip</a> (<code>#dev</code> stream)
es: Chat con <a href="https://quarkusio.zulipchat.com" target="_blank">Zulip</a> (<code>#dev</code> stream)
pt_br: Bate-papo usando <a href="https://quarkusio.zulipchat.com" target="_blank">Zulip</a> (<code>#dev</code> stream)

source: Join the Quarkus Community
es: Únase a la Comunidad Quarkus
pt_br: Junte-se à Comunidade Quarkus

source: Check out our <a href="https://github.com/quarkusio/quarkus" target="_blank">GitHub</a> for details on reporting issues and the process for submitting pull requests.
es: Consulta nuestro <a href="https://github.com/quarkusio/quarkus" target="_blank">GitHub</a> para conocer los detalles sobre la notificación de problemas y el proceso de envío de pull requests.
pt_br: Confira nosso <a href="https://github.com/quarkusio/quarkus" target="_blank">GitHub</a> para obter detalhes sobre como relatar problemas e o processo de envio de pull requests.

source: Every contribution is valuable. It can be a bug report, an example application, a feature request, a fix in the documentation or just feedback.
es: Todas las contribuciones son valiosas. Puede ser un informe de errores, una aplicación de ejemplo, una solicitud de función, una corrección en la documentación o simplemente un comentario.
pt_br: Todas as contribuições são valiosas. Pode ser um relatório de bug, um exemplo de aplicação, uma melhoria, uma correção na documentação ou apenas um feedback.

source: Your help is more than welcome! Don’t hesitate to join the crowd.
es: Tu ayuda es más que bienvenida. No dudes en unirte a la multitud.
pt_br: A sua ajuda é mais do que bem-vinda! Não hesite em juntar-se à multidão.
