Repository: quarkusio/pt.quarkus.io
Catalog: l10n/po/*/_includes/get-started-code-steps.html.po
Languages: es

source: Step <span class="step-no">1</span>
es: Paso <span class="step-no">1</span>

source: Install via Command Line Interface
es: Instalación a través de la interfaz de línea de comandos

source: Open your favorite terminal and use JBang to install the Quarkus CLI. You do not need to have Java installed first.
es: Abre tu terminal favorito y usa JBang para instalar el Quarkus CLI. No es necesario tener Java instalado primero.

source: For Linux, macOS, and Windows (using WSL or bash compatible shell like Cygwin or MinGW)
es: Para Linux, macOS y Windows (utilizando WSL o un shell compatible con bash como Cygwin o MinGW)

source: For Windows using Powershell
es: Para Windows utilizando Powershell

source: If it's your first time to install, you'll need to restart your shell.
es: Si es la primera vez que se instala, tendrá que reiniciar el shell.

source: Or, you can also install the CLI with SDKMAN!
es: ¡O también puedes instalar la CLI con SDKMAN!

source: For more options, such as Homebrew or Chocolatey, see <a href="/guides/cli-tooling">the Quarkus CLI guide</a>.
es: Para más opciones, como Homebrew o Chocolatey, véase <a href="/guides/cli-tooling">la guía de la CLI de Quarkus</a>.

source: Step <span class="step-no">2</span>
es: Paso <span class="step-no">2</span>

source: Create the Getting Started Application
es: Crear la aplicación de inicio

source: Run this script in your CLI:
es: Ejecute este script en su CLI:

source: Step <span class="step-no">3</span>
es: Paso <span class="step-no">3</span>

source: Run the Getting Started Application
es: Ejecutar la aplicación de inicio

source: Boom! Your Quarkus app is now running at <code>localhost:8080</code>
es: ¡Boom! Su aplicación Quarkus se ejecuta ahora en <code>localhost:8080</code>

source: Step <span class="step-no">4</span>
es: Paso <span class="step-no">4</span>

source: Live Coding with Quarkus
es: Codificación en vivo con Quarkus

source: Quarkus makes it easy to change your code on the fly. Let's modify the <a href="http://localhost:8080/hello">RESTful endpoint</a>
es: Quarkus facilita la modificación de su código sobre la marcha. Vamos a modificar el <a href="http://localhost:8080/hello">endpoint RESTful</a>

source: Cool stuff right? <a href="https://quarkus.io/guides/maven-tooling#dev-mode">Learn more about Quarkus's dev mode</a>.
es: Es una cosa genial, ¿verdad? <a href="https://quarkus.io/guides/maven-tooling#dev-mode">Aprende más sobre el modo de desarrollo de Quarkus</a>.
