Repository: quarkusio/pt.quarkus.io
Catalog: l10n/po/*/_includes/header-navigation.html.po
Languages: pt_br

source: <span href="{{site.baseurl}}/about/">Why<i class="fas fa-chevron-down"></i></span>
pt_br: <span href="{{site.baseurl}}/about/">Por que<i class="fas fa-chevron-down"></i></span>

source: <a href="{{site.baseurl}}/about" class="{% if page.url contains '/about/' %}active{% endif %}">WHAT IS QUARKUS?</a>
pt_br: <a href="{{site.baseurl}}/about" class="{% if page.url contains '/about/' %}active{% endif %}">O QUE É QUARKUS?</a>

source: <a href="{{site.baseurl}}/container-first" class="{% if page.url contains '/container-first/' %}active{% endif %}">CONTAINER FIRST</a>
pt_br: <a href="{{site.baseurl}}/container-first" class="{% if page.url contains '/container-first/' %}active{% endif %}">CONTAINER PRIMEIRO</a>

source: <a href="{{site.baseurl}}/continuum" class="{% if page.url contains '/continuum/' %}active{% endif %}">REACTIVE</a>
pt_br: <a href="{{site.baseurl}}/continuum" class="{% if page.url contains '/continuum/' %}active{% endif %}">REATIVO</a>

source: <a href="{{site.baseurl}}/developer-joy" class="{% if page.url contains '/developer-joy/' %}active{% endif %}">DEVELOPER JOY</a>
pt_br: <a href="{{site.baseurl}}/developer-joy" class="{% if page.url contains '/developer-joy/' %}active{% endif %}">ALEGRIA DO DESENVOLVEDOR</a>

source: <a href="{{site.baseurl}}/kubernetes-native" class="{% if page.url contains '/kubernetes-native/' %}active{% endif %}">KUBERNETES NATIVE</a>
pt_br: <a href="{{site.baseurl}}/kubernetes-native" class="{% if page.url contains '/kubernetes-native/' %}active{% endif %}">KUBERNETES NATIVO</a>

source: <a href="{{site.baseurl}}/standards" class="{% if page.url contains '/standards/' %}active{% endif %}">STANDARDS</a>
pt_br: <a href="{{site.baseurl}}/standards" class="{% if page.url contains '/standards/' %}active{% endif %}">PADRÕES</a>

source: <span href="{{site.baseurl}}/learn/">Learn<i class="fas fa-chevron-down"></i></span>
pt_br: <span href="{{site.baseurl}}/learn/">Aprenda<i class="fas fa-chevron-down"></i></span>

source: <a href="{{site.baseurl}}/get-started" class="{% if page.url contains '/get-started/' %}active{% endif %}">GET STARTED</a>
pt_br: <a href="{{site.baseurl}}/get-started" class="{% if page.url contains '/get-started/' %}active{% endif %}">COMEÇAR</a>

source: <a href="{{site.baseurl}}/guides" class="{% if page.url contains '/guides/' %}active{% endif %}">DOCUMENTATION</a>
pt_br: <a href="{{site.baseurl}}/guides" class="{% if page.url contains '/guides/' %}active{% endif %}">DOCUMENTAÇÃO</a>

source: <a href="{{site.baseurl}}/qtips" class="{% if page.url contains '/qtips/' %}active{% endif %}">"Q" TIP VIDEOS</a>
pt_br: <a href="{{site.baseurl}}/qtips" class="{% if page.url contains '/qtips/' %}active{% endif %}">VÍDEOS "Q" TIP</a>

source: <a href="{{site.baseurl}}/books" class="{% if page.url contains '/books/' %}active{% endif %}">BOOKS</a>
pt_br: <a href="{{site.baseurl}}/books" class="{% if page.url contains '/books/' %}active{% endif %}">LIVROS</a>

source: <span href="https://quarkus.io/extensions/">Extensions<i class="fas fa-chevron-down"></i></span>
pt_br: <span href="https://quarkus.io/extensions/">Extensões<i class="fas fa-chevron-down"></i></span>

source: <a href="https://quarkus.io/extensions/" class="{% if page.url contains '/extensions/' %}active{% endif %}">BROWSE EXTENSIONS</a>
pt_br: <a href="https://quarkus.io/extensions/" class="{% if page.url contains '/extensions/' %}active{% endif %}">PROCURAR EXTENSÕES</a>

source: <a href="{{site.baseurl}}/faq/#what-is-a-quarkus-extension" class="{% if page.url contains 'what-is-a-quarkus-extension' %}active{% endif %}">USE EXTENSIONS</a>
pt_br: <a href="{{site.baseurl}}/faq/#what-is-a-quarkus-extension" class="{% if page.url contains 'what-is-a-quarkus-extension' %}active{% endif %}">USAR EXTENSÕES</a>

source: <a href="{{site.baseurl}}/guides/writing-extensions" class="{% if page.url contains '/guides/writing-extensions' %}active{% endif %}">CREATE EXTENSIONS</a>
pt_br: <a href="{{site.baseurl}}/guides/writing-extensions" class="{% if page.url contains '/guides/writing-extensions' %}active{% endif %}">CRIAR EXTENSÕES</a>

source: <a href="https://hub.quarkiverse.io" class="{% if page.url contains 'hub.quarkiverse.io' %}active{% endif %}">SHARE EXTENSIONS</a>
pt_br: <a href="https://hub.quarkiverse.io" class="{% if page.url contains 'hub.quarkiverse.io' %}active{% endif %}">COMPARTILHE EXTENSÕES</a>

source: <span href="{{site.baseurl}}/community/">Community<i class="fas fa-chevron-down"></i></span>
pt_br: <span href="{{site.baseurl}}/community/">Comunidade<i class="fas fa-chevron-down"></i></span>

source: <a href="{{site.baseurl}}/support/" class="{% if page.url contains '/support/' %}active{% endif %}">SUPPORT</a>
pt_br: <a href="{{site.baseurl}}/support/" class="{% if page.url contains '/support/' %}active{% endif %}">SUPORTE</a>

source: <a href="{{site.baseurl}}/discussion" class="{% if page.url contains '/discussion/' %}active{% endif %}">DISCUSSION</a>
pt_br: <a href="{{site.baseurl}}/discussion" class="{% if page.url contains '/discussion/' %}active{% endif %}">DISCUSSÃO</a>

source: <a href="{{site.baseurl}}/events" class="{% if page.url contains '/events/' %}active{% endif %}">EVENTS</a>
pt_br: <a href="{{site.baseurl}}/events" class="{% if page.url contains '/events/' %}active{% endif %}">EVENTOS</a>

source: <a href="{{site.baseurl}}/newsletter" class="{% if page.url contains '/newsletter/' %}active{% endif %}">NEWSLETTER</a>
pt_br: <a href="{{site.baseurl}}/newsletter" class="{% if page.url contains '/newsletter/' %}active{% endif %}">BOLETIM INFORMATIVO</a>

source: <a href="https://code.quarkus.io" class="button-cta secondary white">START CODING</a>
pt_br: <a href="https://code.quarkus.io" class="button-cta secondary white">COMECE A CODIFICAR</a>
