Repository: quarkusio/pt.quarkus.io
Catalog: l10n/po/*/_includes/homepage-features-icon-band.html.po
Languages: es, pt_br

source: Quarkus Features
es: Características de Quarkus
pt_br: Recursos do Quarkus

source: <a href="/container-first">Container First</a>
es: <a href="/container-first">Contenedor primero</a>
pt_br: <a href="/container-first">Contêiner em primeiro lugar</a>

source: Quarkus tailors your application for GraalVM and HotSpot. Amazingly fast boot time, incredibly low RSS memory (not just heap size!) offering near instant scale up and high density memory utilization in container orchestration platforms like Kubernetes. We use a technique we call compile time boot.
es: Quarkus adapta su aplicación para GraalVM y HotSpot. Un tiempo de arranque increíblemente rápido, una memoria RSS increíblemente baja (¡no solo el tamaño de la heap!) que ofrece un escalado casi instantáneo y una utilización de la memoria de alta densidad en plataformas de orquestación de contenedores como Kubernetes. Utilizamos una técnica que llamamos arranque en tiempo de compilación.
pt_br: O Quarkus adapta seu aplicativo para GraalVM e HotSpot. Tempo de inicialização incrivelmente rápido, memória RSS incrivelmente baixa (não apenas tamanho de heap!) oferecendo aumento de escala quase instantâneo e utilização de memória de alta densidade em plataformas de orquestração de contêineres como o Kubernetes. Usamos uma técnica que chamamos de inicialização de tempo de compilação.

source: <a href="/continuum">Unifies imperative and reactive</a>
es: <a href="/continuum">Unifica lo imperativo y lo reactivo</a>
pt_br: <a href="/continuum">Unifica imperativo e reativo</a>

source: Combine both the familiar imperative code and the reactive style when developing applications.
es: Combine tanto el código imperativo conocido como el estilo reactivo al desarrollar aplicaciones.
pt_br: Combine o código imperativo que você já conhece e o estilo reativo ao desenvolver aplicações.

source: <a href="/standards">Community and Standards</a>
es: <a href="/standards">Comunidad y normas</a>
pt_br: <a href="/standards">Comunidade e Padrões</a>

source: Quarkus provides a cohesive, fun to use, full-stack framework by leveraging a growing list of over fifty best-of-breed libraries that you love and use. All wired on a standard backbone.
es: Quarkus proporciona un marco de trabajo cohesivo y divertido de usar, aprovechando una lista creciente de más de cincuenta librerías de primera línea que usted ama y usa. Todo conectado en una columna vertebral estándar.
pt_br: O Quarkus fornece uma estrutura full-stack coesa e divertida de usar, aproveitando uma lista crescente de mais de cinquenta bibliotecas de primeira linha que você adora e usa. Tudo conectado a um backbone padrão.

source: <a href="/kubernetes-native">Kube-Native</a>
pt_br: <a href="/kubernetes-native">Kube-Nativo</a>

source: The combination of Quarkus and Kubernetes provides an ideal environment for creating scalable, fast, and lightweight applications. Quarkus significantly increases developer productivity with tooling, pre-built integrations, application services, and more.
es: La combinación de Quarkus y Kubernetes proporciona un entorno ideal para crear aplicaciones escalables, rápidas y ligeras. Quarkus aumenta significativamente la productividad de los desarrolladores con herramientas, integraciones preconstruidas, servicios de aplicaciones y mucho más.
pt_br: A combinação de Quarkus e Kubernetes fornece um ambiente ideal para criar aplicativos escaláveis, rápidos e leves. O Quarkus aumenta significativamente a produtividade do desenvolvedor com ferramentas, integrações pré-criadas, serviços de aplicativos e muito mais.

source: <a href="/developer-joy">Developer Joy</a>
es: <a href="/developer-joy">Alegría del desarrollador</a>
pt_br: <a href="/developer-joy">Alegria do desenvolvedor</a>

source: A cohesive platform for optimized developer joy with unified configuration and no hassle native executable generation. Zero config, live reload in the blink of an eye and streamlined code for the 80% common usages, flexible for the remainder 20%.
es: Una plataforma cohesiva para la alegría optimizada de los desarrolladores con una configuración unificada y una generación de ejecutables nativos sin complicaciones. Cero configuración, recarga en vivo en un abrir y cerrar de ojos y código racionalizado para el 80% de los usos comunes, flexible para el 20% restante.
pt_br: Uma plataforma coesa para otimizar a alegria do desenvolvedor com configuração unificada e geração de executável nativo sem complicações. Configuração zero, recarregamento ao vivo num piscar de olhos e código simplificado para 80% das utilizações comuns, flexível para os restantes 20%.
