Repository: quarkusio/pt.quarkus.io
Catalog: l10n/po/*/_includes/homepage-features-band.html.po
Languages: es, pt_br

source: Kube-Native
pt_br: Kube-Nativo

source: Quarkus tailors your application for GraalVM and HotSpot. Amazingly fast boot time, incredibly low RSS memory (not just heap size!) offering near instant scale up and high density memory utilization in container orchestration platforms like Kubernetes. We use a technique we call compile time boot.
es: Quarkus adapta su aplicación para GraalVM y HotSpot. Un tiempo de arranque increíblemente rápido, una memoria RSS increíblemente baja (¡no solo el tamaño de la pila!) que ofrece un escalado casi instantáneo y una utilización de la memoria de alta densidad en plataformas de orquestación de contenedores como Kubernetes. Utilizamos una técnica que llamamos arranque en tiempo de compilación.
pt_br: O Quarkus adapta seu aplicativo para GraalVM e HotSpot. Tempo de inicialização incrivelmente rápido, memória RSS incrivelmente baixa (não apenas tamanho de heap!) oferecendo aumento de escala quase instantâneo e utilização de memória de alta densidade em plataformas de orquestração de contêineres como o Kubernetes. Usamos uma técnica que chamamos de inicialização de tempo de compilação.

source: <a href="/container-first">Learn more</a>>
es: <a href="/container-first">Más información</a>>
pt_br: <a href="/container-first">Saiba mais</a>>

source: Unifies imperative and reactive
es: Unifica lo imperativo y lo reactivo
pt_br: Unifica imperativo e reativo

source: Combine both the familiar imperative code and the reactive style when developing applications.
es: Combine tanto el código imperativo conocido como el estilo reactivo al desarrollar aplicaciones.
pt_br: Combine o código imperativo que você já conhece e o estilo reativo ao desenvolver aplicações.

source: <a href="/continuum">Learn more</a>>
es: <a href="/continuum">Aprender más</a>>
pt_br: <a href="/continuum">Saiba mais</a>>

source: Community and Standards
es: Comunidad y normas
pt_br: Comunidade e Padrões

source: Quarkus provides a cohesive, fun to use, full-stack framework by leveraging a growing list of over fifty best-of-breed libraries that you love and use. All wired on a standard backbone.
es: Quarkus proporciona un marco de trabajo cohesivo y divertido de usar, aprovechando una lista creciente de más de cincuenta librerías de primera línea que usted ama y usa. Todo conectado en una columna vertebral estándar.
pt_br: O Quarkus fornece uma estrutura coesa, divertida de usar e full-stack, aproveitando uma lista crescente de mais de cinquenta bibliotecas de primeira linha que você ama e usa. Tudo conectado em um backbone padrão.

source: <a href="/standards">Learn more</a>>
es: <a href="/standards">Más información</a>>
pt_br: <a href="/standards">Saiba mais</a>>

source: Developer Joy
es: Satisfacción del desarrollador
pt_br: Alegria do desenvolvedor

source: A cohesive platform for optimized developer joy:
es: Una plataforma cohesionada para el disfrute optimizado de los desarrolladores:
pt_br: Uma plataforma coesa para a alegria otimizada do desenvolvedor:

source: Unified configuration
es: Configuración unificada
pt_br: Configuração unificada

source: Zero config, live reload in the blink of an eye
es: Sin configuración, recarga en vivo en un abrir y cerrar de ojos
pt_br: Configuração zero, recarga ao vivo em um piscar de olhos

source: Streamlined code for the 80% common usages, flexible for the 20%
es: Código simplificado para el 80% de los usos comunes, flexible para el 20%
pt_br: Código simplificado para 80% das utilizações comuns, flexível para 20%

source: No hassle native executable generation
es: Generación de ejecutables nativos sin complicaciones
pt_br: Sem complicações na geração de executáveis nativos

source: <a href="/developer-joy">Learn more</a>>
es: <a href="/developer-joy">Aprenda más</a>>
pt_br: <a href="/developer-joy">Saiba mais</a>>
