Repository: quarkusio/pt.quarkus.io
Catalog: l10n/po/*/_includes/kubernetes-native.html.po
Languages: es, pt_br

source: The combination of Quarkus and Kubernetes provides an ideal environment for creating scalable, fast, and lightweight applications. Quarkus significantly increases developer productivity with tooling, pre-built integrations, application services, and more.
es: La combinación de Quarkus y Kubernetes proporciona un entorno ideal para crear aplicaciones escalables, rápidas y ligeras. Quarkus aumenta significativamente la productividad de los desarrolladores con herramientas, integraciones preconstruidas, servicios de aplicaciones y mucho más.
pt_br: A combinação de Quarkus e Kubernetes fornece um ambiente ideal para criar aplicações escaláveis, rápidas e leves. O Quarkus aumenta significativamente a produtividade do desenvolvedor com ferramentas, integrações pré-criadas, serviços de aplicações e muito mais.

source: What does it mean to be a Kubernetes-native framework?
es: ¿Qué significa ser un marco nativo de Kubernetes?
pt_br: O que significa ser uma estrutura nativa do Kubernetes?

source: Single-step Deployments
es: Despliegues de un solo paso
pt_br: Implantações de etapa única

source: Quarkus makes it easy to deploy microservice applications to Kubernetes without having to understand the intricacies of the underlying Kubernetes framework. Extensions are available for Kubernetes, and Kubernetes distributions, to facilitate this process with only a minimal amount of configuration variables needed.
es: Quarkus facilita el despliegue de aplicaciones de microservicios en Kubernetes sin tener que entender las complejidades del marco subyacente de Kubernetes. Hay extensiones disponibles para Kubernetes, y distribuciones de Kubernetes, para facilitar este proceso con solo una cantidad mínima de variables de configuración necesarias.
pt_br: O Quarkus facilita a implantação de aplicações de microsserviço no Kubernetes sem precisar entender as complexidades da estrutura subjacente do Kubernetes. Extensões estão disponíveis para Kubernetes e distribuições Kubernetes, para facilitar esse processo com apenas uma quantidade mínima de variáveis de configuração necessárias.

source: Using the Quarkus Kubernetes extension, developers can perform or automate a single-step deployment using Jib, Docker, and Source-to-Image (S2i) including the creation of DeploymentConfig to trigger automatic redeployments. <a href="{{site.baseurl}}/guides/deploying-to-kubernetes">Read the guide for more details.</a>
es: Utilizando la extensión Kubernetes de Quarkus, los desarrolladores pueden realizar o automatizar un despliegue de un solo paso utilizando Jib, Docker y Source-to-Image (S2i), incluyendo la creación de DeploymentConfig para desencadenar redespliegues automáticos. <a href="{{site.baseurl}}/guides/deploying-to-kubernetes">Lee la guía para más detalles.</a>
pt_br: Usando a extensão Quarkus Kubernetes, os desenvolvedores podem executar ou automatizar uma implantação de etapa única usando Jib, Docker e Source-to-Image (S2i), incluindo a criação de DeploymentConfig para disparar reimplantações automáticas. <a href="{{site.baseurl}}/guides/deploying-to-kubernetes">Leia o guia para obter mais detalhes.</a>

source: Additionally, Quarkus includes extensions that make it easy to deploy serverless microservices to cloud providers including AWS Lambda, Azure Functions, and Google Cloud Functions as well as Knative to take advantage of Quarkus application’s fast startup times. <a href="{{site.baseurl}}/guides/deploying-to-kubernetes">Read the guide for more details.</a>
es: Además, Quarkus incluye extensiones que facilitan el despliegue de microservicios sin servidor en proveedores de la nube, como AWS Lambda, Azure Functions y Google Cloud Functions, así como Knative, para aprovechar los rápidos tiempos de inicio de las aplicaciones de Quarkus. <a href="{{site.baseurl}}/guides/deploying-to-kubernetes">Lee la guía para más detalles.</a>
pt_br: Além disso, o Quarkus inclui extensões que facilitam a implantação de microsserviços sem servidor em provedores de nuvem, incluindo AWS Lambda, Azure Functions e Google Cloud Functions, bem como o Knative para aproveitar os tempos de inicialização rápidos do aplicativo Quarkus. <a href="{{site.baseurl}}/guides/deploying-to-kubernetes">Leia o guia para obter mais detalhes.</a>

source: Tracing & Debugging
es: Seguimiento y depuración
pt_br: Rastreamento & Depuração

source: Quarkus provides developers the tools and capabilities to troubleshoot distributed microservices applications in Kubernetes including tracing and debugging.
es: Quarkus proporciona a los desarrolladores las herramientas y capacidades para solucionar los problemas de las aplicaciones de microservicios distribuidos en Kubernetes, incluyendo el rastreo y la depuración.
pt_br: O Quarkus fornece aos desenvolvedores as ferramentas e os recursos para solucionar problemas de aplicações de microsserviços distribuídos no Kubernetes, incluindo rastreamento e depuração.

source: Quarkus utilizes <a href="https://opentracing.io/" target="_blank">OpenTracing</a> which is a vendor-agnostic API to help developers easily instrument tracing into their codebase. Distributed tracing helps pinpoint where failures occur and what causes poor performance. <a href="{{site.baseurl}}/guides/opentracing">Read the guide for more details.</a>
es: Quarkus utiliza <a href="https://opentracing.io/" target="_blank">OpenTracing</a>que es una API independiente del proveedor para ayudar a los desarrolladores a instrumentar fácilmente el rastreo en su código base. El rastreo distribuido ayuda a identificar dónde se producen los fallos y qué causa el bajo rendimiento. <a href="{{site.baseurl}}/guides/opentracing">Lea la guía para más detalles.</a>
pt_br: O Quarkus utiliza o <a href="https://opentracing.io/" target="_blank">OpenTracing</a> , que é uma API independente de fornecedor para ajudar os desenvolvedores a instrumentar facilmente o rastreamento em sua base de código. O rastreamento distribuído ajuda a identificar onde ocorrem falhas e o que causa o baixo desempenho. <a href="{{site.baseurl}}/guides/opentracing">Leia o guia para obter mais detalhes.</a>

source: Application Health & Metrics
es: Salud y métricas de la aplicación
pt_br: Métricas de integridade do aplicativo

source: Quarkus leverages SmallRye Health, an implementation of the MicroProfile Health specification. This allows applications to provide information about their state to external viewers in a Kubernetes environment where automated processes must be able to determine whether the application should be discarded or restarted. <a href="{{site.baseurl}}/guides/microprofile-health">Read the guide for more details.</a>
es: Quarkus aprovecha SmallRye Health, una implementación de la especificación MicroProfile Health. Esto permite que las aplicaciones proporcionen información sobre su estado a espectadores externos en un entorno Kubernetes en el que los procesos automatizados deben ser capaces de determinar si la aplicación debe ser descartada o reiniciada. <a href="{{site.baseurl}}/guides/microprofile-health">Lea la guía para obtener más detalles.</a>
pt_br: O Quarkus aproveita o SmallRye Health, uma implementação da especificação MicroProfile Health. Isso permite que as aplicações forneçam informações sobre seu estado para visualizadores externos em um ambiente Kubernetes onde os processos automatizados devem ser capazes de determinar se o aplicativo deve ser descartado ou reiniciado. <a href="{{site.baseurl}}/guides/microprofile-health">Leia o guia para obter mais detalhes.</a>

source: Quarkus utilizes the <a href="https://micrometer.io/" target="_blank">Micrometer</a> metrics library for runtime and application metrics. It provides a simple facade for the most popular monitoring systems to instrument your JVM-based application code without vendor lock-in. Application-specific and built-in metrics can be exposed using Micrometer. <a href="{{site.baseurl}}/guides/micrometer#support-for-the-microprofile-metrics-api">Read the guide for more details.</a>
es: Quarkus utiliza la biblioteca de métricas <a href="https://micrometer.io/" target="_blank">Micrometer</a> para las métricas de tiempo de ejecución y de aplicación. Proporciona una fachada simple para los sistemas de monitoreo más populares para instrumentar su código de aplicación basado en JVM sin bloqueo de proveedor. Las métricas específicas de la aplicación y las incorporadas pueden ser expuestas usando Micrometer. <a href="{{site.baseurl}}/guides/micrometer#support-for-the-microprofile-metrics-api">Lea la guía para más detalles.</a>
pt_br: O Quarkus utiliza a biblioteca de métricas <a href="https://micrometer.io/" target="_blank">Micrometer</a> para métricas de tempo de execução e de aplicativos. Ele fornece uma fachada simples para os sistemas de monitoramento mais populares para instrumentar seu código de aplicativo baseado em JVM sem ficar preso a um fornecedor específico. Métricas internas e específicas do aplicativo podem ser expostas usando o Micrometer. <a href="{{site.baseurl}}/guides/micrometer#support-for-the-microprofile-metrics-api">Leia o guia para obter mais detalhes.</a>

source: Application Configuration
es: Configuración de la aplicación
pt_br: Configuração da aplicação

source: Quarkus includes an extension that allows developers to use Kubernetes ConfigMaps and Secrets as a configuration source, without having to mount them into the Pod running the Quarkus application or make any other modifications to their Kubernetes Deployment (or Openshift DeploymentConfig) <a href="{{site.baseurl}}/guides/kubernetes-config">Read the guide for more details.</a>
es: Quarkus incluye una extensión que permite a los desarrolladores utilizar Kubernetes ConfigMaps y Secrets como fuente de configuración, sin tener que montarlos en el Pod que ejecuta la aplicación Quarkus ni realizar ninguna otra modificación en su Kubernetes Deployment (o Openshift DeploymentConfig) <a href="{{site.baseurl}}/guides/kubernetes-config">Lee la guía para más detalles.</a>
pt_br: O Quarkus inclui uma extensão que permite aos desenvolvedores usar o Kubernetes ConfigMaps e Secrets como uma fonte de configuração, sem ter que montá-los no Pod executando a aplicação Quarkus ou fazer quaisquer outras modificações em sua implantação do Kubernetes (ou Openshift DeploymentConfig) <a href="{{site.baseurl}}/guides/kubernetes-config">Leia o guia para obter mais detalhes.</a>

source: Remote Development
es: Desarrollo a distancia
pt_br: Desenvolvimento remoto

source: Create and debug applications in the same environment where applications run. Live coding in development mode where any changes made locally will be immediately visible in a clustered Kubernetes environment. <a href="https://developers.redhat.com/blog/2021/02/11/enhancing-the-development-loop-with-quarkus-remote-development">Read this blog post for greater insight.</a>
es: Cree y depure aplicaciones en el mismo entorno donde se ejecutan las aplicaciones. Codificación en vivo en el modo de desarrollo, donde cualquier cambio realizado localmente será inmediatamente visible en un entorno de Kubernetes en clúster. <a href="https://developers.redhat.com/blog/2021/02/11/enhancing-the-development-loop-with-quarkus-remote-development">Lea esta entrada del blog para obtener más información.</a>
pt_br: Crie e depure aplicativos no mesmo ambiente em que as aplicações são executadas. Codificação ao vivo no modo de desenvolvimento, onde quaisquer alterações feitas localmente serão imediatamente visíveis em um ambiente Kubernetes em cluster. <a href="https://developers.redhat.com/blog/2021/02/11/enhancing-the-development-loop-with-quarkus-remote-development">Leia esta postagem do blog para obter mais informações.</a>
