Repository: quarkusio/pt.quarkus.io
Catalog: l10n/po/*/_includes/worldtour-abstracts.html.po
Languages: pt_br

source: These materials are for JUGs who have tour dates booked and want access to promotional materials to use to create excitement and drum up attendance. We've written a couple versions of the session abstracts so you could find one that fits your JUGs personality, or go for it and create your own! We've also created some <a href="{{site.baseurl}}/worldtour/graphics">graphic resources</a> for social promotions a well.
pt_br: Esses materiais são para JUGs que têm datas de turnê reservadas e querem acesso a materiais promocionais para usar para criar emoção e aumentar a participação. Nós escrevemos algumas versões dos resumos da sessão para que você possa encontrar um que se encaixe na sua personalidade JUGs, ou vá em frente e crie o seu próprio! Também criamos alguns <a href="{{site.baseurl}}/worldtour/graphics">recursos gráficos</a> para promoções sociais.

source: Session Abstracts
pt_br: Resumos das Sessões

source: Abstract A - All Rock'n Roll and Big Drum Solos
pt_br: Resumo A - Todos os solos de Rock'n Roll e Big Drum

source: In the spirit of the times, the Quarkus Team virtually presents a big, loud, and bold, rock & roll mega-stadium tour.
pt_br: No espírito dos tempos, o Quarkus Team apresenta virtualmente uma grande, barulhenta e ousada turnê de mega-estádio de rock and roll.

source: For the last 25 years, Java has performed for organizations across the world but you've never seen anything like this. We'll cover all the classics like "Start Me Up" and "Living' on a VM" and some new jams like "Stairway to Native" and "Sweet JPA of Mine" and more.
pt_br: Nos últimos 25 anos, o Java tem atuado para organizações em todo o mundo, mas você nunca viu nada assim. Vamos cobrir todos os clássicos como "Start Me Up" e "Living' on a VM" e algumas novas jams como "Stairway to Native" e "Sweet JPA of Mine" e muito mais.

source: In this session the Quarkus Team will give you a unique, hands-on experience: An introduction to Quarkus, a follow-along hands-on demo or two and then a Q&A with some of the band, umm, developers involved.
pt_br: Nesta sessão, a Equipe do Quarkus lhe dará uma experiência prática única: uma introdução ao Quarkus, uma demonstração prática subsequente ou duas e, em seguida, uma sessão de perguntas e respostas com alguns dos desenvolvedores envolvidos.

source: So join us as we explore how Quarkus helps Java developers everywhere to be more productive, create modern masterpieces and, well, have more fun: 90 odd minutes of technical discussion, some live coding and a Q&A - it’s going to be a blast.
pt_br: Então junte-se a nós enquanto exploramos como o Quarkus ajuda desenvolvedores Java em todos os lugares a serem mais produtivos, criar obras-primas modernas e, bem, se divertir mais: 90 minutos ímpares de discussão técnica, alguma codificação ao vivo e uma sessão de perguntas e respostas - vai ser uma explosão.

source: Abstract B - More Easy Listening
pt_br: Resumo B - Audição Mais Fácil

source: Welcome to the Quarkus World Tour.
pt_br: Bem-vindo ao Quarkus World Tour.

source: A unique experience with access to Quarkus experts designed to help you get started with Java in a Kubernetes world.
pt_br: Uma experiência única com acesso a especialistas em Quarkus projetados para ajudá-lo a começar a usar Java em um mundo Kubernetes.

source: Quarkus is the rising star for Kube Native Java as it re-imagines the Java stack to give you the performance characteristics and developer experience you need to create modern, high performing applications. Quarkus helps you use your existing skills and code in new ways and greatly reduces the technical burden when moving to a Kubernetes-centric environment.
pt_br: O Quarkus é a estrela em ascensão do Kube Native Java, pois reimagina a stack Java para fornecer as características de desempenho e a experiência de desenvolvedor necessárias para criar aplicativos modernos e de alto desempenho. O Quarkus ajuda você a usar suas habilidades e código existentes de novas maneiras e reduz consideravelmente a carga técnica ao migrar para um ambiente centrado no Kubernetes.

source: Join us as we explore how Quarkus helps Java developers everywhere to be more productive, create modern masterpieces and, have a little bit more fun.
pt_br: Junte-se a nós enquanto exploramos como o Quarkus ajuda desenvolvedores Java em todos os lugares a serem mais produtivos, criarem obras-primas modernas e se divertirem um pouco mais.

source: It’s going to be a blast. 90 odd minutes of technical discussion, some live coding and a Q&A.
pt_br: Vai ser uma explosão. 90 minutos ímpares de discussão técnica, alguns códigos ao vivo e um Q&A.
