Repository: quarkusio/pt.quarkus.io
Catalog: l10n/po/*/_guides/_includes/prerequisites.adoc.po
Languages: pt

source: To complete this guide, you need:
pt: Para concluir este guia, você precisa:

source: Roughly {prerequisites-time}
pt: Mais ou menos {prerequisites-time}

source: Roughly 15 minutes
pt: Cerca de 15 minutos

source: An IDE
pt: Um IDE

source: JDK 11+ installed with `JAVA_HOME` configured appropriately
pt: JDK 11+ instalado com 'JAVA_HOME' configurado adequadamente

source: A working container runtime (Docker or xref:podman.adoc[Podman])
pt: Um container runtime instalado (Docker ou xref:podman.adoc[Podman])

source: Docker and Docker Compose or xref:podman.adoc[Podman], and Docker Compose
pt: Docker e Docker Compose ou xref:podman.adoc[Podman] e Docker Compose

source: Optionally the xref:cli-tooling.adoc[Quarkus CLI] if you want to use it
pt: Opcionalmente, o xref:cli-tooling.adoc[Quarkus CLI] se você quiser usá-lo

source: Optionally Mandrel or GraalVM installed and xref:building-native-image.adoc#configuring-graalvm[configured appropriately] if you want to build a native executable (or Docker if you use a native container build)
pt: Opcionalmente, Mandrel ou GraalVM instalado e xref:building-native-image.adoc#configuring-graalvm[configurado apropriadamente] se você quiser criar um executável nativo (ou Docker se você usar uma compilação de contêiner nativo)

source: Mandrel or GraalVM installed and xref:building-native-image.adoc#configuring-graalvm[configured appropriately]
pt: Mandrel ou GraalVM instalado e xref:building-native-image.adoc#configuring-graalvm[configurado adequadamente]
