Repository: quarkusio/pt.quarkus.io
Catalog: l10n/po/*/_versions/3.8/guides/funqy-aws-lambda-http.adoc.po
Languages: pt_br

source: Funqy HTTP Binding with AWS Lambda
pt_br: Vinculação HTTP do Funqy com o AWS Lambda

source: If you want to allow HTTP clients to invoke on your Funqy functions on AWS Lambda, Quarkus allows you to expose multiple Funqy functions through HTTP deployed as one AWS Lambda. This approach does add overhead over the regular Funqy AWS Lambda integration and also requires you to use AWS API Gateway.
pt_br: Se você deseja permitir que clientes HTTP invoquem suas funções Funqy no AWS Lambda, o Quarkus permite expor várias funções Funqy por meio de HTTP implantado como um AWS Lambda. Este método adiciona uma sobrecarga em relação à integração regular do Funqy com o AWS Lambda e também requer o uso do AWS API Gateway.

source: Follow the xref:aws-lambda-http.adoc[AWS Lambda Http Guide]. It walks through using a variety of HTTP frameworks on AWS Lambda, including Funqy.
pt_br: Siga o xref:aws-lambda-http.adoc[Guia de Http do AWS Lambda] . Ele orienta o uso de uma variedade de estruturas HTTP no AWS Lambda, incluindo o Funqy.

source: The Funqy HTTP + AWS Lambda binding is not a replacement for REST over HTTP. Because Funqy needs to be portable across a lot of different protocols and function providers its HTTP binding is very minimalistic and you will lose REST features like linking and the ability to leverage HTTP features like cache-control and conditional GETs. You may want to consider using Quarkus's Jakarta REST, Spring MVC, or Vert.x Web Reactive Route xref:aws-lambda-http.adoc[support] instead. They also work with Quarkus and AWS Lambda.
pt_br: A associação Funqy HTTP + AWS Lambda não substitui o REST sobre HTTP. Como o Funqy precisa ser portátil em vários protocolos e provedores de funções diferentes, sua associação HTTP é muito minimalista e você perderá os recursos REST, como vinculação, e a capacidade de aproveitar os recursos HTTP, como controle de cache e GETs condicionais. Talvez queira considerar o uso do xref:aws-lambda-http.adoc[suporte a] Jakarta REST, Spring MVC ou Vert.x Web Reactive Route do Quarkus. Eles também funcionam com o Quarkus e o AWS Lambda.

source: An additional Quickstart
pt_br: Um Quickstart adicional

source: Beyond generating an AWS project that is covered in the xref:aws-lambda-http.adoc[AWS Lambda Http Guide], there's also a quickstart for running Funqy HTTP on AWS Lambda.
pt_br: Além de gerar um projeto AWS que é abordado no xref:aws-lambda-http.adoc[Guia do AWS Lambda Http] , há também um início rápido para executar o Funqy HTTP no AWS Lambda.

source: Clone the Git repository: `git clone {quickstarts-clone-url}`, or download an {quickstarts-archive-url}[archive].
pt_br: Clone o repositório Git: `git clone {quickstarts-clone-url}`, ou baixe um {quickstarts-archive-url}[arquivo].

source: The solution is located in the `funqy-amazon-lambda-quickstart` link:{quickstarts-tree-url}/funqy-quickstarts/funqy-amazon-lambda-http-quickstart[directory].
pt_br: A solução está localizada no diretório `funqy-amazon-lambda-quickstart` link:{quickstarts-tree-url}/funqy-quickstarts/funqy-amazon-lambda-http-quickstart[diretório].

source: The Code
pt_br: O Código

source: There is nothing special about the code and more importantly nothing AWS specific. Funqy functions can be deployed to many environments and AWS Lambda is one of them. The Java code is actually the same exact code as the link:{quickstarts-tree-url}/funqy-quickstarts/funqy-http-quickstart[funqy-http-quickstart].
pt_br: Não há nada de especial no código e, mais importante, nada específico do AWS. As funções Funqy podem ser implementadas em muitos ambientes e o AWS Lambda é um deles. O código Java é, na verdade, exatamente o mesmo código que o link:{quickstarts-tree-url}/funqy-quickstarts/funqy-http-quickstart[funqy-http-quickstart] .

source: Getting Started
pt_br: Primeiros passos

source: The steps to get this quickstart running are exactly the same as defined in the xref:aws-lambda-http.adoc[AWS Lambda HTTP Guide]. These differences are that you are running from a quickstart and the maven dependencies are slightly different.
pt_br: As etapas para colocar esse início rápido em execução são exatamente as mesmas definidas no xref:aws-lambda-http.adoc[Guia HTTP do AWS Lambda] . As diferenças são que você está executando a partir de um início rápido e as dependências do maven são ligeiramente diferentes.
