Repository: quarkusio/pt.quarkus.io
Catalog: l10n/po/*/_posts/2021-09-15-adoptium-customer-story.adoc.po
Languages: es

source: Java is used by millions of developers worldwide and is the second most popular language, and they all need a Java runtime. Adoptium, the most popular Java distribution, needed to offer a way for developers to programmatically discover and access pre-built Java binaries across many different variants, and produced an end-user API with Quarkus to improve performance and developer productivity.
es: Java es utilizado por millones de desarrolladores en todo el mundo y es el segundo lenguaje más popular, y todos ellos necesitan un tiempo de ejecución de Java. Adoptium, la distribución de Java más popular, necesitaba ofrecer una forma de que los desarrolladores descubrieran y accedieran mediante programación a los binarios de Java preconstruidos en muchas variantes diferentes, y produjo una API de usuario final con Quarkus para mejorar el rendimiento y la productividad de los desarrolladores.

source: user-story
es: historia de usuario

source: Eclipse Adoptium Uses Quarkus for high volume Java SE distribution API
es: Eclipse Adoptium utiliza Quarkus para una API de distribución de Java SE de gran volumen

source: Adoptium logo
es: Logotipo de Adoptium

source: Java is used by https://www.daxx.com/blog/development-trends/number-software-developers-world[millions^] of developers worldwide and according to Redmonk, https://redmonk.com/sogrady/2021/08/05/language-rankings-6-21/[recently moved^] back to the #2 most used programming language. There are many distributions of the Java runtime and development kit, but the Eclipse Temurin (formerly known as AdoptOpenJDK) distribution has proven to be the https://snyk.io/jvm-ecosystem-report-2021/[most popular^]. Recently, the AdoptOpenJDK project was moved into the Eclipse Foundation as https://adoptium.net/[Eclipse Adoptium^]. The goal of Adoptium is to promote and support high-quality, TCK certified runtimes and associated technology for use across the Java ecosystem. It does this by performing regular builds, tests, certifications, and of course serving binaries to those millions of developers that need to evaluate, prototype, and run production workloads with Java. Like other open source Eclipse projects, the team behind the distribution API are mostly volunteers, so they are constantly looking for optimizations of their time and resources and technology used to deliver on their mission.
es: Java es utilizado por https://www.daxx.com/blog/development-trends/number-software-developers-world[millones^] de desarrolladores en todo el mundo y, según Redmonk, https://redmonk.com/sogrady/2021/08/05/language-rankings-6-21/[recientemente^] ha pasado a ser el segundo lenguaje de programación más utilizado. Hay muchas distribuciones del kit de desarrollo y tiempo de ejecución de Java, pero la distribución Eclipse Temurin (antes conocida como AdoptOpenJDK) ha demostrado ser la https://snyk.io/jvm-ecosystem-report-2021/[más popular^]. Recientemente, el proyecto AdoptOpenJDK se trasladó a la Fundación Eclipse como https://adoptium.net/[Eclipse Adoptium^]. El objetivo de Adoptium es promover y apoyar tiempos de ejecución de alta calidad con certificación TCK y la tecnología asociada para su uso en todo el ecosistema Java. Para ello, realiza compilaciones periódicas, pruebas, certificaciones y, por supuesto, suministra binarios a los millones de desarrolladores que necesitan evaluar, crear prototipos y ejecutar cargas de trabajo de producción con Java. Al igual que otros proyectos de código abierto de Eclipse, el equipo que está detrás de la API de distribución es mayoritariamente voluntario, por lo que busca constantemente optimizar su tiempo y recursos y la tecnología utilizada para cumplir su misión.

source: The Challenge
es: El desafío

source: While developers can download distributions directly from the https://adoptium.net/[Adoptium website^] with a single click, it becomes more of a challenge to automate this process, for example in a CI/CD pipeline. This is especially true due to the number of variants of Java versions, release types, operating systems, architectures, JVM implementations, etc. To that end, Adoptium needed to offer a way to programmatically discover and access pre-built binaries based on these variables, and produced https://api.adoptium.net/q/swagger-ui/[an end-user API^].
es: Mientras que los desarrolladores pueden descargar las distribuciones directamente desde el https://adoptium.net/[sitio web de Adoptium^] con un solo clic, resulta más complicado automatizar este proceso, por ejemplo, en una canalización CI/CD. Esto es especialmente cierto debido a la cantidad de variantes de versiones de Java, tipos de distribución, sistemas operativos, arquitecturas, implementaciones de JVM, etc. Para ello, Adoptium necesitaba ofrecer una forma de descubrir y acceder mediante programación a los binarios preconstruidos en función de estas variables, y produjo https://api.adoptium.net/q/swagger-ui/[una API para el usuario final^].

source: The sheer volume of AdoptOpenJDK downloads, https://dash.adoptopenjdk.net/trends[about 500,000 per day^], meant that performance would become a key consideration for the API. In addition, Adoptium does not have a traditional datacenter, so all of this runs in the cloud on Microsoft Azure, where costs can increase when you have continuously running workloads that take up unnecessary space.
es: El gran volumen de descargas de AdoptOpenJDK, https://dash.adoptopenjdk.net/trends[unas 500.000 al día^], significaba que el rendimiento se convertiría en una consideración clave para la API. Además, Adoptium no tiene un centro de datos tradicional, por lo que todo esto se ejecuta en la nube en Microsoft Azure, donde los costes pueden aumentar cuando se tienen cargas de trabajo en ejecución continua que ocupan un espacio innecesario.

source: Download trends
es: Descarga de tendencias

source: Recent download statistics for Adoptium distributions, from https://dash.adoptopenjdk.net/trends[dash.adoptopenjdk.net]
es: Estadísticas de descargas recientes de las distribuciones de Adoptium, de https://dash.adoptopenjdk.net/trends[dash.adoptopenjdk.net]

source: In 2017, the technical team’s first attempt at exposing an API was using Node.js + Express. As the request volume and number of distribution variants rose, the team found that the response times were getting slower, not only due to the volume, but also due to architectural choices made early on. In particular, the application’s monolithic architecture, where the frontend and backend were in the same app, would cause apparent slowness in the frontend, while the backend processed concurrent requests. In addition, lack of pagination in the API meant that requests could return huge results, even when only the first few elements of the result were needed.
es: En 2017, el primer intento del equipo técnico de exponer una API fue utilizando Node.js + Express. A medida que el volumen de solicitudes y el número de variantes de distribución aumentaban, el equipo descubrió que los tiempos de respuesta eran cada vez más lentos, no solo por el volumen, sino también por las decisiones arquitectónicas tomadas al principio. En particular, la arquitectura monolítica de la aplicación, en la que el frontend y el backend se encontraban en la misma aplicación, provocaba una aparente lentitud en el frontend, mientras el backend procesaba peticiones concurrentes. Además, la falta de paginación en la API significaba que las solicitudes podían devolver resultados enormes, incluso cuando sólo se necesitaban los primeros elementos del resultado.

source: The lead developer on the Technical Steering Committee responsible for the upkeep of the API explains:
es: El desarrollador principal del Comité Directivo Técnico responsable del mantenimiento de la API explica:

source: The existing API had design flaws that wouldn’t have been easy to fix, so we were considering replacing it with a new implementation. Our small team had more experience in JVM languages than JavaScript, and since this was an API serving Java data, we thought eating our own dogfood would be a good thing!
es: La API existente tenía fallos de diseño que no habrían sido fáciles de arreglar, así que nos planteamos sustituirla por una nueva implementación. Nuestro pequeño equipo tenía más experiencia en lenguajes JVM que en JavaScript, y como se trataba de una API que servía datos de Java, pensamos que comer nuestra propia comida para perros sería algo bueno!

source: *-Lead Developer on the Adoptium Technical Steering Committee*
es: *-Desarrollador principal del Comité Directivo Técnico de Adoptium*

source: Enter Quarkus
es: Entra Quarkus

source: In July 2019 the team discovered Quarkus through its related work with other frameworks in the Java ecosystem. They were especially interested in Quarkus’ promise of stellar performance and smaller footprint, which is comparable to Node.js and even Golang. Even better, Quarkus’ https://quarkus.io/guides/kotlin[first class support for Kotlin^] meant the team could re-use both their Java and Kotlin experience with Quarkus.
es: En julio de 2019, el equipo descubrió Quarkus a través de su trabajo relacionado con otros frameworks del ecosistema Java. Estaban especialmente interesados en la promesa de Quarkus de un rendimiento estelar y una huella más pequeña, que es comparable a Node.js e incluso a Golang. Incluso mejor, el https://quarkus.io/guides/kotlin[soporte de primera clase de Quarkus para Kotlin^] significaba que el equipo podía reutilizar tanto su experiencia en Java como en Kotlin con Quarkus.

source: We really liked the fact that Quarkus uses JAX-RS, which we were already familiar with. Having out-of-the-box integration with https://quarkus.io/guides/resteasy-reactive[RESTEasy reactive^] was a nice performance bonus, and the https://quarkus.io/guides/openapi-swaggerui[OpenAPI extension^] available in Quarkus made it pretty simple to expose the API as a Swagger API browser with no additional work needed.
es: Nos gustó mucho el hecho de que Quarkus utiliza JAX-RS, con el que ya estábamos familiarizados. Tener una integración inmediata con https://quarkus.io/guides/resteasy-reactive[RESTEasy reactivo^] fue un buen bono de rendimiento, y la https://quarkus.io/guides/openapi-swaggerui[extensión OpenAPI^] disponible en Quarkus hizo que fuera bastante simple exponer la API como un navegador de API Swagger sin necesidad de trabajo adicional.

source: Live Coding with Quarkus also proved extremely useful when developing the application:
es: El Live Coding con Quarkus también resultó muy útil a la hora de desarrollar la aplicación:

source: The live coding fast feedback loop was very useful when developing with Quarkus. Although fast startup was nice, it wasn’t critical since our apps are long-running, but during development, as we tweaked our APIs, being able to immediately re-test saved us a ton of development time.
es: El bucle de retroalimentación rápida de la codificación en vivo fue muy útil al desarrollar con Quarkus. Aunque el inicio rápido era bueno, no era crítico ya que nuestras aplicaciones son de larga duración, pero durante el desarrollo, a medida que ajustábamos nuestras APIs, el poder volver a probar inmediatamente nos ahorró una tonelada de tiempo de desarrollo.

source: The out-of-the-box performance of Quarkus on JVM exceeded their expectations quite easily:
es: El rendimiento inmediato de Quarkus en JVM superó sus expectativas con bastante facilidad:

source: We initially wanted sub-second response times for most of the API, and be able to handle around 10 thousand requests per second. With zero optimizations, our app was responding within 1ms for most APIs, and easily surpassed our throughput requirements. This is way more than we will need for the foreseeable future. The Quarkus app also uses less than half the CPU time [compared to Node.js], despite handling more traffic and providing more functionality.
es: Inicialmente queríamos tiempos de respuesta inferiores a un segundo para la mayor parte de la API y poder gestionar unas 10.000 solicitudes por segundo. Con cero optimizaciones, nuestra aplicación respondía en 1ms para la mayoría de las API, y superaba fácilmente nuestros requisitos de rendimiento. Esto es mucho más de lo que necesitaremos en un futuro previsible". La aplicación Quarkus también utiliza menos de la mitad de tiempo de CPU [en comparación con Node.js], a pesar de manejar más tráfico y proporcionar más funcionalidad.

source: Overall, the move to Quarkus has been a very positive experience, with real benefits in terms of developer productivity and operational efficiency. The team has been using Quarkus in production for the Adoptium API since November 2019 and has proved to be extremely stable.
es: En general, el cambio a Quarkus ha sido una experiencia muy positiva, con beneficios reales en términos de productividad de los desarrolladores y eficiencia operativa. El equipo ha estado utilizando Quarkus en producción para la API de Adoptium desde noviembre de 2019 y ha demostrado ser extremadamente estable.

source: An Active Community
es: Una comunidad activa

source: Communities are a critical aspect to any open source project’s success, including Quarkus. It is no surprise that the health of a community is a major consideration when an adoption decision must be made. For Adoptium, this is made clear by example:
es: Las comunidades son un aspecto crítico para el éxito de cualquier proyecto de código abierto, incluido Quarkus. No es de extrañar que la salud de una comunidad sea una consideración importante cuando hay que tomar una decisión de adopción. En el caso de Adoptium, esto queda claro con el ejemplo:

source: Earlier this year we discovered a memory leak in the RESTEasy Reactive component in Quarkus. Within a few days, working with the Quarkus community, we were able to identify and fix the issue. This gave us the confidence that longer term, we’ll be able to resolve issues quickly.
es: A principios de este año descubrimos una fuga de memoria en el componente RESTEasy Reactive de Quarkus. En pocos días, trabajando con la comunidad de Quarkus, fuimos capaces de identificar y solucionar el problema. Esto nos dio la confianza de que, a largo plazo, seremos capaces de resolver los problemas rápidamente.

source: What’s Next for Adoptium
es: Lo que viene para Adoptium

source: Adoptium has been very happy with their decision to adopt Quarkus, and are looking forward to trying out new capabilities in Quarkus like continuous testing and dev services support for MongoDB (their database of choice).
es: Adoptium está muy contento con su decisión de adoptar Quarkus, y está deseando probar las nuevas capacidades de Quarkus, como las pruebas continuas y el soporte de servicios de desarrollo para MongoDB (su base de datos elegida).

source: Overall, we have been very impressed with the capabilities of Quarkus, and our experience with the Quarkus community has been fantastic. We look forward to seeing how it evolves, and improving how we serve the Java community’s Java distribution needs for years to come!
es: En general, hemos quedado muy impresionados con las capacidades de Quarkus, y nuestra experiencia con la comunidad de Quarkus ha sido fantástica. Estamos deseando ver cómo evoluciona y mejorar la forma en que servimos a las necesidades de distribución de Java de la comunidad en los próximos años!

source: More Information
es: Más información

source: https://api.adoptium.net/q/swagger-ui/[Adoptium API]
es: https://api.adoptium.net/q/swagger-ui/[API de Adoptium]

source: https://adoptium.net/faq.html[Adoptium FAQ]
es: https://adoptium.net/faq.html[Preguntas frecuentes de Adoptium]

source: About Eclipse Adoptium
es: Acerca de Eclipse Adoptium

source: The mission of the Eclipse Adoptium Top-Level Project is to produce high-quality runtimes and associated technology for use within the Java ecosystem. Eclipse Adoptium also provides artifacts including open-source infrastructure as code, a comprehensive continuous integration build and test farm, and extensive quality assurance tests. These artifacts may be used by Eclipse Adoptium projects and other runtime technology builders to ensure the provision of secure, Java SE TCK-tested and compliant, production-ready runtimes.
es: La misión del proyecto de alto nivel Eclipse Adoptium es producir tiempos de ejecución de alta calidad y tecnología asociada para su uso dentro del ecosistema Java. Eclipse Adoptium también proporciona artefactos que incluyen la infraestructura de código abierto como código, una completa granja de construcción y pruebas de integración continua, y extensas pruebas de garantía de calidad. Estos artefactos pueden ser utilizados por los proyectos de Eclipse Adoptium y otros creadores de tecnología de tiempo de ejecución para garantizar la provisión de tiempos de ejecución seguros, probados y compatibles con el TCK de Java y listos para la producción.
