Repository: quarkusio/pt.quarkus.io
Catalog: l10n/po/*/_posts/2023-08-29-quarkus-3-3-1-released.adoc.po
Languages: es_es

source: We released Quarkus 3.3.1, our first maintenance release for our 3.3 release train.
es_es: Lanzamos Quarkus 3.3.1, nuestra primera versión de mantenimiento para nuestro tren de lanzamiento 3.3.

source: release
es_es: lanzamiento

source: Quarkus 3.3.1 released - Maintenance release
es_es: Lanzamiento Quarkus 3.3.1 - Versión de mantenimiento

source: It includes a bunch of bugfixes, together with documentation improvements.
es_es: Incluye una serie de correcciones de errores, junto con mejoras en la documentación.

source: We are aware of a https://github.com/quarkusio/quarkus/issues/35406[startup performance/memory regression introduced in 3.3] and are working hard on fixing it. This issue *is* not solved in 3.3.1 but should be solved in the upcoming 3.3.2 that will be released next week.
es_es: Somos conscientes de una https://github.com/quarkusio/quarkus/issues/35406[regresión de rendimiento en el inicio y de problemas de memoria introducidos en la versión 3.3] y estamos trabajando arduamente en solucionarlos. Este problema *no se resuelve* en la versión 3.3.1, pero debería estar resuelto en la próxima versión 3.3.2 que será lanzada la próxima semana.

source: Update
es_es: Actualización

source: To update to Quarkus 3.3.1, we recommend updating to the latest version of the Quarkus CLI and run:
es_es: Para actualizar a Quarkus 3.3.1, recomendamos actualizar a la última versión de la CLI de Quarkus y ejecutar:

source: To migrate from 3.2, please refer to https://github.com/quarkusio/quarkus/wiki/Migration-Guide-3.3[our migration guide].
es_es: Para migrar desde la versión 3.2, por favor consulta https://github.com/quarkusio/quarkus/wiki/Migration-Guide-3.3[nuestra guía de migración].

source: If you are not already using 3.x, please refer to the https://quarkus.io/blog/quarkus-3-0-final-released/[3.0 announcement] for all the details. You can also refer to https://quarkus.io/blog/quarkus-3-upgrade/[this blog post] for additional details. Once you upgraded to 3.0, also have a look at the https://github.com/quarkusio/quarkus/wiki/Migration-Guide-3.1[3.1] and https://github.com/quarkusio/quarkus/wiki/Migration-Guide-3.2[3.2] migration guides.
es_es: Si aún no estas usando la versión 3.x, por favor consulta https://quarkus.io/blog/quarkus-3-0-final-released/[el anuncio de la versión 3.0] para todos los detalles. También puedes consultar https://quarkus.io/blog/quarkus-3-upgrade/[este post] para detalles adicionales. Una vez actualizado a la versión 3.0, consulta nuestras guías de migración https://github.com/quarkusio/quarkus/wiki/Migration-Guide-3.1[3.1] and https://github.com/quarkusio/quarkus/wiki/Migration-Guide-3.2[3.2]

source: Full changelog
es_es: Registro completo de cambios

source: You can get https://github.com/quarkusio/quarkus/releases/tag/3.3.1[the full changelog of 3.3.1 on GitHub].
es_es: Puedes consultar el https://github.com/quarkusio/quarkus/releases/tag/3.3.1[registro completo de cambios 3.3.1 en GitHub].

source: Come Join Us
es_es: Únete a nosotros

source: We value your feedback a lot so please report bugs, ask for improvements... Let's build something great together!
es_es: Valoramos mucho tus comentarios, así que por favor reporta errores, solicita mejoras... ¡Construyamos algo grandioso juntos!

source: If you are a Quarkus user or just curious, don't be shy and join our welcoming community:
es_es: Si eres un usuario de Quarkus o simplemente tienes curiosidad, no seas tímido y únete a nuestra acogedora comunidad:

source: provide feedback on https://github.com/quarkusio/quarkus/issues[GitHub];
es_es: proporcionar retroalimentación en https://github.com/quarkusio/quarkus/issues[GitHub];

source: craft some code and https://github.com/quarkusio/quarkus/pulls[push a PR];
es_es: escribir algo de código y enviar https://github.com/quarkusio/quarkus/pulls[push a PR];

source: discuss with us on https://quarkusio.zulipchat.com/[Zulip] and on the https://groups.google.com/d/forum/quarkus-dev[mailing list];
es_es: comentar con nosotros en https://quarkusio.zulipchat.com/[Zulip] y en nuestra https://groups.google.com/d/forum/quarkus-dev[lista de correo];

source: ask your questions on https://stackoverflow.com/questions/tagged/quarkus[Stack Overflow].
es_es: hacer tus preguntas en https://stackoverflow.com/questions/tagged/quarkus[Stack Overflow].
