Repository: quarkusio/pt.quarkus.io
Catalog: l10n/po/*/_guides/0-glossary.adoc.po
Languages: es

source: Glossary
es: Glosario

source: This is a collection of preferred term in the documentation and website. Please stay within these terms for consistency.
es: Esta es una colección de términos preferidos en la documentación y el sitio web. Por favor, manténgase dentro de estos términos por coherencia.

source: * Live coding
es: * Codificación en vivo

source: for our `quarkus:dev` capability
es: para nuestra capacidad de `quarkus:dev`

source: * GraalVM native image
es: * Imagen nativa de GraalVM

source: preferred term for the VM creating native executable. No space.
es: término preferido para el ejecutable nativo que crea la VM. No hay espacio.

source: non-preferred. Exclude.
es: no preferido. Excluye.

source: * Native Executable
es: * Ejecución nativa

source: the executable that is compiled to native 1s and 0s
es: el ejecutable que se compila a 1s y 0s nativos

source: * Docker image
es: * Imagen Docker

source: for the actual `Dockerfile` definition and when the tool chain is involved
es: para la definición actual de `Dockerfile` y cuando la cadena de herramientas está involucrada

source: * Container
es: * Contenedor

source: when we discuss Quarkus running in... containers
es: cuando hablamos de Quarkus corriendo en... contenedores

source: * Supersonic Subatomic Java
es: * Java subatómico supersónico

source: our tagline
es: nuestro lema

source: * Kubernetes Native Java
es: * Kubernetes Nativo Java

source: our preferred tagline to say that we rock for containers
es: nuestro eslogan preferido para decir que somos lo mejor para los contenedores

source: * Developer Joy
es: * Alegría del desarrollador

source: for everything going from live reload to the opinionated layer to a single config file
es: para todo lo que va desde la recarga en vivo a la capa obstinada a un único archivo de configuración

source: * Unify Imperative and Reactive
es: * Unificar lo imperativo y lo reactivo

source: imperative and reactive. 'Nuff said.
es: imperativo y reactivo. No hay más que decir.

source: * Best of breed frameworks and standards
es: * Los mejores marcos y normas

source: when we explain our stack
es: cuando explicamos nuestra pila
