Repository: quarkusio/pt.quarkus.io
Catalog: l10n/po/*/_guides/amazon-lambda.adoc.po
Languages: es

source: If using Gradle, the path to the binaries in the YAML templates must be changed from `target` to `build`
es: Si se utiliza Gradle, la ruta a los binarios en las plantillas YAML debe cambiarse de `target` a `build`

source: The native image can also be locally tested using the `sam.native.yaml` template:
es: La imagen nativa también puede probarse localmente utilizando la plantilla `sam.native.yaml`:

source: Modifying `function.zip`
es: Modificación de `function.zip`

source: The are times where you may have to add some additions to the `function.zip` lambda deployment that is generated by the build. To do this create a `zip.jvm` or `zip.native` directory within `src/main`. Create `zip.jvm/` if you are doing a pure Java lambda. `zip.native/` if you are doing a native deployment.
es: Hay veces en las que puedes tener que añadir algunas adiciones al despliegue de lambda `function.zip` que es generado por la construcción. Para ello crea un directorio `zip.jvm` o `zip.native` dentro de `src/main`. Crea `zip.jvm/` si estás haciendo una lambda puramente Java. `zip.native/` si estás haciendo un despliegue nativo.

source: Any you files and directories you create under your zip directory will be included within `function.zip`
es: Todos los archivos y directorios que crees bajo tu directorio zip se incluirán dentro de `function.zip`

source: Custom `bootstrap` script
es: Script personalizado de `bootstrap`

source: There are times you may want to set a specific system properties or other arguments when lambda invokes your native quarkus lambda deployment. If you include a `bootstrap` script file within `zip.native`, the quarkus extension will automatically rename the executable to `runner` within `function.zip` and set the unix mode of the `bootstrap` script to executable.
es: Hay veces que puedes querer establecer unas propiedades específicas del sistema u otros argumentos cuando lambda invoca tu despliegue lambda nativo de quarkus. Si incluyes un archivo de script `bootstrap` dentro de `zip.native`, la extensión quarkus renombrará automáticamente el ejecutable a `runner` dentro de `function.zip` y establecerá el modo unix del script `bootstrap` a ejecutable.

source: The native executable must be referenced as `runner` if you include a custom `bootstrap` script.
es: El ejecutable nativo debe ser referenciado como `runner` si incluye un script personalizado de `bootstrap`.

source: The extension generates an example script within `target/bootstrap-example.sh`.
es: La extensión genera un script de ejemplo dentro de `target/bootstrap-example.sh`.

source: Tracing with AWS XRay and GraalVM
es: Rastreo con AWS XRay y GraalVM

source: If you are building native images, and want to use https://aws.amazon.com/xray[AWS X-Ray Tracing] with your lambda you will need to include `quarkus-amazon-lambda-xray` as a dependency in your pom. The AWS X-Ray library is not fully compatible with GraalVM so we had to do some integration work to make this work.
es: Si estás construyendo imágenes nativas, y quieres usar https://aws.amazon.com/xray[AWS X-Ray Tracing] con tu lambda necesitarás incluir `quarkus-amazon-lambda-xray` como una dependencia en tu pom. La biblioteca de AWS X-Ray no es totalmente compatible con GraalVM, por lo que hemos tenido que hacer un trabajo de integración para que funcione.

source: In addition, remember to enable the AWS X-Ray tracing parameter in `manage.sh`, in the `cmd_create()` function. This can also be set in the AWS Management Console.
es: Además, recuerde habilitar el parámetro de rastreo de AWS X-Ray en `manage.sh`, en la función `cmd_create()`. Esto también se puede configurar en la consola de administración de AWS.

source: For the sam template files, add the following to the YAML function Properties.
es: Para los archivos de plantilla sam, añada lo siguiente a la función YAML Propiedades.

source: AWS X-Ray does add many classes to your distribution, do ensure you are using at least the 256MB AWS Lambda memory size. This is explicitly set in `manage.sh` `cmd_create()`. Whilst the native image potentially can always use a lower memory setting, it would be recommended to keep the setting the same, especially to help compare performance.
es: AWS X-Ray añade muchas clases a su distribución, asegúrese de que está utilizando al menos el tamaño de memoria de 256 MB de AWS Lambda. Esto se establece explícitamente en `manage.sh` `cmd_create()` . Aunque la imagen nativa siempre puede utilizar una configuración de memoria más baja, se recomienda mantener la misma configuración, especialmente para ayudar a comparar el rendimiento.

source: Using HTTPS or SSL/TLS
es: Uso de HTTPS o SSL/TLS

source: If your code makes HTTPS calls, such as to a micro-service (or AWS service), you will need to add configuration to the native image, as GraalVM will only include the dependencies when explicitly declared. Quarkus, by default enables this functionality on extensions that implicitly require it. For further information, please consult the xref:native-and-ssl.adoc[Quarkus SSL guide]
es: Si tu código hace llamadas HTTPS, como por ejemplo a un microservicio (o servicio AWS), tendrás que añadir la configuración a la imagen nativa, ya que GraalVM sólo incluirá las dependencias cuando se declaren explícitamente. Quarkus, por defecto habilita esta funcionalidad en las extensiones que implícitamente lo requieren. Para más información, consulta la xref:native-and-ssl.adoc[Guía de Quarkus SSL]

source: Open src/main/resources/application.properties and add the following line to enable SSL in your native image.
es: Abra src/main/resources/application.properties y añada la siguiente línea para habilitar SSL en su imagen nativa.

source: Using the AWS Java SDK v2
es: Uso del SDK de Java de AWS v2

source: Quarkus now has extensions for DynamoDB, S3, SNS and SQS (more coming). Please check link:{amazon-services-guide}[those guides] on how to use the various AWS Services with Quarkus, as opposed to wiring manually like below.
es: Quarkus ahora tiene extensiones para DynamoDB, S3, SNS y SQS (más en camino). Por favor, consulte link:{amazon-services-guide}[estas guías] sobre cómo utilizar los diversos servicios de AWS con Quarkus, en lugar de cablear manualmente como se indica a continuación.

source: With minimal integration, it is possible to leverage the AWS Java SDK v2, which can be used to invoke services such as SQS, SNS, S3 and DynamoDB.
es: Con una integración mínima, es posible aprovechar el AWS Java SDK v2, que puede utilizarse para invocar servicios como SQS, SNS, S3 y DynamoDB.

source: For native image, however the URL Connection client must be preferred over the Apache HTTP Client when using synchronous mode, due to issues in the GraalVM compilation (at present).
es: Para la imagen nativa, sin embargo, se debe preferir el cliente de Conexión URL sobre el Cliente HTTP de Apache cuando se utiliza el modo síncrono, debido a problemas en la compilación de GraalVM (en la actualidad).

source: Add `quarkus-jaxb` as a dependency in your Maven `pom.xml`, or Gradle `build.gradle` file.
es: Añade `quarkus-jaxb` como dependencia en tu archivo Maven `pom.xml`, o Gradle `build.gradle`.

source: You must also force your AWS service client for SQS, SNS, S3 et al, to use the URL Connection client, which connects to AWS services over HTTPS, hence the inclusion of the SSL enabled property, as described in the <<https>> section above.
es: También debe forzar a su cliente de servicios de AWS para SQS, SNS, S3 y otros, a utilizar el cliente de Conexión URL, que se conecta a los servicios de AWS a través de HTTPS, de ahí la inclusión de la propiedad SSL enabled, como se describe en la sección <<https>> anterior.

source: For Maven, add the following to your `pom.xml`.
es: Para Maven, añada lo siguiente a su `pom.xml`.

source: if you see `java.security.InvalidAlgorithmParameterException: the trustAnchors parameter must be non-empty` or similar SSL error, due to the current status of GraalVM, there is some additional work to bundle the `function.zip`, as below. For more information, please see the xref:native-and-ssl.adoc[Quarkus Native SSL Guide].
es: si ves `java.security.InvalidAlgorithmParameterException: the trustAnchors parameter must be non-empty` o un error SSL similar, debido al estado actual de GraalVM, hay algo de trabajo adicional para agrupar el `function.zip`, como se indica a continuación. Para más información, por favor vea la xref:native-and-ssl.html[Guía de SSL nativa de Quarkus].

source: Additional requirements for client SSL
es: Requisitos adicionales para el SSL del cliente

source: The native executable requires some additional steps to enable client SSL that S3 and other AWS libraries need.
es: El ejecutable nativo requiere algunos pasos adicionales para habilitar el SSL del cliente que necesitan S3 y otras bibliotecas de AWS.

source: A custom `bootstrap` script
es: Un script personalizado de `bootstrap`

source: `libsunec.so` must be added to `function.zip`
es: `libsunec.so` debe añadirse a `function.zip`

source: `cacerts` must be added to `function.zip`
es: `cacerts` debe añadirse a `function.zip`

source: To do this, first create a directory `src/main/zip.native/` with your build. Next create a shell script file called `bootstrap` within `src/main/zip.native/`, like below. An example is create automatically in your build folder (target or build), called `bootstrap-example.sh`
es: Para ello, primero cree un directorio `src/main/zip.native/` con su construcción. A continuación, cree un archivo de secuencia de comandos llamado `bootstrap` dentro de `src/main/zip.native/`, como se indica a continuación. Un ejemplo es crear automáticamente en su carpeta de construcción (target o build), llamado `bootstrap-example.sh`

source: Additional set `-Djavax.net.ssl.trustStorePassword=changeit` if your `cacerts` file is password protected.
es: Conjunto adicional `-Djavax.net.ssl.trustStorePassword=changeit` si su archivo `cacerts` está protegido por contraseña.

source: Next you must copy some files from your GraalVM distribution into `src/main/zip.native/`.
es: A continuación debes copiar algunos archivos de tu distribución de GraalVM en `src/main/zip.native/`.

source: GraalVM versions can have different paths for these files, and whether you using the Java 8 or 11 version. Adjust accordingly.
es: Las versiones de GraalVM pueden tener diferentes rutas para estos archivos, y si se utiliza la versión de Java 8 o 11. Ajústalo en consecuencia.

source: Now when you run the native build all these files will be included within `function.zip`
es: Ahora, cuando ejecute la compilación nativa, todos estos archivos se incluirán en `function.zip`

source: If you are using a Docker image to build, then you must extract these files from this image.
es: Si está utilizando una imagen Docker para construir, entonces debe extraer estos archivos de esta imagen.

source: To extract the required ssl, you must start up a Docker container in the background, and attach to that container to copy the artifacts.
es: Para extraer el ssl necesario, debe iniciar un contenedor Docker en segundo plano, y adjuntar a ese contenedor para copiar los artefactos.

source: First, let's start the GraalVM container, noting the container id output.
es: En primer lugar, vamos a iniciar el contenedor GraalVM, observando la salida del id del contenedor.

source: First, libsunec.so, the C library used for the SSL implementation:
es: En primer lugar, libsunec.so, la biblioteca C utilizada para la implementación de SSL:

source: Second, cacerts, the certificate store. You may need to periodically obtain an updated copy, also.
es: En segundo lugar, cacerts, el almacén de certificados. Es posible que tenga que obtener periódicamente una copia actualizada, también.

source: Your final archive will look like this:
es: Su archivo final tendrá este aspecto:

source: Deploy to AWS Lambda using a Container Image
es: Implementación en AWS Lambda mediante una imagen de contenedor

source: AWS Lambda supports creating your lambdas by referencing https://docs.aws.amazon.com/lambda/latest/dg/lambda-images.html[container images] rather than uploading ZIP files. This can have some benefits such as bypassing the size limit of the uploaded ZIP files. You can define lambda functions for both native builds as well as regular JVM builds.
es: AWS Lambda admite la creación de sus lambdas haciendo referencia a https://docs.aws.amazon.com/lambda/latest/dg/lambda-images.html[imágenes de contenedores] en lugar de cargar archivos ZIP. Esto puede tener algunas ventajas, como evitar el límite de tamaño de los archivos ZIP cargados. Puede definir funciones lambda tanto para compilaciones nativas como para compilaciones JVM normales.

source: JVM container image
es: Imagen del contenedor JVM

source: For a regular JVM distribution you need to base your image off the official AWS Java base images. Below is an example of a Dockerfile that would create a container image from your Quarkus Lambda project. It assumes that `mvn package` has been executed and binaries are available in the `target/` directory:
es: Para una distribución regular de JVM necesitas basar tu imagen en las imágenes base oficiales de AWS Java. A continuación se muestra un ejemplo de un archivo Docker que crearía una imagen de contenedor de su proyecto Quarkus Lambda. Asume que `mvn package` ha sido ejecutado y los binarios están disponibles en el directorio `target/`:

source: Native executable container image
es: Imagen ejecutable nativa del contenedor

source: To create a lambda container image that uses the native executable we'll need to do things a little differently. In this case, we won't need to use the `java:11` base image from AWS but instead we'll use a special image that assumes that the runtime environment for the lambda is provided. The example below creates such a container. It assumes that a Maven build has been executed (such as `mvn package -Dnative=true`) and has generated the native binary into the `target/` directory. The binary needs to be named `bootstrap` and be placed in `/var/runtime/`:
es: Para crear una imagen de contenedor lambda que utilice el ejecutable nativo tendremos que hacer las cosas de forma un poco diferente. En este caso, no necesitaremos utilizar la imagen base de `java:11` de AWS, sino que utilizaremos una imagen especial que asume que se proporciona el entorno de ejecución para lambda. El siguiente ejemplo crea un contenedor de este tipo. Asume que se ha ejecutado una construcción de Maven (como `mvn package -Dnative=true`) y ha generado el binario nativo en el directorio `target/`. El binario necesita ser llamado `bootstrap` y ser colocado en `/var/runtime/`:

source: Deploying a container image lambda
es: Despliegue de una imagen de contenedor lambda

source: Below, you can see how the container images created above can be built and deployed to AWS using the `docker` and `aws` command line tools. These instructions work for both native and jvm container images and assume that the `aws` command line tool has been logged in.
es: A continuación, puede ver cómo las imágenes de contenedor creadas anteriormente pueden construirse e implementarse en AWS utilizando las herramientas de línea de comandos `docker` y `aws`. Estas instrucciones funcionan tanto para imágenes de contenedor nativas como jvm y asumen que la herramienta de línea de comandos `aws` ha sido iniciada.

source: Build the Docker image
es: Construir la imagen Docker

source: Create an ECR repository in the users AWS account
es: Crear un repositorio ECR en la cuenta AWS del usuario

source: Tag the image using your ECR registry information
es: Etiquetar la imagen con la información de su registro ECR

source: Log Docker into your ECR registry and push the Docker image to it
es: Registre Docker en su registro ECR y empuje la imagen Docker a él

source: Create the AWS lambda function with the AWS CLI tool
es: Crear la función AWS lambda con la herramienta AWS CLI

source: Make sure you reference the image you uploaded previously (assumes that a role exists that can be used to run the lambda). Please note that it is not unlikely that for the JVM lambda function, the default memory limit of `128Mb` will not be enough to run the function. In that case, you can increase the memory limit when creating the function by providing the `--memory-size 256` parameter to your `aws lambda create-function` command. You can also adjust the function in the AWS console after you've created it.
es: Asegúrate de que haces referencia a la imagen que has subido previamente (se supone que existe un rol que puede ser utilizado para ejecutar la lambda). Ten en cuenta que no es improbable que para la función lambda de JVM, el límite de memoria por defecto de `128Mb` no sea suficiente para ejecutar la función. En ese caso, puede aumentar el límite de memoria al crear la función proporcionando el parámetro `--memory-size 256` a su comando `aws lambda create-function`. También puede ajustar la función en la consola de AWS después de haberla creado.

source: Now you can use the AWS console to view and test your new lambda function.
es: Ahora puedes usar la consola de AWS para ver y probar tu nueva función lambda.

source: Amazon Alexa Integration
es: Integración de Amazon Alexa

source: To use Alexa with Quarkus native, you need to use the https://github.com/quarkiverse/quarkus-amazon-alexa[Quarkus Amazon Alexa extension hosted at the Quarkiverse Hub].
es: Para utilizar Alexa con Quarkus nativo, es necesario utilizar la https://github.com/quarkiverse/quarkus-amazon-alexa[extensión Quarkus Amazon Alexa alojada en el Quarkiverse Hub].

source: Define the latest version of the extension in your POM file.
es: Defina la última versión de la extensión en su archivo POM.

source: Create your Alexa handler, as normal, by sub-classing the abstract `com.amazon.ask.SkillStreamHandler`, and add your request handler implementation.
es: Crea tu manejador de Alexa, como es normal, usando una sub-clase abstracta de `com.amazon.ask.SkillStreamHandler`, y añade la implementación de tu manejador de peticiones.

source: That's all there is to it!
es: Eso es todo!
