Repository: quarkusio/pt.quarkus.io
Catalog: l10n/po/*/_guides/amazon-lambda.adoc.po
Languages: es

source: The `quarkus-amazon-lambda` extension allows you to use Quarkus to build your AWS Lambdas. Your lambdas can use injection annotations from CDI or Spring and other Quarkus facilities as you need them.
es: La extensión `quarkus-amazon-lambda` le permite utilizar Quarkus para construir sus AWS Lambdas. Tus lambdas pueden utilizar anotaciones de inyección de CDI o Spring y otras facilidades de Quarkus según las necesites.

source: Quarkus lambdas can be deployed using the Amazon Java Runtime, or you can build a native executable and use Amazon's Custom Runtime if you want a smaller memory footprint and faster cold boot startup time.
es: Las lambdas de Quarkus pueden desplegarse utilizando el tiempo de ejecución de Amazon Java, o puedes construir un ejecutable nativo y utilizar el tiempo de ejecución personalizado de Amazon si quieres una huella de memoria más pequeña y un tiempo de arranque en frío más rápido.

source: Quarkus's integration with lambdas also supports Quarkus's Live Coding development cycle. You an bring up your Quarkus lambda project in dev or test mode and code on your project live.
es: La integración de Quarkus con las lambdas también es compatible con el ciclo de desarrollo Live Coding de Quarkus. Usted puede traer su proyecto Quarkus lambda en el modo de desarrollo o de prueba y el código en su proyecto en vivo.

source: Prerequisites
es: Requisitos previos

source: https://aws.amazon.com[An Amazon AWS account]
es: https://aws.amazon.com[A Amazon AWS account]

source: https://docs.aws.amazon.com/serverless-application-model/latest/developerguide/serverless-sam-cli-install.html[AWS SAM CLI], for local testing
es: https://docs.aws.amazon.com/serverless-application-model/latest/developerguide/serverless-sam-cli-install.html[AWS SAM CLI], para pruebas locales

source: For Gradle projects please <<gradle,see below>>, or for further reference consult the guide in the xref:gradle-tooling.adoc[Gradle setup page].
es: Para los proyectos Gradle, por favor, <<gradle, ver más abajo>>, o para mayor referencia consulte la guía en xref:gradle-tooling.adoc[Gradle setup page].

source: Getting Started
es: Cómo empezar

source: This guide walks you through generating an example Java project via a maven archetype and deploying it to AWS.
es: Esta guía le guía a través de la generación de un proyecto Java de ejemplo a través de un arquetipo de maven y su implementación en AWS.

source: Installing AWS bits
es: Instalación de los bits de AWS

source: Installing all the AWS bits is probably the most difficult thing about this guide. Make sure that you follow all the steps for installing AWS CLI.
es: Instalar todos los bits de AWS es probablemente lo más difícil de esta guía. Asegúrate de seguir todos los pasos para instalar AWS CLI.

source: Creating the Maven Deployment Project
es: Creación del proyecto de implementación de Maven

source: Create the Quarkus AWS Lambda maven project using our Maven Archetype.
es: Crea el proyecto maven de Quarkus AWS Lambda utilizando nuestro arquetipo Maven.

source: If you prefer to use Gradle, you can quickly and easily generate a Gradle project via https://code.quarkus.io/[code.quarkus.io] adding the `quarkus-amazon-lambda` extension as a dependency.
es: Si prefieres usar Gradle, puedes generar rápida y fácilmente un proyecto Gradle a través de https://code.quarkus.io/[code.quarkus.io] añadiendo la extensión `quarkus-amazon-lambda` como dependencia.

source: Copy the build.gradle, gradle.properties and settings.gradle into the above generated Maven archetype project, to follow along with this guide.
es: Copie el build.gradle, gradle.properties y settings.gradle en el proyecto arquetipo de Maven generado anteriormente, para seguir con esta guía.

source: Execute: gradle wrapper to setup the gradle wrapper (recommended).
es: Ejecuta: gradle wrapper para configurar el gradle wrapper (recomendado).

source: For full Gradle details <<gradle, see below>>.
es: Para ver todos los detalles de Gradle <<gradle, ver más abajo>>.

source: Choose Your Lambda
es: Elija su lambda

source: The `quarkus-amazon-lambda` extension scans your project for a class that directly implements the Amazon `RequestHandler<?, ?>` or `RequestStreamHandler` interface. It must find a class in your project that implements this interface or it will throw a build time failure. If it finds more than one handler class, a build time exception will also be thrown.
es: La extensión `quarkus-amazon-lambda` busca en tu proyecto una clase que implemente directamente la interfaz de Amazon `RequestHandler<?, ?>` o `RequestStreamHandler`. Debe encontrar una clase en tu proyecto que implemente esta interfaz o lanzará un fallo de compilación. Si encuentra más de una clase manejadora, también se lanzará una excepción de tiempo de compilación.

source: Sometimes, though, you might have a few related lambdas that share code and creating multiple maven modules is just an overhead you don't want to do. The `quarkus-amazon-lambda` extension allows you to bundle multiple lambdas in one project and use configuration or an environment variable to pick the handler you want to deploy.
es: A veces, sin embargo, puedes tener unas cuantas lambdas relacionadas que comparten código y crear múltiples módulos de maven es una sobrecarga que no quieres hacer. La extensión `quarkus-amazon-lambda` te permite agrupar múltiples lambdas en un proyecto y utilizar la configuración o una variable de entorno para elegir el manejador que quieres desplegar.

source: The generated project has three lambdas within it. Two that implement the `RequestHandler<?, ?>` interface, and one that implements the `RequestStreamHandler` interface. One that is used and two that are unused. If you open up `src/main/resources/application.properties` you'll see this:
es: El proyecto generado tiene tres lambdas dentro de él. Dos que implementan la interfaz `RequestHandler<?, ?>`, y una que implementa la interfaz `RequestStreamHandler`. Una que se usa y dos que no se usan. Si abres `src/main/resources/application.properties` verás esto:

source: The `quarkus.lambda.handler` property tells Quarkus which lambda handler to deploy. This can be overridden with an environment variable too.
es: La propiedad `quarkus.lambda.handler` indica a Quarkus qué manejador lambda debe desplegar. Esto puede ser anulado con una variable de entorno también.

source: If you look at the three generated handler classes in the project, you'll see that they are `@Named` differently.
es: Si miras las tres clases de manejadores generadas en el proyecto, verás que son `@Named` diferentes.

source: The CDI name of the handler class must match the value specified within the `quarkus.lambda.handler` property.
es: El nombre CDI de la clase manejadora debe coincidir con el valor especificado en la propiedad `quarkus.lambda.handler`.

source: Deploy to AWS Lambda Java Runtime
es: Implementar en AWS Lambda Java Runtime

source: There are a few steps to get your lambda running on AWS. The generated maven project contains a helpful script to create, update, delete, and invoke your lambdas for pure Java and native deployments.
es: Hay algunos pasos para conseguir que su lambda se ejecute en AWS. El proyecto maven generado contiene un script útil para crear, actualizar, eliminar e invocar sus lambdas para implementaciones puramente Java y nativas.

source: Build and Deploy
es: Construir y desplegar

source: Build the project:
es: Construye el proyecto:

source: This will compile and package your code.
es: Esto compilará y empaquetará su código.

source: Create an Execution Role
es: Crear una función de ejecución

source: View the https://docs.aws.amazon.com/lambda/latest/dg/gettingstarted-awscli.html[Getting Started Guide] for deploying a lambda with AWS CLI. Specifically, make sure you have created an `Execution Role`. You will need to define a `LAMBDA_ROLE_ARN` environment variable in your profile or console window, Alternatively, you can edit the `manage.sh` script that is generated by the build and put the role value directly there:
es: Consulte la https://docs.aws.amazon.com/lambda/latest/dg/gettingstarted-awscli.html[Guía de inicio] para implementar un lambda con AWS CLI. Específicamente, asegúrese de haber creado un `Execution Role`. Tendrá que definir una variable de entorno `LAMBDA_ROLE_ARN` en su perfil o ventana de consola, alternativamente, puede editar el script `manage.sh` que es generado por la construcción y poner el valor del rol directamente allí:

source: Extra Build Generated Files
es: Archivos extra generados por la compilación

source: After you run the build, there are a few extra files generated by the `quarkus-amazon-lambda` extension. These files are in the the build directory: `target/` for maven, `build/` for gradle.
es: Después de ejecutar la construcción, hay algunos archivos adicionales generados por la extensión `quarkus-amazon-lambda`. Estos archivos están en el directorio de construcción: `target/` para maven, `build/` para gradle.

source: `function.zip` - lambda deployment file
es: `function.zip` - archivo de despliegue de lambda

source: `manage.sh` - wrapper around aws lambda cli calls
es: `manage.sh` - envoltura alrededor de las llamadas aws lambda cli

source: `bootstrap-example.sh` - example bootstrap script for native deployments
es: `bootstrap-example.sh` - ejemplo de secuencia de comandos de arranque para las implantaciones nativas

source: `sam.jvm.yaml` - (optional) for use with sam cli and local testing
es: `sam.jvm.yaml` - (opcional) para su uso con sam cli y pruebas locales

source: `sam.native.yaml` - (optional) for use with sam cli and native local testing
es: `sam.native.yaml` - (opcional) para su uso con sam cli y pruebas locales nativas

source: Create the function
es: Crear la función

source: The `target/manage.sh` script is for managing your lambda using the AWS Lambda Java runtime. This script is provided only for your convenience. Examine the output of the `manage.sh` script if you want to learn what aws commands are executed to create, delete, and update your lambdas.
es: El script `target/manage.sh` es para administrar su lambda utilizando el tiempo de ejecución de AWS Lambda Java. Este script se proporciona sólo para su comodidad. Examine la salida del script `manage.sh` si desea saber qué comandos de aws se ejecutan para crear, eliminar y actualizar sus lambdas.

source: `manage.sh` supports four operation: `create`, `delete`, `update`, and `invoke`.
es: `manage.sh` soporta cuatro operaciones: `create`, `delete`, `update`, y `invoke`.

source: To verify your setup, that you have the AWS CLI installed, executed aws configure for the AWS access keys, and setup the `LAMBDA_ROLE_ARN` environment variable (as described above), please execute `manage.sh` without any parameters. A usage statement will be printed to guide you accordingly.
es: Para verificar su configuración, que tiene la CLI de AWS instalada, ha ejecutado aws configure para las claves de acceso de AWS y ha configurado la variable de entorno `LAMBDA_ROLE_ARN` (como se ha descrito anteriormente), ejecute `manage.sh` sin ningún parámetro. Se imprimirá una declaración de uso para guiarte en consecuencia.

source: If using Gradle, the path to the binaries in the `manage.sh` must be changed from `target` to `build`
es: Si se utiliza Gradle, la ruta de acceso a los binarios en `manage.sh` debe cambiarse de `target` a `build`

source: To see the `usage` statement, and validate AWS configuration:
es: Para ver la declaración `usage`, y validar la configuración de AWS:

source: You can `create` your function using the following command:
es: Puede crear su función utilizando el siguiente comando, `create` :

source: or if you do not have `LAMBDA_ROLE_ARN` already defined in this shell:
es: o si no tiene `LAMBDA_ROLE_ARN` ya definido en este shell:

source: Do not change the handler switch. This must be hardcoded to `io.quarkus.amazon.lambda.runtime.QuarkusStreamHandler::handleRequest`. This handler bootstraps Quarkus and wraps your actual handler so that injection can be performed.
es: No cambie el switch del manejador. Esto debe ser codificado en `io.quarkus.amazon.lambda.runtime.QuarkusStreamHandler::handleRequest`. Este manejador arranca Quarkus y envuelve su manejador real para que la inyección pueda ser realizada.

source: If there are any problems creating the function, you must delete it with the `delete` function before re-running the `create` command.
es: Si hay algún problema en la creación de la función, debe borrarla con la función `delete` antes de volver a ejecutar el comando `create`.

source: Commands may also be stacked:
es: Los comandos también pueden apilarse:

source: Invoke the Lambda
es: Invocar la Lambda

source: Use the `invoke` command to invoke your function.
es: Utilice el comando `invoke` para invocar su función.

source: The example lambda takes input passed in via the `--payload` switch which points to a json file in the root directory of the project.
es: La lambda de ejemplo toma la entrada pasada a través del switch `--payload` que apunta a un archivo json en el directorio raíz del proyecto.

source: The lambda can also be invoked locally with the SAM CLI like this:
es: La lambda también puede ser invocada localmente con la CLI de SAM de la siguiente manera:

source: If you are working with your native image build, simply replace the template name with the native version:
es: Si está trabajando con su construcción de imagen nativa, simplemente reemplace el nombre de la plantilla con la versión nativa:

source: Update the Lambda
es: Actualizar la Lambda

source: You can update the Java code as you see fit. Once you've rebuilt, you can redeploy your lambda by executing the `update` command.
es: Puedes actualizar el código Java como creas conveniente. Una vez que hayas reconstruido, puedes volver a desplegar tu lambda ejecutando el comando `update`.

source: Deploy to AWS Lambda Custom (native) Runtime
es: Implementación en el tiempo de ejecución personalizado (nativo) de AWS Lambda

source: If you want a lower memory footprint and faster initialization times for your lambda, you can compile your Java code to a native executable. Just make sure to rebuild your project with the `-Pnative` switch.
es: Si quieres una menor huella de memoria y tiempos de inicialización más rápidos para tu lambda, puedes compilar tu código Java a un ejecutable nativo. Sólo asegúrese de reconstruir su proyecto con el interruptor `-Pnative`.

source: For Linux hosts, execute:
es: Para los hosts de Linux, ejecute:

source: If you are building on a non-Linux system, you will need to also pass in a property instructing Quarkus to use a docker build as Amazon Lambda requires linux binaries. You can do this by passing this property to your build: `-Dquarkus.native.container-build=true`. This requires you to have Docker installed locally, however.
es: Si estás construyendo en un sistema que no es Linux, tendrás que pasar también una propiedad que indique a Quarkus que utilice una construcción docker, ya que Amazon Lambda requiere binarios linux. Puedes hacerlo pasando esta propiedad a tu construcción: `-Dquarkus.native.container-build=true`. Sin embargo, esto requiere que tengas Docker instalado localmente.

source: Either of these commands will compile and create a native executable image. It also generates a zip file `target/function.zip`. This zip file contains your native executable image renamed to `bootstrap`. This is a requirement of the AWS Lambda Custom (Provided) Runtime.
es: Cualquiera de estos comandos compilará y creará una imagen ejecutable nativa. También genera un archivo zip `target/function.zip`. Este archivo zip contiene su imagen ejecutable nativa renombrada a `bootstrap`. Este es un requisito del tiempo de ejecución personalizado (proporcionado) de AWS Lambda.

source: The instructions here are exactly as above with one change: you'll need to add `native` as the first parameter to the `manage.sh` script:
es: Las instrucciones son exactamente las mismas que las anteriores con un cambio: tendrá que añadir `native` como primer parámetro del script `manage.sh`:

source: As above, commands can be stacked. The only requirement is that `native` be the first parameter should you wish to work with native image builds. The script will take care of the rest of the details necessary to manage your native image function deployments.
es: Como en el caso anterior, los comandos se pueden apilar. El único requisito es que `native` sea el primer parámetro si desea trabajar con construcciones de imágenes nativas. El script se encargará del resto de los detalles necesarios para gestionar sus despliegues de funciones de imagen nativa.

source: Examine the output of the `manage.sh` script if you want to learn what aws commands are executed to create, delete, and update your lambdas.
es: Examina la salida del script `manage.sh` si quieres saber qué comandos aws se ejecutan para crear, borrar y actualizar tus lambdas.

source: One thing to note about the create command for native is that the `aws lambda create-function` call must set a specific environment variable:
es: Una cosa a tener en cuenta sobre el comando de creación para nativos es que la llamada a `aws lambda create-function` debe establecer una variable de entorno específica:

source: Examine the POM and Gradle build
es: Examinar el POM y la construcción de Gradle

source: There is nothing special about the POM other than the inclusion of the `quarkus-amazon-lambda` extension as a dependency. The extension automatically generates everything you might need for your lambda deployment.
es: No hay nada especial en el POM, aparte de la inclusión de la extensión `quarkus-amazon-lambda` como dependencia. La extensión genera automáticamente todo lo que puedas necesitar para tu despliegue de lambda.

source: In previous versions of this extension you had to set up your pom or gradle to zip up your executable for native deployments, but this is not the case anymore.
es: En versiones anteriores de esta extensión había que configurar el pom o gradle para comprimir el ejecutable para despliegues nativos, pero esto ya no es así.

source: Gradle build
es: Construcción de Gradle

source: Similarly for Gradle projects, you also just have to add the `quarkus-amazon-lambda` dependency. The extension automatically generates everything you might need for your lambda deployment.
es: Del mismo modo, para los proyectos de Gradle, también sólo tienes que añadir la dependencia de `quarkus-amazon-lambda`. La extensión genera automáticamente todo lo que puedas necesitar para el despliegue de tu lambda.

source: Example Gradle dependencies:
es: Ejemplo de dependencias de Gradle:

source: Live Coding and Unit/Integration Testing
es: Codificación en vivo y pruebas de unidad/integración

source: To mirror the AWS Lambda environment as closely as possible in a dev environment, the Quarkus Amazon Lambda extension boots up a mock AWS Lambda event server in Quarkus Dev and Test mode. This mock event server simulates a true AWS Lambda environment.
es: Para reflejar el entorno de AWS Lambda con la mayor exactitud posible en un entorno de desarrollo, la extensión de Quarkus Amazon Lambda inicia un servidor de eventos de AWS Lambda falso en el modo de desarrollo y prueba de Quarkus. Este servidor de eventos falso simula un verdadero entorno de AWS Lambda.

source: While running in Quarkus Dev Mode, you can feed events to it by doing an HTTP POST to `http://localhost:8080`. The mock event server will receive the events and your lambda will be invoked. You can perform live coding on your lambda and changes will automatically be recompiled and available the next invocation you make. Here's an example:
es: Mientras se ejecuta en el modo de desarrollo de Quarkus, puede alimentar los eventos haciendo un POST HTTP a `http://localhost:8080`. El servidor de eventos falso recibirá los eventos y su lambda será invocado. Puedes realizar codificación en vivo en tu lambda y los cambios se recompilarán automáticamente y estarán disponibles en la siguiente invocación que hagas. Aquí tienes un ejemplo:

source: For your unit tests, you can also invoke on the mock event server using any HTTP client you want. Here's an example using rest-assured. Quarkus starts up a separate Mock Event server under port 8081. The default port for Rest Assured is automatically set to 8081 by Quarkus so you can invoke on this endpoint.
es: Para tus pruebas unitarias, también puedes invocar en el servidor de eventos falso usando cualquier cliente HTTP que quieras. Aquí hay un ejemplo usando rest-assured. Quarkus inicia un servidor de eventos simulados separado bajo el puerto 8081. El puerto por defecto para Rest Assured se establece automáticamente a 8081 por Quarkus para que pueda invocar en este punto final.

source: The mock event server is also started for `@NativeImageTest` and `@QuarkusIntegrationTest` tests so will work with native binaries too. All this provides similar functionality to the SAM CLI local testing, without the overhead of Docker.
es: El servidor de eventos simulados también se inicia para las pruebas de `@NativeImageTest` y `@QuarkusIntegrationTest`, por lo que también funcionará con binarios nativos. Todo esto proporciona una funcionalidad similar a las pruebas locales de SAM CLI, sin la sobrecarga de Docker.

source: Finally, if port 8080 or port 8081 is not available on your computer, you can modify the dev and test mode ports with application.properties
es: Por último, si el puerto 8080 o el puerto 8081 no están disponibles en su ordenador, puede modificar los puertos en modo dev y test con application.properties

source: A port value of zero will result in a randomly assigned port.
es: Un valor de puerto de cero resultará en un puerto asignado aleatoriamente.

source: Testing with the SAM CLI
es: Pruebas con la CLI de SAM

source: If you do not want to use the mock event server, you can test your lambdas with SAM CLI.
es: Si no quieres utilizar el servidor de eventos simulado, puedes probar tus lambdas con SAM CLI.

source: The https://docs.aws.amazon.com/serverless-application-model/latest/developerguide/serverless-sam-cli-install.html[AWS SAM CLI] allows you to run your lambdas locally on your laptop in a simulated Lambda environment. This requires https://www.docker.com/products/docker-desktop[docker] to be installed. This is an optional approach should you choose to take advantage of it. Otherwise, the Quarkus JUnit integration should be sufficient for most of your needs.
es: La https://docs.aws.amazon.com/serverless-application-model/latest/developerguide/serverless-sam-cli-install.html[AWS SAM CLI] le permite ejecutar sus lambdas localmente en su portátil en un entorno de Lambda simulado. Esto requiere la instalación de https://www.docker.com/products/docker-desktop[docker]. Este es un enfoque opcional en caso de que decidas aprovecharlo. De lo contrario, la integración de Quarkus JUnit debería ser suficiente para la mayoría de sus necesidades.

source: A starter template has been generated for both JVM and native execution modes.
es: Se ha generado una plantilla de inicio para los modos de ejecución JVM y nativo.

source: Run the following SAM CLI command to locally test your lambda function, passing the appropriate SAM `template`. The `event` parameter takes any JSON file, in this case the sample `payload.json`.
es: Ejecute el siguiente comando CLI de SAM para probar localmente su función lambda, pasando el parámetro apropiado de SAM `template`. El parámetro `event` toma cualquier archivo JSON, en este caso el ejemplo `payload.json`.
