Repository: quarkusio/pt.quarkus.io
Catalog: l10n/po/*/_guides/amqp-dev-services.adoc.po
Languages: pt

source: Dev Services for AMQP
pt: Dev Services para AMQP

source: Dev Services for AMQP automatically starts an AMQP 1.0 broker in dev mode and when running tests. So, you don't have to start a broker manually. The application is configured automatically.
pt: O Dev Services para AMQP inicia automaticamente um broker AMQP 1.0 no modo _dev_ e ao executar testes. Assim, não é necessário iniciar um broker manualmente. A aplicação é configurada de forma automática.

source: Enabling / Disabling Dev Services for AMQP
pt: Ativação/desativação do Dev Services para AMQP

source: Dev Services for AMQP is automatically enabled unless:
pt: O Dev Services para AMQP é ativado automaticamente, a menos que:

source: `quarkus.amqp.devservices.enabled` is set to `false`
pt: `quarkus.amqp.devservices.enabled` é definido como `false`

source: the `amqp-host` or `amqp-port` is configured
pt: o `amqp-host` ou `amqp-port` esteja configurado

source: all the Reactive Messaging AMQP channels have the `host` or `port` attributes set
pt: todos os canais AMQP de mensagens reativas tenham os atributos `host` ou `port` definidos

source: Dev Services for AMQP relies on Docker to start the broker. If your environment does not support Docker, you will need to start the broker manually, or connect to an already running broker. You can configure the broker access using the `amqp-host`, `amqp-port`, `amqp-user` and `amqp-password` properties.
pt: O Dev Services para AMQP depende do Docker para iniciar o Broker. Se o seu ambiente não for compatível com o Docker, será necessário iniciar o Broker manualmente ou conectar-se a um Broker já em execução. Você pode configurar o acesso ao Broker utilizando as propriedades `amqp-host`, `amqp-port`, `amqp-user` e `amqp-password`.

source: Shared broker
pt: Broker compartilhado

source: Most of the time you need to share the broker between applications. Dev Services for AMQP implements a _service discovery_ mechanism for your multiple Quarkus applications running in _dev_ mode to share a single broker.
pt: Na maioria das vezes, é necessário compartilhar o broker entre várias aplicações. O Dev Services para AMQP implementa um mecanismo de _service discovery_ para que as suas diversas aplicações Quarkus em execução no modo _dev_ compartilhem um único broker.

source: Dev Services for AMQP starts the container with the `quarkus-dev-service-amqp` label which is used to identify the container.
pt: Dev Services para AMQP inicia o container com a etiqueta `quarkus-dev-service-amqp` que é utilizada para identificar o container.

source: If you need multiple (shared) brokers, you can configure the `quarkus.amqp.devservices.service-name` attribute and indicate the broker name. It looks for a container with the same value, or starts a new one if none can be found. The default service name is `amqp`.
pt: Se você precisar de vários brokers (compartilhados), você pode configurar o atributo `quarkus.amqp.devservices.service-name` e indicar o nome do broker. Este irá buscar um container com o mesmo valor ou iniciará um novo se não for encontrado nenhum. O nome de serviço predefinido é `amqp`.

source: Sharing is enabled by default in dev mode, but disabled in test mode. You can disable the sharing with `quarkus.amqp.devservices.shared=false`.
pt: O compartilhamento é ativado por padrão no modo _dev_, mas desativada no modo _test_. Você pode desativar o compartilhamento com `quarkus.amqp.devservices.shared=false`.

source: Setting the port
pt: Definir a porta

source: By default, Dev Services for AMQP picks a random port and configures the application. You can set the port by configuring the `quarkus.amqp.devservices.port` property.
pt: Por padrão, o Dev Services para AMQP escolhe uma porta aleatória e configura a aplicação. É possível definir a porta configurando a propriedade `quarkus.amqp.devservices.port`.

source: Configuring the image
pt: Configurando a imagem

source: Dev Services for AMQP uses https://quay.io/repository/artemiscloud/activemq-artemis-broker[activemq-artemis-broker] images. You can configure the image and version using the `quarkus.amqp.devservices.image-name` property:
pt: O Dev Services para AMQP usa a imagem link:https://quay.io/repository/artemiscloud/activemq-artemis-broker[activemq-artemis-broker]. É possível configurar a imagem e a versão usando a propriedade `quarkus.amqp.devservices.image-name`:

source: The configured image must be _compatible_ with the `activemq-artemis-broker` one. The container is launched with the `AMQ_USER`, `AMQ_PASSWORD` and `AMQ_EXTRA_ARGS` environment variables. The ports 5672 and 8161 (web console) are exposed.
pt: A imagem configurada deve ser _compatível_ com `activemq-artemis-broker`. O container é iniciado com as variáveis ​​de ambiente `AMQ_USER`, `AMQ_PASSWORD` e `AMQ_EXTRA_ARGS`. As portas 5672 e 8161 (console web) serão expostas.
