Repository: quarkusio/pt.quarkus.io
Catalog: l10n/po/*/_guides/aws-lambda.adoc.po
Languages: pt_br

source: Run the following SAM CLI command to locally test your lambda function, passing the appropriate SAM `template`. The `event` parameter takes any JSON file, in this case the sample `payload.json`.
pt_br: Execute o seguinte comando SAM CLI para testar localmente sua função lambda, passando o `template` SAM apropriado. O parâmetro `event` usa qualquer arquivo JSON, neste caso o exemplo `payload.json`.

source: If using Gradle, the path to the binaries in the YAML templates must be changed from `target` to `build`
pt_br: Se estiver a utilizar o Gradle, o caminho para os binários nos modelos YAML deve ser alterado de `target` para `build`

source: The native image can also be locally tested using the `sam.native.yaml` template:
pt_br: A imagem nativa também pode ser testada localmente utilizando o modelo `sam.native.yaml`:

source: Modifying `function.zip`
pt_br: Modificar `function.zip`

source: There are times when you may have to add some additions to the `function.zip` lambda deployment that is generated by the build. To do this, create a `zip.jvm` or `zip.native` directory within `src/main`. Create `zip.jvm/` if you are doing a pure Java lambda. `zip.native/` if you are doing a native deployment.
pt_br: Há ocasiões em que você pode ter de adicionar alguns acréscimos à implementação do lambda `function.zip` gerada pela compilação. Para fazer isso, crie um diretório `zip.jvm` ou `zip.native` dentro de `src/main`. Crie `zip.jvm/` se estiver fazendo um lambda Java puro. `zip.native/` se estiver fazendo uma implementação nativa.

source: Any you files and directories you create under your zip directory will be included within `function.zip`
pt_br: Todos os ficheiros e diretórios que criar no seu diretório zip serão incluídos no `function.zip`

source: Custom `bootstrap` script
pt_br: Script personalizado `bootstrap`

source: There are times you may want to set a specific system properties or other arguments when lambda invokes your native quarkus lambda deployment. If you include a `bootstrap` script file within `zip.native`, the quarkus extension will automatically rename the executable to `runner` within `function.zip` and set the unix mode of the `bootstrap` script to executable.
pt_br: Às vezes, você pode querer definir propriedades específicas do sistema ou outros argumentos quando o lambda invoca a implantação nativa do lambda do quarkus. Se incluir um arquivo de script `bootstrap` em `zip.native`, a extensão quarkus renomeará automaticamente o executável para `runner` em `function.zip` e definirá o modo unix do script `bootstrap` como executável.

source: The native executable must be referenced as `runner` if you include a custom `bootstrap` script.
pt_br: O executável nativo tem de ser referenciado como `runner` se incluir um script `bootstrap` personalizado.

source: The extension generates an example script within `target/bootstrap-example.sh`.
pt_br: A extensão gera um script de exemplo em `target/bootstrap-example.sh`.

source: Tracing with AWS XRay and GraalVM
pt_br: Rastreabilidade com AWS X-Ray e GraalVM

source: If you are building native images, and want to use https://aws.amazon.com/xray[AWS X-Ray Tracing] with your lambda you will need to include `quarkus-amazon-lambda-xray` as a dependency in your pom. The AWS X-Ray library is not fully compatible with GraalVM, so we had to do some integration work to make this work.
pt_br: Se estiver criando imagens nativas e quiser usar o link:https://aws.amazon.com/xray[AWS X-Ray Tracing] com seu lambda, será necessário incluir `quarkus-amazon-lambda-xray` como uma dependência no seu pom. A biblioteca do AWS X-Ray não é totalmente compatível com o GraalVM, portanto, tivemos que fazer algum trabalho de integração para que isso funcionasse.

source: In addition, remember to enable the AWS X-Ray tracing parameter in `manage.sh`, in the `cmd_create()` function. This can also be set in the AWS Management Console.
pt_br: Além disso, lembre-se de ativar o parâmetro de rastreamento do AWS X-Ray em `manage.sh`, na função `cmd_create()`. Isso também pode ser definido no Console de gerenciamento da AWS.

source: For the sam template files, add the following to the YAML function Properties.
pt_br: Para os arquivos de modelo SAM, adicione o seguinte às propriedades da função YAML.

source: AWS X-Ray does add many classes to your distribution, do ensure you are using at least the 256MB AWS Lambda memory size. This is explicitly set in `manage.sh` `cmd_create()`. Whilst the native image potentially can always use a lower memory setting, it would be recommended to keep the setting the same, especially to help compare performance.
pt_br: O AWS X-Ray adiciona muitas classes à sua distribuição, portanto, certifique-se de que esteja usando pelo menos o tamanho de memória do AWS Lambda de 256 MB. Isso é definido explicitamente em `manage.sh` `cmd_create()`. Embora a imagem nativa sempre possa usar uma configuração de memória menor, seria recomendável manter a mesma configuração, especialmente para ajudar a comparar o desempenho.

source: Using HTTPS or SSL/TLS
pt_br: Utilizar HTTPS ou SSL/TLS

source: If your code makes HTTPS calls (e.g. to a microservice, to an AWS service), you will need to add configuration to the native image, as GraalVM will only include the dependencies when explicitly declared. Quarkus, by default enables this functionality on extensions that implicitly require it. For further information, please consult the xref:native-and-ssl.adoc[Quarkus SSL guide]
pt_br: Se o seu código fizer chamadas HTTPS (por exemplo, para um microsserviço, para um serviço AWS), precisará adicionar a configuração à imagem nativa, pois o GraalVM só incluirá as dependências quando declaradas explicitamente. O Quarkus, por padrão, habilita essa funcionalidade em extensões que implicitamente a exigem. Para obter mais informações, consulte o xref:native-and-ssl.adoc[guia SSL do Quarkus]

source: Open src/main/resources/application.properties and add the following line to enable SSL in your native image.
pt_br: Abra src/main/resources/application.properties e adicione a seguinte linha para ativar o SSL na sua imagem nativa.

source: Using the AWS Java SDK v2
pt_br: Utilizar o AWS Java SDK v2

source: Quarkus now has extensions for DynamoDB, S3, SNS and SQS (more coming). Please check link:{amazon-services-guide}[those guides] on how to use the various AWS Services with Quarkus, as opposed to wiring manually like below.
pt_br: O Quarkus agora tem extensões para DynamoDB, S3, SNS e SQS (mais em breve). Consulte xref:{amazon-services-guide}[esses guias] sobre como usar os vários serviços da AWS com o Quarkus, em vez de fazer a conexão manualmente, como abaixo.

source: With minimal integration, it is possible to leverage the AWS Java SDK v2, which can be used to invoke services such as SQS, SNS, S3 and DynamoDB.
pt_br: Com uma integração mínima, é possível aproveitar o AWS Java SDK v2, que pode ser usado para invocar serviços como SQS, SNS, S3 e DynamoDB.

source: For native image, however, the URL Connection client must be preferred over the Apache HTTP Client when using synchronous mode, due to issues in the GraalVM compilation (at present).
pt_br: Para a imagem nativa, no entanto, o cliente de conexão de URL deve ser preferido ao cliente HTTP Apache ao usar o modo síncrono, devido a problemas na compilação do GraalVM (no momento).

source: Add `quarkus-jaxb` as a dependency in your Maven `pom.xml`, or Gradle `build.gradle` file.
pt_br: Adicione `quarkus-jaxb` como uma dependência no seu arquivo Maven `pom.xml`, ou Gradle `build.gradle`.

source: You must also force your AWS service client for SQS, SNS, S3 et al., to use the URL Connection client, which connects to AWS services over HTTPS, hence the inclusion of the SSL enabled property, as described in the xref:https[Using HTTPS or SSL/TLS] section above.
pt_br: Você também deve forçar o seu cliente de serviço da AWS, para SQS, SNS, S3 e outros, a usar o cliente de conexão de URL, que se conecta aos serviços da AWS por HTTPS, daí a inclusão da propriedade SSL habilitada, conforme descrito na seção xref:[Usando HTTPS ou SSL/TLS] acima.

source: For Maven, add the following to your `pom.xml`.
pt_br: Para o Maven, adicione o seguinte ao seu `pom.xml`.

source: if you see `java.security.InvalidAlgorithmParameterException: the trustAnchors parameter must be non-empty` or similar SSL error, due to the current status of GraalVM, there is some additional work to bundle the `function.zip`, as below. For more information, please see the xref:native-and-ssl.adoc[Quarkus Native SSL Guide].
pt_br: Se você vir `java.security.InvalidAlgorithmParameterException: the trustAnchors parameter must be non-empty` ou erro SSL semelhante, devido ao status atual do GraalVM, há algum trabalho adicional para agrupar o `function.zip` , conforme abaixo. Para obter mais informações, consulte o xref:native-and-ssl.adoc[Guia do Quarkus Native SSL].

source: Additional requirements for client SSL
pt_br: Requisitos adicionais para o cliente SSL

source: The native executable requires some additional steps to enable client SSL that S3 and other AWS libraries need.
pt_br: O executável nativo requer algumas etapas adicionais para habilitar o SSL do cliente que o S3 e outras bibliotecas da AWS precisam.

source: A custom `bootstrap` script
pt_br: Um script `bootstrap` personalizado

source: `libsunec.so` must be added to `function.zip`
pt_br: `libsunec.so` deve ser adicionado a `function.zip`

source: `cacerts` must be added to `function.zip`
pt_br: `cacerts` deve ser adicionado a `function.zip`

source: To do this, first create a directory `src/main/zip.native/` with your build. Next create a shell script file called `bootstrap` within `src/main/zip.native/`, like below. An example is created automatically in your build folder (target or build), called `bootstrap-example.sh`
pt_br: Para fazer isso, primeiro crie um diretório `src/main/zip.native/` com sua compilação. Em seguida, crie um arquivo de script de shell chamado `bootstrap` dentro de `src/main/zip.native/`, como abaixo. Um exemplo é criado automaticamente em sua pasta de compilação (target ou build), chamado `bootstrap-example.sh`

source: Additional set `-Djavax.net.ssl.trustStorePassword=changeit` if your `cacerts` file is password protected.
pt_br: Conjunto adicional `-Djavax.net.ssl.trustStorePassword=changeit` se o arquivo `cacerts` estiver protegido por senha.

source: Next you must copy some files from your GraalVM distribution into `src/main/zip.native/`.
pt_br: Em seguida, deve copiar alguns arquivos da sua distribuição GraalVM para `src/main/zip.native/`.

source: GraalVM versions can have different paths for these files whether you are using the Java 8 or 11 version. Adjust accordingly.
pt_br: As versões do GraalVM podem ter caminhos diferentes para estes arquivos, quer esteja a utilizar a versão Java 8 ou 11. Ajuste em conformidade.

source: Now when you run the native build all these files will be included within `function.zip`
pt_br: Agora, quando executar a compilação nativa, todos estes ficheiros serão incluídos no `function.zip`

source: If you are using a Docker image to build, then you must extract these files from this image.
pt_br: Se estiver a utilizar uma imagem Docker para construir, então deve extrair estes arquivos desta imagem.

source: To extract the required ssl, you must start up a Docker container in the background, and attach to that container to copy the artifacts.
pt_br: Para extrair o ssl necessário, você deve iniciar um contêiner Docker em segundo plano e anexar a esse contêiner para copiar os artefatos.

source: First, let's start the GraalVM container, noting the container id output.
pt_br: Primeiro, vamos iniciar o contêiner GraalVM, observando a saída do id do contêiner.

source: First, `libsunec.so`, the C library used for the SSL implementation:
pt_br: Em primeiro lugar, `libsunec.so`, a biblioteca C utilizada para a implementação do SSL:

source: Second, `cacerts`, the certificate store. You may need to periodically obtain an updated copy, also.
pt_br: Em segundo lugar, `cacerts`, o repositório de certificados. Poderá também ser necessário obter periodicamente uma cópia atualizada.

source: Your final archive will look like this:
pt_br: O seu arquivo final terá o seguinte formato:

source: Deploy to AWS Lambda using a Container Image
pt_br: Implantar no AWS Lambda usando uma imagem de contêiner

source: AWS Lambda supports creating your lambdas by referencing https://docs.aws.amazon.com/lambda/latest/dg/lambda-images.html[container images] rather than uploading ZIP files. This can have some benefits such as bypassing the size limit of the uploaded ZIP files. You can define lambda functions for both native builds and regular JVM builds.
pt_br: O AWS Lambda suporta a criação dos seus lambdas referenciando link:https://docs.aws.amazon.com/lambda/latest/dg/lambda-images.html[imagens de contêineres] em vez de carregar arquivos ZIP. Isso pode ter alguns benefícios, como contornar o limite de tamanho dos arquivos ZIP carregados. É possível definir funções lambda tanto para compilações nativas quanto para compilações regulares da JVM.

source: JVM container image
pt_br: Imagem do contêiner JVM

source: For a regular JVM distribution you need to base your image off the official AWS Java base images. Below is an example of a Dockerfile that would create a container image from your Quarkus Lambda project. It assumes that `mvn package` has been executed and binaries are available in the `target/` directory:
pt_br: Para uma distribuição regular da JVM, é necessário basear sua imagem nas imagens base oficiais do AWS Java. Abaixo está um exemplo de um Dockerfile que criaria uma imagem de contêiner a partir do seu projeto Quarkus Lambda. Ele assume que `mvn package` foi executado e que os binários estão disponíveis no diretório `target/`:

source: Native executable container image
pt_br: Imagem de contêiner com executável nativo

source: To create a lambda container image that uses the native executable we'll need to do things a little differently. In this case, we won't need to use the `java:11` base image from AWS, but instead we'll use a special image that assumes that the runtime environment for the lambda is provided. The example below creates such a container. It assumes that a Maven build has been executed (such as `mvn package -Dnative=true`) and has generated the native binary into the `target/` directory. The binary needs to be named `bootstrap` and be placed in `/var/runtime/`:
pt_br: Para criar uma imagem de contêiner lambda que use o executável nativo, precisaremos fazer as coisas de forma um pouco diferente. Nesse caso, não precisaremos usar a imagem base `java:11` da AWS, mas, em vez disso, usaremos uma imagem especial que assume que o ambiente runtime para o lambda é fornecido. O exemplo abaixo cria esse contêiner. Ele assume que uma compilação Maven foi executada (como `mvn package -Dnative=true`) e gerou o binário nativo no diretório `target/`. O binário precisa ser nomeado `bootstrap` e ser colocado em `/var/runtime/`:

source: Deploying a container image lambda
pt_br: Implementar uma imagem de contêiner lambda

source: Below, you can see how the container images created above can be built and deployed to AWS using the `docker` and `aws` command line tools. These instructions work for both native and jvm container images and assume that the `aws` command line tool has been logged in.
pt_br: Abaixo, você pode ver como as imagens de contêiner criadas acima podem ser criadas e implantadas na AWS usando as ferramentas de linha de comando `docker` e `aws`. Essas instruções funcionam para imagens de contêineres nativas e jvm e pressupõem que a ferramenta de linha de comando `aws` tenha sido conectada.

source: Build the Docker image
pt_br: Criar a imagem do Docker

source: Create an ECR repository in the users AWS account
pt_br: Criar um repositório ECR na conta AWS do usuário

source: Tag the image using your ECR registry information
pt_br: Marque a imagem utilizando as suas informações de registro ECR

source: Log Docker into your ECR registry and push the Docker image to it
pt_br: Registar o Docker no seu registo ECR e enviar a imagem Docker para o mesmo

source: Create the AWS lambda function with the AWS CLI tool
pt_br: Criar a função lambda da AWS com a ferramenta CLI do AWS

source: Make sure you reference the image you uploaded previously (assumes that a role exists that can be used to run the lambda). Please note that it is not unlikely that for the JVM lambda function, the default memory limit of `128Mb` will not be enough to run the function. In that case, you can increase the memory limit when creating the function by providing the `--memory-size 256` parameter to your `aws lambda create-function` command. You can also adjust the function in the AWS console after you've created it.
pt_br: Certifique-se de que faz referência à imagem que carregou anteriormente (pressupõe que existe uma função que pode ser utilizada para executar o lambda). Observe que não é improvável que, para a função lambda da JVM, o limite de memória padrão de `128Mb` não seja suficiente para executar a mesma. Nesse caso, pode aumentar o limite de memória ao criar a função, fornecendo o parâmetro `--memory-size 256` ao seu comando `aws lambda create-function`. Também pode ajustar a função no console AWS depois de a ter criado.

source: Now you can use the AWS console to view and test your new lambda function.
pt_br: Agora pode utilizar o console AWS para ver e testar a sua nova função lambda.

source: Amazon Alexa Integration
pt_br: Integração com o Amazon Alexa

source: To use Alexa with Quarkus native, you need to use the https://github.com/quarkiverse/quarkus-amazon-alexa[Quarkus Amazon Alexa extension hosted at the Quarkiverse Hub].
pt_br: Para utilizar a Alexa com o Quarkus nativo, é necessário utilizar a link:https://github.com/quarkiverse/quarkus-amazon-alexa[extensão Quarkus Amazon Alexa do Quarkiverse Hub].

source: Define the latest version of the extension in your POM file.
pt_br: Defina a versão mais recente da extensão no seu arquivo POM.

source: Create your Alexa handler, as normal, by sub-classing the abstract `com.amazon.ask.SkillStreamHandler`, and add your request handler implementation.
pt_br: Crie o seu manipulador Alexa, como habitualmente, sub-classificando o abstrato `com.amazon.ask.SkillStreamHandler`, e adicione a implementação do seu manipulador de pedidos.

source: That's all there is to it!
pt_br: É tudo o que há para fazer!

source: To optimize your application for Lambda SnapStart, check xref:aws-lambda-snapstart.adoc[the SnapStart Configuration Documentation].
pt_br: Para otimizar a sua aplicação para o Lambda SnapStart, consulte a link:amazon-snapstart.html[documentação de configuração do SnapStart].
