Repository: quarkusio/pt.quarkus.io
Catalog: l10n/po/*/_guides/aws-lambda-snapstart.adoc.po
Languages: pt

source: AWS Lambda SnapStart Configuration
pt: Configuração do AWS Lambda SnapStart

source: https://docs.aws.amazon.com/lambda/latest/dg/snapstart.html[SnapStart] is a snapshotting and restore mechanism reducing drastically the cold startup time of Java functions on AWS. This document explains the various settings you can use to leverage this feature. It is not a reference documentation on SnapStart, and it will not cover how SnapStart works in details.
pt: link:https://docs.aws.amazon.com/lambda/latest/dg/snapstart.html[O SnapStart] é um mecanismo de _snapshotting_ e restauração que reduz drasticamente o tempo de inicialização a frio das funções Java na AWS. Este documento explica as várias configurações que podem ser usadas para aproveitar esse recurso. Não se trata de uma documentação de referência sobre o SnapStart e não abordará como o SnapStart funciona em detalhes.

source: This feature is only available on AWS Lambda, and not in all regions. Please check the AWS documentation to verify the eligibility of your AWS region.
pt: Esta funcionalidade só está disponível na AWS Lambda e não em todas as regiões. Consulte a documentação da AWS para verificar a elegibilidade da sua região da AWS.

source: Enabling / Disabling SnapStart Optimizations
pt: Ativar / Desativar as otimizações do SnapStart

source: If you use the Quarkus AWS Lambda extension, SnapStart optimizations are automatically enabled. However, you can enable/disable it explicitly using:
pt: Se você utilizar a extensão Quarkus AWS Lambda, as otimizações do SnapStart são automaticamente ativadas. No entanto, você pode ativar/desativar explicitamente utilizando:

source: It does not enable/disable SnapStart for your function, only the Quarkus optimizations.
pt: Isso não ativa/desactiva o SnapStart para a sua função, apenas as otimizações do Quarkus.

source: Class Preloading
pt: Pré-carregamento de classes

source: Classloading has a huge impact on your function execution time. This optimization allows preloading classes during the snapshotting process of SnapStart.
pt: O _classloading_ tem um enorme impacto no tempo de execução da sua função. Esta otimização permite pré-carregar classes durante o processo de _snapshotting_ do SnapStart.

source: The classes to preload are listed in two places:
pt: As classes que serão pré-carregadas estão listadas em dois lugares:

source: extensions can produce a list of classes (using the `io.quarkus.deployment.builditem.PreloadClassBuildItem` build item)
pt: as extensões podem produzir uma lista de classes (utilizando o item de compilação `io.quarkus.deployment.builditem.PreloadClassBuildItem` )

source: you can add a `src/main/resources/META-INF/quarkus-preload-classes.txt` file listing the classes to preload, such as:
pt: você pode adicionar um arquivo `src/main/resources/META-INF/quarkus-preload-classes.txt` que enumere as classes que serão pré-carregadas, como por exemplo:

source: The format is simple: one class per line.
pt: O formato é simples: uma classe por linha.

source: Computing the class list
pt: Calculando a lista de classes

source: That step is particularly not user-friendly. We plan to improve it.
pt: Esta etapa é particularmente não é tão fácil de usar. Iremos melhorar este processo em um futuro próximo.

source: To compute the list of classes, we recommend deploying your function and setting the `JAVA_TOOL_OPTIONS` environment variable to `-verbose:class`. Then execute your function and retrieve the log (in CloudWatch). You should be able to extract the class names using sed/awk or any text editor.
pt: Para calcular a lista de classes, recomendamos fazer o _deploy_ da sua função e definir a variável de ambiente JAVA_TOOL_OPTIONS como -verbose:class. Em seguida, execute sua função e recupere o registro (no CloudWatch). Você deverá ser capaz de extrair os nomes das classes usando o sed/awk ou qualquer editor de texto.

source: Application class list
pt: Lista de classes da aplicação

source: By default, Quarkus generates the class list of the classes included in your application (including the classes generated by Quarkus). So, you do not have to repeat them in the `quarkus-preload-classes.txt` file.
pt: Por padrão, o Quarkus gera a lista de classes das classes incluídas na sua aplicação (incluindo as classes geradas pelo Quarkus). Assim, você não precisa repeti-las no arquivo `quarkus-preload-classes.txt`.

source: You can disable this feature using:
pt: Você pode desativar esta funcionalidade utilizando:

source: Disable preloading
pt: Desativar o pré-carregamento

source: You can disable the preloading of classes using:
pt: Você pode desativar o pré-carregamento de classes utilizando:

source: Skipping class initialization
pt: Pulando a inicialização da classe

source: By default, when the classes are preloaded, they are also _initialized_, meaning it also resolves the dependent classes. You can disable this behavior using:
pt: Por padrão, quando as classes são pré-carregadas, elas também são _inicializadas_, o que significa que também resolve as classes dependentes. É possível desativar este comportamento utilizando:

source: Client Priming
pt: Preparando o client

source: Client _priming_ is a technique that allows initializing a client during the snapshotting process, so it's already fully functional during the application runtime.
pt: Client _priming_ é uma técnica que permite inicializar um client durante o processo de _snapshotting,_ para que já esteja totalmente funcional durante o tempo de execução da aplicação.

source: There are two ways to achieve _priming_:
pt: Existem duas formas de obter _priming_:

source: initialize the client in a `static` block, which, thanks to class preloading will be executed before the snapshot
pt: inicializar o client num bloco `static`, que, graças ao pré-carregamento da classe, será executado antes do snapshot

source: register a CRaC Resource doing the initialization
pt: registar um recurso CRaC que efetua a inicialização

source: can be achieved as follows:
pt: pode ser alcançado da seguinte forma:

source: Implementing priming using a static block may prevent the native compilation of your application. Client initialization may start threads or open connections which are not compatible with the native compilation if the class is initialized at build time.
pt: Implementar o priming usando um bloco estático pode impedir a compilação nativa da sua aplicação. A inicialização do client pode iniciar threads ou abrir conexões que não são compatíveis com a compilação nativa se a classe for inicializada no momento da compilação.

source: The next section covers (2).
pt: A próxima seção aborda o tópico(2).

source: Resource registration
pt: Registo de recursos

source: SnapStart uses the CRaC API to allow the application to execute custom code before the snapshotting or during the restoration.
pt: O SnapStart utiliza a API CRaC para permitir que a aplicação execute código personalizado antes do _snapshotting_ ou durante a restauração.

source: While it's the CRaC API, SnapStart is not CRaC and can do _things_ that would not work with others CRaC implementations.
pt: Embora seja a API CRaC, o SnapStart não é CRaC e pode fazer _coisas_ que não funcionariam com outras implementações CRaC.

source: Restoration is limited to 2 seconds.
pt: A restauração é limitada a 2 segundos.

source: TieredCompilation
pt: Compilação em camadas

source: It is also recommended to use _tiered compilation_ when using SnapStart. To achieve this, set the `JAVA_TOOL_OPTIONS` environment property to `-XX:+TieredCompilation -XX:TieredStopAtLevel=1`.
pt: Também é recomendável usar _tiered compilation_ ao usar o SnapStart. Para isso, defina a propriedade de ambiente `JAVA_TOOL_OPTIONS` como `-XX:+TieredCompilation -XX:TieredStopAtLevel=1`.

source: `TieredCompilation` can also be interesting for regular Lambda functions.
pt: `TieredCompilation` também pode ser interessante para funções Lambda regulares.
