Repository: quarkusio/pt.quarkus.io
Catalog: l10n/po/*/_guides/aws-lambda.adoc.po
Languages: pt_br

source: The `quarkus-amazon-lambda` extension allows you to use Quarkus to build your AWS Lambdas. Your lambdas can use injection annotations from CDI or Spring and other Quarkus facilities as you need them.
pt_br: A extensão `quarkus-amazon-lambda` permite que você use o Quarkus para criar seus Lambdas da AWS. Seus lambdas podem usar anotações de injeção do CDI ou do Spring e outros recursos do Quarkus, conforme a necessidade.

source: Quarkus lambdas can be deployed using the Amazon Java Runtime, or you can build a native executable and use Amazon's Custom Runtime if you want a smaller memory footprint and faster cold boot startup time.
pt_br: Os lambdas do Quarkus podem ser implantados usando o runtime Java do AWS Lambda, ou você pode criar um executável nativo e usar o runtime personalizado da Amazon, se quiser um espaço de memória menor e um tempo de inicialização mais rápido no cold boot.

source: Quarkus's integration with lambdas also supports Quarkus's Live Coding development cycle. You can bring up your Quarkus lambda project in dev or test mode and code on your project live.
pt_br: A integração do Quarkus com lambdas também suporta o ciclo de desenvolvimento Quarkus's Live Coding. Você pode abrir seu projeto lambda do Quarkus no modo de desenvolvimento ou teste e codificar seu projeto ao vivo.

source: Prerequisites
pt_br: Pré-requisitos

source: https://aws.amazon.com[An Amazon AWS account]
pt_br: link:https://aws.amazon.com[Uma conta Amazon AWS]

source: https://docs.aws.amazon.com/cli/latest/userguide/cli-chap-install.html[AWS CLI]
pt_br: link:https://docs.aws.amazon.com/cli/latest/userguide/cli-chap-install.html[CLI da AWS]

source: https://docs.aws.amazon.com/serverless-application-model/latest/developerguide/serverless-sam-cli-install.html[AWS SAM CLI], for local testing
pt_br: link:https://docs.aws.amazon.com/serverless-application-model/latest/developerguide/serverless-sam-cli-install.html[AWS SAM CLI], para testes locais

source: For Gradle projects please xref:gradle[see below], or for further reference consult the guide in the xref:gradle-tooling.adoc[Gradle setup page].
pt_br: Para projetos Gradle link:#gradle[veja abaixo], ou para mais referências consulte o guia na link:gradle-tooling.html[página de configuração do Gradle].

source: Getting Started
pt_br: Como começar

source: This guide walks you through generating an example Java project via a maven archetype and deploying it to AWS.
pt_br: Este guia orienta-o na geração de um projeto Java de exemplo através de um arquétipo maven e na sua implementação na AWS.

source: Installing AWS bits
pt_br: Instalação de bits da AWS

source: Installing all the AWS bits is probably the most difficult thing about this guide. Make sure that you follow all the steps for installing AWS CLI.
pt_br: A instalação de todos os bits da AWS é provavelmente a parte mais difícil deste guia. Certifique-se de seguir todas as etapas para instalar a AWS CLI.

source: Creating the Maven Deployment Project
pt_br: Criar o projeto de implementação Maven

source: Create the Quarkus AWS Lambda maven project using our Maven Archetype.
pt_br: Crie o projeto maven do Quarkus AWS Lambda utilizando o nosso Arquétipo Maven.

source: If you prefer to use Gradle, you can quickly and easily generate a Gradle project via https://code.quarkus.io/[code.quarkus.io] adding the `quarkus-amazon-lambda` extension as a dependency.
pt_br: Se preferir usar o Gradle, você pode gerar um projeto Gradle de forma rápida e fácil em link:https://code.quarkus.io/[code.quarkus.io] , adicionando a extensão `quarkus-amazon-lambda` como uma dependência.

source: Copy the build.gradle, gradle.properties and settings.gradle into the above-generated Maven archetype project, to follow along with this guide.
pt_br: Copie o build.gradle, gradle.properties e settings.gradle para o projeto de arquétipo Maven gerado acima, para seguir este guia.

source: Execute: gradle wrapper to set up the gradle wrapper (recommended).
pt_br: Execute: gradle wrapper para configurar o gradle wrapper (recomendado).

source: For full Gradle details, see the xref:gradle[Gradle build] section below.
pt_br: Para obter detalhes completos sobre o Gradle, consulte a secção de xref:#gradle[construção do Gradle] abaixo.

source: Choose Your Lambda
pt_br: Escolha o seu Lambda

source: The `quarkus-amazon-lambda` extension scans your project for a class that directly implements the Amazon `RequestHandler<?, ?>` or `RequestStreamHandler` interface. It must find a class in your project that implements this interface, or it will throw a build time failure. If it finds more than one handler class, a build time exception will also be thrown.
pt_br: A extensão `quarkus-amazon-lambda` verifica seu projeto em busca de uma classe que implemente diretamente a interface Amazon `RequestHandler<?, ?>` ou `RequestStreamHandler`. Ela deve encontrar uma classe em seu projeto que implemente essa interface, caso contrário, lançará uma falha no tempo de compilação. Se encontrar mais de uma classe de manipulador, uma exceção de tempo de compilação também será lançada.

source: Sometimes, though, you might have a few related lambdas that share code and creating multiple maven modules is just an overhead you don't want to do. The `quarkus-amazon-lambda` extension allows you to bundle multiple lambdas in one project and use configuration or an environment variable to pick the handler you want to deploy.
pt_br: Às vezes, porém, você pode ter alguns lambdas relacionados que compartilham código e a criação de vários módulos maven é apenas uma sobrecarga que não se deseja fazer. A extensão `quarkus-amazon-lambda` permite agrupar vários lambdas em um projeto e usar a configuração ou uma variável de ambiente para escolher o manipulador que deseja implantar.

source: The generated project has three lambdas within it. Two that implement the `RequestHandler<?, ?>` interface, and one that implements the `RequestStreamHandler` interface. One that is used and two that are unused. If you open up `src/main/resources/application.properties` you'll see this:
pt_br: O projeto gerado tem três lambdas dentro dele. Dois que implementam a interface `RequestHandler<?, ?>` e um que implementa a interface `RequestStreamHandler`. Um que é usado e dois que não são usados. Se você abrir o arquivo `src/main/resources/application.properties` , verá o seguinte:

source: The `quarkus.lambda.handler` property tells Quarkus which lambda handler to deploy. This can be overridden with an environment variable too.
pt_br: A propriedade `quarkus.lambda.handler` informa ao Quarkus qual manipulador de lambda deve ser implantado. Isso também pode ser substituído por uma variável de ambiente.

source: If you look at the three generated handler classes in the project, you'll see that they are `@Named` differently.
pt_br: Se olhar para as três classes de manipuladores geradas no projeto, verá que são `@Named` diferentes.

source: The CDI name of the handler class must match the value specified within the `quarkus.lambda.handler` property.
pt_br: O nome CDI da classe do manipulador deve corresponder ao valor especificado na propriedade `quarkus.lambda.handler`.

source: Deploy to AWS Lambda Java Runtime
pt_br: Implantar no runtime Java da AWS Lambda

source: There are a few steps to get your lambda running on AWS. The generated maven project contains a helpful script to create, update, delete, and invoke your lambdas for pure Java and native deployments.
pt_br: Há algumas etapas para que seu lambda seja executado na AWS. O projeto maven gerado contém um script útil para criar, atualizar, excluir e invocar seus lambdas para implantações puramente Java e nativas.

source: Build and Deploy
pt_br: Construir e implementar

source: Build the project:
pt_br: Construir o projeto:

source: This will compile and package your code.
pt_br: Isto irá compilar e empacotar o seu código.

source: Create an Execution Role
pt_br: Criar uma função de execução

source: View the https://docs.aws.amazon.com/lambda/latest/dg/gettingstarted-awscli.html[Getting Started Guide] for deploying a lambda with AWS CLI. Specifically, make sure you have created an `Execution Role`. You will need to define a `LAMBDA_ROLE_ARN` environment variable in your profile or console window, Alternatively, you can edit the `manage.sh` script that is generated by the build and put the role value directly there:
pt_br: Consulte o link:https://docs.aws.amazon.com/lambda/latest/dg/gettingstarted-awscli.html[Guia de Introdução] para implantar um lambda com a AWS CLI. Especificamente, certifique-se de ter criado um `Execution Role`. Será necessário definir uma variável de ambiente `LAMBDA_ROLE_ARN` no seu perfil ou na janela do console. Como alternativa, você pode editar o script `manage.sh` gerado pela compilação e colocar o valor da função diretamente lá:

source: Extra Build Generated Files
pt_br: Arquivos extras gerados pela compilação

source: After you run the build, there are a few extra files generated by the `quarkus-amazon-lambda` extension. These files are in the build directory: `target/` for maven, `build/` for gradle.
pt_br: Depois você executa a compilação, há alguns arquivos extras gerados pela extensão `quarkus-amazon-lambda`. Esses arquivos estão no diretório de compilação: `target/` para maven, `build/` para gradle.

source: `function.zip` - lambda deployment file
pt_br: `function.zip` - arquivo de implementação do lambda

source: `manage.sh` - wrapper around aws lambda cli calls
pt_br: `manage.sh` - script para chamadas do lambda através da AWS CLI

source: `bootstrap-example.sh` - example bootstrap script for native deployments
pt_br: `bootstrap-example.sh` - exemplo de script de inicialização para implementações nativas

source: `sam.jvm.yaml` - (optional) for use with sam cli and local testing
pt_br: `sam.jvm.yaml` - (opcional) para utilização com SAM CLI e testes locais

source: `sam.native.yaml` - (optional) for use with sam cli and native local testing
pt_br: `sam.native.yaml` - (opcional) para utilização com SAM CLI e testes locais nativos

source: Create the function
pt_br: Criar a função

source: The `target/manage.sh` script is for managing your lambda using the AWS Lambda Java runtime. This script is provided only for your convenience. Examine the output of the `manage.sh` script if you want to learn what aws commands are executed to create, delete, and update your lambdas.
pt_br: O script `target/manage.sh` serve para gerenciar seu lambda usando o tempo de execução Java do AWS Lambda. Esse script é fornecido apenas para sua conveniência. Examine a saída do script `manage.sh` se quiser saber quais comandos do AWS são executados para criar, excluir e atualizar seus lambdas.

source: `manage.sh` supports four operation: `create`, `delete`, `update`, and `invoke`.
pt_br: `manage.sh` suporta quatro operações: `create` , `delete` , `update` , e `invoke`.

source: To verify your setup, that you have the AWS CLI installed, executed aws configure for the AWS access keys, and set up the `LAMBDA_ROLE_ARN` environment variable (as described above), please execute `manage.sh` without any parameters. A usage statement will be printed to guide you accordingly.
pt_br: Para verificar a configuração, se você tem a AWS CLI instalada, se executou o aws configure para as chaves de acesso da AWS, e configurou a variável de ambiente `LAMBDA_ROLE_ARN` (conforme descrito acima), execute `manage.sh` sem nenhum parâmetro. Uma declaração de uso será impressa para orientá-lo adequadamente.

source: If using Gradle, the path to the binaries in the `manage.sh` must be changed from `target` to `build`
pt_br: Se estiver utilizando o Gradle, o caminho para os binários em `manage.sh` deve ser alterado de `target` para `build`

source: To see the `usage` statement, and validate AWS configuration:
pt_br: Para ver a declaração `usage` e validar a configuração da AWS:

source: You can `create` your function using the following command:
pt_br: Pode `create` a sua função utilizando o seguinte comando:

source: or if you do not have `LAMBDA_ROLE_ARN` already defined in this shell:
pt_br: ou se não tiver `LAMBDA_ROLE_ARN` já definido neste shell:

source: Do not change the handler switch. This must be hardcoded to `io.quarkus.amazon.lambda.runtime.QuarkusStreamHandler::handleRequest`. This handler bootstraps Quarkus and wraps your actual handler so that injection can be performed.
pt_br: Não altere a chave do manipulador. Isso deve ser codificado para `io.quarkus.amazon.lambda.runtime.QuarkusStreamHandler::handleRequest`. Esse manipulador inicializa o Quarkus e envolve o seu manipulador real para que a injeção possa ser executada.

source: If there are any problems creating the function, you must delete it with the `delete` function before re-running the `create` command.
pt_br: Se houver algum problema na criação da função, você deverá excluí-la com a função `delete` antes de executar novamente o comando `create`.

source: Commands may also be stacked:
pt_br: Os comandos também podem ser empilhados:

source: Invoke the Lambda
pt_br: Invocar o Lambda

source: Use the `invoke` command to invoke your function.
pt_br: Utilize o comando `invoke` para invocar a sua função.

source: The example lambda takes input passed in via the `--payload` switch which points to a json file in the root directory of the project.
pt_br: O exemplo de lambda recebe a entrada passada por meio da opção `--payload` que aponta para um arquivo json no diretório raiz do projeto.

source: The lambda can also be invoked locally with the SAM CLI like this:
pt_br: O lambda também pode ser invocado localmente com o SAM CLI da seguinte forma:

source: If you are working with your native image build, simply replace the template name with the native version:
pt_br: Se estiver a trabalhar com a sua compilação de imagem nativa, basta substituir o nome do modelo pela versão nativa:

source: Update the Lambda
pt_br: Atualizar o Lambda

source: You can update the Java code as you see fit. Once you've rebuilt, you can redeploy your lambda by executing the `update` command.
pt_br: Você pode atualizar o código Java conforme achar necessário. Após a reconstrução, você pode reimplantar o lambda executando o comando `update`.

source: Deploy to AWS Lambda Custom (native) Runtime
pt_br: Implantar no runtime personalizado (nativo) do AWS Lambda

source: If you want a lower memory footprint and faster initialization times for your lambda, you can compile your Java code to a native executable. Just make sure to rebuild your project with the `-Dnative` switch.
pt_br: Se quiser um espaço de memória menor e tempos de inicialização mais rápidos para seu lambda, você compilar o código Java em um executável nativo. Apenas certifique-se de reconstruir seu projeto com a opção `-Dnative`.

source: For Linux hosts, execute:
pt_br: Para sistemas Linux, execute:

source: If you are building on a non-Linux system, you will need to also pass in a property instructing Quarkus to use a docker build as Amazon Lambda requires linux binaries. You can do this by passing this property to your build: `-Dquarkus.native.container-build=true`. This requires you to have Docker installed locally, however.
pt_br: Se estiver construindo em um sistema que não seja Linux, também precisará passar uma propriedade instruindo o Quarkus a usar uma construção do docker, pois o Amazon Lambda exige binários Linux. Você pode fazer isso passando esta propriedade para sua compilação: `-Dquarkus.native.container-build=true`. No entanto, isso exige que o Docker esteja instalado localmente.

source: Either of these commands will compile and create a native executable image. It also generates a zip file `target/function.zip`. This zip file contains your native executable image renamed to `bootstrap`. This is a requirement of the AWS Lambda Custom (Provided) Runtime.
pt_br: Qualquer um desses comandos compilará e criará uma imagem executável nativa. Ele também gera um arquivo zip `target/function.zip`. Esse arquivo zip contém sua imagem executável nativa renomeada para `bootstrap`. Esse é um requisito do runtime personalizado (fornecido) do AWS Lambda.

source: The instructions here are exactly as above with one change: you'll need to add `native` as the first parameter to the `manage.sh` script:
pt_br: As instruções aqui são exatamente como acima, com uma alteração: você precisará adicionar `native` como o primeiro parâmetro do script `manage.sh`:

source: As above, commands can be stacked. The only requirement is that `native` be the first parameter should you wish to work with native image builds. The script will take care of the rest of the details necessary to manage your native image function deployments.
pt_br: Como acima, os comandos podem ser empilhados. A única exigência é que `native` seja o primeiro parâmetro, caso deseje trabalhar com compilações de imagens nativas. O script cuidará dos detalhes necessários para gerenciar suas implementações de funções de imagem nativa.

source: Examine the output of the `manage.sh` script if you want to learn what aws commands are executed to create, delete, and update your lambdas.
pt_br: Examine a saída do script `manage.sh` se quiser saber quais comandos da aws são executados para criar, excluir e atualizar seus lambdas.

source: One thing to note about the create command for native is that the `aws lambda create-function` call must set a specific environment variable:
pt_br: Um aspecto a ser observado sobre o comando create para nativo é que a chamada `aws lambda create-function` deve definir uma variável de ambiente específica:

source: Examine the POM and Gradle build
pt_br: Examinar o POM e a compilação do Gradle

source: There is nothing special about the POM other than the inclusion of the `quarkus-amazon-lambda` extension as a dependency. The extension automatically generates everything you might need for your lambda deployment.
pt_br: Não há nada de especial no POM além da inclusão da extensão `quarkus-amazon-lambda` como uma dependência. A extensão gera automaticamente tudo o que pode precisar para a implantação do lambda.

source: In previous versions of this extension, you had to set up your pom or gradle to zip up your executable for native deployments, but this is not the case anymore.
pt_br: Nas versões anteriores dessa extensão, era necessário configurar o pom ou gradle para compactar o executável para implantações nativas, mas esse não é mais o caso.

source: Gradle build
pt_br: Construção Gradle

source: Similarly, for Gradle projects, you also just have to add the `quarkus-amazon-lambda` dependency. The extension automatically generates everything you might need for your lambda deployment.
pt_br: Da mesma forma, para projetos Gradle, você também só precisa adicionar a dependência `quarkus-amazon-lambda`. A extensão gera automaticamente tudo o que pode precisar para a implantação do lambda.

source: Example Gradle dependencies:
pt_br: Exemplo de dependências do Gradle:

source: Live Coding and Unit/Integration Testing
pt_br: Live Coding e testes unitários/integração

source: To mirror the AWS Lambda environment as closely as possible in a dev environment, the Quarkus AWS Lambda extension boots up a mock AWS Lambda event server in Quarkus Dev and Test mode. This mock event server simulates a true AWS Lambda environment.
pt_br: Para espelhar o ambiente do AWS Lambda o mais próximo possível em um ambiente de desenvolvimento, a extensão do Quarkus AWS Lambda inicializa um servidor de eventos simulado do AWS Lambda no modo de desenvolvimento e teste do Quarkus. Esse servidor de eventos simulado simula um verdadeiro ambiente do AWS Lambda.

source: While running in Quarkus Dev Mode, you can feed events to it by doing an HTTP POST to `http://localhost:8080`. The mock event server will receive the events and your lambda will be invoked. You can perform live coding on your lambda and changes will automatically be recompiled and available the next invocation you make. Here's an example:
pt_br: Durante a execução no modo de desenvolvimento do Quarkus, voê pode alimentar eventos para ele fazendo um HTTP POST para `http://localhost:8080`. O servidor de eventos simulado receberá os eventos e seu lambda será chamado. Você pode executar a codificação ao vivo no seu lambda e as alterações serão automaticamente recompiladas e estarão disponíveis na próxima invocação que fizer. Veja um exemplo:

source: For your unit tests, you can also invoke on the mock event server using any HTTP client you want. Here's an example using rest-assured. Quarkus starts up a separate Mock Event server under port 8081. The default port for Rest Assured is automatically set to 8081 by Quarkus, so you can invoke on this endpoint.
pt_br: Para seus testes de unidade, você também pode invocar o servidor de eventos simulado usando qualquer cliente HTTP que desejar. Aqui está um exemplo usando o rest-assured. O Quarkus inicia um servidor de evento simulado separado na porta 8081. A porta padrão do Rest Assured é automaticamente definida como 8081 pelo Quarkus, portanto, pode invocar esse endpoint.

source: The mock event server is also started for `@QuarkusIntegrationTest` tests so will work with native binaries too. All this provides similar functionality to the SAM CLI local testing, without the overhead of Docker.
pt_br: O servidor de eventos simulado também é iniciado para os testes do `@QuarkusIntegrationTest` , portanto, também funcionará com binários nativos. Tudo isso oferece funcionalidade semelhante ao teste local da SAM CLI, sem a sobrecarga do Docker.

source: Finally, if port 8080 or port 8081 is not available on your computer, you can modify the dev and test mode ports with application.properties
pt_br: Por fim, se a porta 8080 ou a porta 8081 não estiver disponível em seu computador, você poderá modificar as portas dos modos dev e test com application.properties

source: A port value of zero will result in a randomly assigned port.
pt_br: Um valor de porta igual a zero resultará numa porta atribuída aleatoriamente.

source: To turn off the mock event server:
pt_br: Para desativar o servidor de eventos simulado:

source: Testing with the SAM CLI
pt_br: Testes com a SAM CLI

source: If you do not want to use the mock event server, you can test your lambdas with SAM CLI.
pt_br: Se não pretende utilizar o servidor de eventos simulado, pode testar os seus lambdas com o SAM CLI.

source: The https://docs.aws.amazon.com/serverless-application-model/latest/developerguide/serverless-sam-cli-install.html[AWS SAM CLI] allows you to run your lambdas locally on your laptop in a simulated Lambda environment. This requires https://www.docker.com/products/docker-desktop[docker] to be installed. This is an optional approach should you choose to take advantage of it. Otherwise, the Quarkus JUnit integration should be sufficient for most of your needs.
pt_br: O link:https://docs.aws.amazon.com/serverless-application-model/latest/developerguide/serverless-sam-cli-install.html[AWS SAM CLI] permite que execute seus lambdas localmente no seu laptop em um ambiente Lambda simulado. Isso requer a instalação do link:https://www.docker.com/products/docker-desktop[docker] . Essa é uma abordagem opcional, caso opte por aproveitá-la. Caso contrário, a integração do Quarkus JUnit deve ser suficiente para a maioria das suas necessidades.

source: A starter template has been generated for both JVM and native execution modes.
pt_br: Foi gerado um modelo inicial para os modos de execução JVM e nativo.
