Repository: quarkusio/pt.quarkus.io
Catalog: l10n/po/*/_guides/azure-functions-http.adoc.po
Languages: es

source: Azure Functions (Serverless) with RESTEasy Reactive, Undertow, or Reactive Routes
es: Azure Functions (Serverless) con RESTEasy Reactive, Undertow o Reactive Routes

source: The `quarkus-azure-functions-http` extension allows you to write microservices with RESTEasy Reactive (JAX-RS), Undertow (servlet), Reactive Routes, or xref:funqy-http.adoc[Funqy HTTP] and make these microservices deployable to the Azure Functions runtime.
es: La extensión `quarkus-azure-functions-http` permite escribir microservicios con RESTEasy Reactive (JAX-RS), Undertow (servlet), Reactive Routes o xref:funqy-http.html[Funqy HTTP] y hacer que estos microservicios se puedan desplegar en el tiempo de ejecución de Azure Functions.

source: One azure function deployment can represent any number of JAX-RS, servlet, Reactive Routes, or xref:funqy-http.adoc[Funqy HTTP] endpoints.
es: Un despliegue de funciones azure puede representar cualquier número de endpoints JAX-RS, servlet, Reactive Routes o xref:funqy-http.html[Funqy HTTP].

source: Only text based media types are supported at the moment as Azure Functions HTTP Trigger for Java does not support a binary format
es: Por el momento, sólo se admiten los tipos de medios basados en texto, ya que Azure Functions HTTP Trigger para Java no admite un formato binario

source: Prerequisites
es: Requisitos previos

source: https://azure.microsoft.com[An Azure Account]. Free accounts work.
es: https://azure.microsoft.com[Una cuenta de Azure]. Las cuentas gratuitas funcionan.

source: https://docs.microsoft.com/en-us/cli/azure/install-azure-cli[Azure CLI Installed]
es: https://docs.microsoft.com/en-us/cli/azure/install-azure-cli[Azure CLI instalado]

source: Solution
es: Solución

source: This guide walks you through running a Maven Archetype to generate a sample project that contains three http endpoints written with JAX-RS APIs, Servlet APIs, Reactive Routes, or xref:funqy-http.adoc[Funqy HTTP] APIs. After building, you will then be able to deploy to Azure.
es: Esta guía utiliza un arquetipo de Maven para generar un proyecto de ejemplo que contiene tres endpoints http escritos con APIs JAX-RS, APIs Servlet, Rutas Reactivas o APIs xref:funqy-http.html[Funqy HTTP]. Después de la construcción, usted será capaz de desplegar a Azure.

source: Creating the Maven Deployment Project
es: Creación del proyecto de implantación de Maven

source: Create the Azure Maven project for your Quarkus application using our Maven Archetype.
es: Cree el proyecto Azure Maven para su aplicación Quarkus utilizando nuestro arquetipo Maven.

source: Running this command will run maven in interactive mode and it will ask you to fill in some build properties:
es: Ejecutando este comando se ejecutará maven en modo interactivo y le pedirá que rellene algunas propiedades de construcción:

source: `groupId` - The maven groupId of this generated project. Type in `org.acme`.
es: `groupId` - El groupId de maven de este proyecto generado. Escriba en `org.acme`.

source: `artifactId` - The maven artifactId of this generated project. Type in `quarkus-demo`
es: `artifactId` - El artifactId de maven de este proyecto generado. Escriba en `quarkus-demo`

source: `version` - Version of this generated project.
es: `version` - Versión de este proyecto generado.

source: `package` - defaults to `groupId`
es: `package` - por defecto es `groupId`

source: `appName` - Use the default value. This is the application name in Azure. It must be a unique subdomain name under `*.azurewebsites.net`. Otherwise deploying to Azure will fail.
es: `appName` - Utilice el valor por defecto. Este es el nombre de la aplicación en Azure. Debe ser un nombre de subdominio único bajo `*.azurewebsites.net`. De lo contrario, el despliegue en Azure fallará.

source: `appRegion` - Defaults to `westus`. Dependent on your azure region.
es: `appRegion` - Por defecto, `westus`. Depende de su región azure.

source: `function` - Use the default which is `quarkus`. Name of your azure function. Can be anything you want.
es: `function` - Utilice el valor por defecto que es `quarkus`. Nombre de su función azure. Puede ser cualquier cosa que desee.

source: `resourceGroup` - Use the default value. Any value is fine though.
es: `resourceGroup` - Utilice el valor por defecto. Sin embargo, cualquier valor es válido.

source: The values above are defined as properties in the generated `pom.xml` file.
es: Los valores anteriores se definen como propiedades en el archivo `pom.xml` generado.

source: Login to Azure
es: Iniciar sesión en Azure

source: If you don't login to Azure you won't be able to deploy.
es: Si no inicias sesión en Azure no podrás desplegar.

source: Build and Deploy to Azure
es: Construir y desplegar en Azure

source: The `pom.xml` you generated in the previous step pulls in the `azure-functions-maven-plugin`. Running maven install generates config files and a staging directory required by the `azure-functions-maven-plugin`. Here's how to execute it.
es: El `pom.xml` que generó en el paso anterior usa el `azure-functions-maven-plugin`. Ejecutar maven install genera los archivos de configuración y un directorio de staging requeridos por el `azure-functions-maven-plugin`. Así es como se ejecuta.

source: If you haven't already created your function up at azure, the will build an uber-jar, package it, create the function at Azure, and deploy it.
es: Si aún no has creado tu función en Azure, el construirá un uber-jar, lo empaquetará, creará la función en Azure y la desplegará.

source: If deployment is a success, the azure plugin will tell you the base URL to access your function.
es: Si el despliegue es un éxito, el plugin de azure le dirá la URL base para acceder a su función.

source: The URL to access the service would be
es: La URL para acceder al servicio sería

source: Extension maven dependencies
es: Extensión de las dependencias de maven

source: The sample project includes the RESTEasy Reactive, Undertow, Reactive Routes, xref:funqy-http.adoc[Funqy HTTP] extensions. If you are only using one of those APIs (i.e. jax-rs only), respectively remove the maven dependency `quarkus-resteasy-reactive`, `quarkus-undertow`, `quarkus-funqy-http`, and/or `quarkus-reactive-routes`.
es: El proyecto de ejemplo incluye las extensiones RESTEasy Reactive, Undertow, Reactive Routes y xref:funqy-http.html[Funqy HTTP]. Si sólo utiliza una de esas APIs (es decir, sólo jax-rs), elimine respectivamente la dependencia de maven `quarkus-resteasy-reactive`, `quarkus-undertow`, `quarkus-funqy-http`, y/o `quarkus-reactive-routes`.

source: You must include the `quarkus-azure-functions-http` extension as this is a generic bridge between the Azure Functions runtime and the HTTP framework you are writing your microservices in.
es: Debes incluir la extensión `quarkus-azure-functions-http` ya que es un puente genérico entre el tiempo de ejecución de Azure Functions y el framework HTTP en el que estás escribiendo tus microservicios.

source: Azure Deployment Descriptors
es: Descriptores de despliegue de Azure

source: Templates for Azure Functions deployment descriptors (`host.json`, `function.json`) are within the `azure-config` directory. Edit them as you need to. Rerun the build when you are ready.
es: Las plantillas para los descriptores de despliegue de Azure Functions ( `host.json`, `function.json`) están dentro del directorio `azure-config`. Edítelos según sea necesario. Vuelva a ejecutar la compilación cuando esté listo.

source: *NOTE*: If you change the `function.json` `path` attribute or if you add a `routePrefix`, your jax-rs endpoints won't route correctly. See <<config-azure-paths>> for more information.
es: *NOTA*: Si cambia el atributo `function.json` `path` o si añade un `routePrefix`, sus endpoints jax-rs no se enrutarán correctamente. Consulte <<config-azure-paths>> para obtener más información.

source: Configuring Root Paths
es: Configuración de las rutas de acceso a la raíz

source: The default route prefix for an Azure Function is `/api`. All of your JAX-RS, Servlet, Reactive Routes, and xref:funqy-http.adoc[Funqy HTTP] endpoints must explicitly take this into account. In the generated project this is handled by the `quarkus.http.root-path` switch in `application.properties`
es: El prefijo de ruta por defecto para una Azure Function es `/api`. Todos tus puntos finales JAX-RS, Servlet, Rutas Reactivas y xref:funqy-http.html[Funqy HTTP] deben tenerlo en cuenta explícitamente. En el proyecto generado esto es manejado por el interruptor `quarkus.http.root-path` en `application.properties`

source: If you modify the `path` or add a `routePrefix` within the `azure-config/function.json` deployment descriptor, your code or configuration must also reflect any prefixes you specify for your path.
es: Si modifica el `path` o añade un `routePrefix` dentro del descriptor de despliegue `azure-config/function.json`, su código o configuración debe reflejar también cualquier prefijo que especifique para su ruta.
