Repository: quarkusio/pt.quarkus.io
Catalog: l10n/po/*/_guides/building-substrate-howto.adoc.po
Languages: es

source: Building a Custom SubstrateVM
es: Creación de una SubstrateVM personalizada

source: Prerequisites
es: Requisitos previos

source: Install JVMCI
es: Instalar JVMCI

source: Before anything can be done you must first install a JVMCI build.
es: Antes de que se pueda hacer nada, hay que instalar una compilación de JVMCI.

source: These can be downloaded from OTN http://www.oracle.com/technetwork/oracle-labs/program-languages/downloads/index.html[here]
es: Pueden descargarse de la OTN http://www.oracle.com/technetwork/oracle-labs/program-languages/downloads/index.html[aquí]

source: Note, if you are installing on an alternative system, you can use the developer tools on chrome or firefox to capture a direct URL with an auth param.
es: Nota, si está instalando en un sistema alternativo, puede utilizar las herramientas de desarrollador en chrome o firefox para capturar una URL directa con un parámetro de autenticidad.

source: After obtaining the download install it and set `JAVA_HOME`
es: Después de obtener la descarga, instálela y configure `JAVA_HOME`

source: NOTE
es: NOTA

source: Get the latest version available as graal tends to keep updating the minimum requirements.
es: Obtenga la última versión disponible, ya que graal tiende a seguir actualizando los requisitos mínimos.

source: Install MX
es: Instalar MX

source: Now you need to install Graal’s special build tool, `mx`.
es: Ahora tienes que instalar la herramienta de construcción especial de Graal, `mx`.

source: Checkout and build SubstrateVM
es: Comprobar y construir SubstrateVM

source: You can now check-out and build Substrate:
es: Ahora puede comprobar y construir Substrate:

source: Once built, you can quickly run the tools in place
es: Una vez construido, puede ejecutar rápidamente las herramientas en el lugar

source: Building a custom GraalVM distribution
es: Creación de una distribución de GraalVM personalizada

source: In order to create a custom GraalVM distribution (necessary for usage in quarkus) you must switch to the vm subdirectory, and use special build options to pick the modules in your distribution.
es: Para crear una distribución personalizada de GraalVM (necesaria para su uso en quarkus) debes cambiar al subdirectorio vm, y utilizar opciones especiales de construcción para elegir los módulos de tu distribución.

source: For a simple subset VM with just substrate and its native tools execute the following:
es: Para un subconjunto simple de VM con sólo el sustrato y sus herramientas nativas ejecute lo siguiente:

source: For a stock CE build the following will do:
es: Para una construcción de CE de serie, lo siguiente será suficiente:
