Repository: quarkusio/pt.quarkus.io
Catalog: l10n/po/*/_guides/cdi-integration.adoc.po
Languages: pt_br

source: CDI Integration Guide
pt_br: Guia de Integração CDI

source: The container is bootstrapped in multiple phases. From a high level perspective these phases go as follows:
pt_br: O contêiner é inicializado em várias fases. De uma perspectiva de alto nível, essas fases são as seguintes:

source: Initialization
pt_br: Inicialização

source: Bean discovery
pt_br: Descoberta do Bean

source: Registration of synthetic components
pt_br: Registo de componentes sintéticos

source: Validation
pt_br: Validação

source: In the _initialization_ phase the preparatory work is being carried out and custom contexts are registered. _Bean discovery_ is then the process where the container analyzes all application classes, identifies beans and wires them all together based on the provided metadata. Subsequently, the extensions can register _synthetic components_. Attributes of these components are fully controlled by the extensions, i.e. are not derived from an existing class. Finally, the _deployment is validated_. For example, the container validates every injection point in the application and fails the build if there is no bean that satisfies the given required type and qualifiers.
pt_br: Na fase de _inicialização_ , o trabalho preparatório está sendo realizado e os contextos personalizados são registrados. A _descoberta de beans_ é o processo em que o contêiner analisa todas as classes da aplicação, identifica os beans e os conecta com base nos metadados fornecidos. Posteriormente, as extensões podem registrar _componentes sintéticos_ . Os atributos desses componentes são totalmente controlados pelas extensões, ou seja, não são derivados de uma classe existente. Por fim, a _implementação é validada_ . Por exemplo, o contêiner valida cada ponto de injeção na aplicação e falha a construção se não houver nenhum bean que satisfaça o tipo e os qualificadores exigidos.

source: Quarkus build steps can produce and consume various build items and hook into each phase. In the following sections we will describe all the relevant build items and common scenarios.
pt_br: As etapas de construção do Quarkus podem produzir e consumir vários itens de construção e se conectar a cada fase. Nas seções a seguir, descreveremos todos os itens de construção relevantes e cenários comuns.

source: Metadata Sources
pt_br: Fontes de metadados

source: This way, extensions can turn classes, that would be otherwise ignored, into beans and vice versa. For example, a class that declares a `@Scheduled` method is always registered as a bean even if it is not annotated with a bean defining annotation and would be normally ignored.
pt_br: Dessa forma, as extensões podem transformar classes, que de outra forma seriam ignoradas, em beans e vice-versa. Por exemplo, uma classe que declara um método `@Scheduled` é sempre registrada como um bean, mesmo que não tenha sido anotada com uma anotação de definição de bean e, normalmente, seria ignorada.

source: Use Case - My Class Is Not Recognized as a Bean
pt_br: Caso de uso - Minha classe não é reconhecida como um Bean

source: _Reason 1_: Class Is Not discovered
pt_br: _Razão 1_: Classe Não Está Descoberta

source: _Solution_: Use the `AdditionalBeanBuildItem`. This build item can be used to specify one or more additional classes to be analyzed during the discovery. Additional bean classes are transparently added to the application index processed by the container.
pt_br: _Solução_ : Use o `AdditionalBeanBuildItem` . Esse item de construção pode ser usado para especificar uma ou mais classes adicionais a serem analisadas durante a descoberta. As classes de bean adicionais são adicionadas de forma transparente ao índice da aplicação processado pelo contêiner.

source: `AdditionalBeanBuildItem` Example
pt_br: Exemplo de `AdditionalBeanBuildItem`

source: `AdditionalBeanBuildItem.Builder` can be used for more complex use cases.
pt_br: `AdditionalBeanBuildItem.Builder` pode ser utilizado para casos de uso mais complexos.

source: It is aso possible to set the default scope via `AdditionalBeanBuildItem.Builder#setDefaultScope()`. The default scope is only used if there is no scope declared on the bean class.
pt_br: Também é possível definir o escopo padrão por meio de `AdditionalBeanBuildItem.Builder#setDefaultScope()` . O escopo padrão só é usado se não houver um escopo declarado na classe do bean.

source: If no default scope is specified the `@Dependent` pseudo-scope is used.
pt_br: Se não for especificado um escopo padrão, é utilizado o pseudo escopo `@Dependent`.

source: _Reason 2_: Class Is Discovered but Has No Bean Defining Annotation
pt_br: _Motivo 2_: A Classe É Descoberta mas Não Tem uma Anotação de Definição de Bean

source: _Solution 1_: Use the `AutoAddScopeBuildItem`. This build item can be used to add a scope to a class that meets certain conditions.
pt_br: _Solução 1_: Utilizar o `AutoAddScopeBuildItem`. Este item de construção pode ser utilizado para adicionar um escopo a uma classe que satisfaça determinadas condições.

source: `AutoAddScopeBuildItem` Example
pt_br: Exemplo de `AutoAddScopeBuildItem`

source: Find all classes annotated with `@Scheduled`.
pt_br: Encontrar todas as classes anotadas com `@Scheduled`.

source: Add `@Singleton` as default scope. Classes already annotated with a scope are skipped automatically.
pt_br: Adicione `@Singleton` como escopo padrão. As classes já anotadas com um escopo são ignoradas automaticamente.

source: _Solution 2_: If you need to process classes annotated with a specific annotation then it's possible to extend the set of bean defining annotations via the `BeanDefiningAnnotationBuildItem`.
pt_br: _Solução 2_: Se precisar processar classes anotadas com uma anotação específica, é possível estender o conjunto de anotações que definem beans através do `BeanDefiningAnnotationBuildItem`.

source: `BeanDefiningAnnotationBuildItem` Example
pt_br: Exemplo de `BeanDefiningAnnotationBuildItem`

source: Add `org.eclipse.microprofile.graphql.GraphQLApi` to the set of bean defining annotations.
pt_br: Adicionar `org.eclipse.microprofile.graphql.GraphQLApi` ao conjunto de anotações de definição de bean.

source: It is also possible to specify the default scope. The default scope is only used if there is no scope declared on the bean class.
pt_br: Também é possível especificar o escopo padrão. O escopo padrão é usado somente se não houver escopo declarado na classe do bean.

source: _Reason 3_: Class Was Discovered and Has a Bean Defining Annotation but Was Removed
pt_br: _Motivo 3_: A Classe Foi Descoberta e Tem uma Anotação que Define o Bean, mas Foi Removida

source: `UnremovableBeanBuildItem` Example
pt_br: Exemplo de `UnremovableBeanBuildItem`

source: Make all classes annotated with `@Startup` unremovable.
pt_br: Tornar todas as classes anotadas com `@Startup` não removíveis.

source: Use Case - My Annotation Is Not Recognized as a Qualifier or an Interceptor Binding
pt_br: Caso de uso - Minha Anotação não É Reconhecida Como Um Qualificador ou Uma Ligação de Interceptador

source: It is likely that the annotation class is not part of the application index. For example, classes from the _runtime module_ of a Quarkus extension are not indexed automatically.
pt_br: É provável que a classe de anotação não faça parte do índice da aplicação. Por exemplo, as classes do _módulo de tempo de execução_ de uma extensão do Quarkus não são indexadas automaticamente.

source: Use Case - I Need To Transform Annotation Metadata
pt_br: Caso de Utilização - Preciso Transformar Metadados de Anotações

source: Keep in mind that annotation transformers must be produced _before_ the bean discovery starts.
pt_br: Tenha em mente que os transformadores de anotação devem ser produzidos _antes_ do início da descoberta de bean.

source: Builder Example
pt_br: Exemplo de Builder

source: The transformer is only applied to classes.
pt_br: O transformador só é aplicado às classes.

source: Add the `@MyInterceptorBinding` annotation.
pt_br: Adicionar a anotação `@MyInterceptorBinding`.

source: The example above can be rewritten with an anonymous class:
pt_br: O exemplo acima pode ser reescrito com uma classe anônima:

source: `AnnotationsTransformerBuildItem` Example
pt_br: Exemplo de `AnnotationsTransformerBuildItem`

source: Build steps can query the transformed annotations for a given annotation target via the `TransformedAnnotationsBuildItem`.
pt_br: As etapas de construção podem consultar as anotações transformadas para um determinado alvo de anotação através do `TransformedAnnotationsBuildItem`.

source: `TransformedAnnotationsBuildItem` Example
pt_br: Exemplo de `TransformedAnnotationsBuildItem`

source: `TransformedAnnotationsBuildItem.getAnnotations()` will return a possibly transformed set of annotations.
pt_br: `TransformedAnnotationsBuildItem.getAnnotations()` devolverá um conjunto de anotações possivelmente transformadas.

source: How to Enable Trace Logging for Annotation Transformers
pt_br: Como Ativar o Log de Trace para Transformadores de Anotações

source: You can set the `TRACE` level for the category `io.quarkus.arc.processor` and try to analyze the log output afterwards.
pt_br: Pode definir o nível de `TRACE` para a categoria `io.quarkus.arc.processor` e tentar analisar a saída do log posteriormente.

source: `application.properties` Example
pt_br: Exemplo de `application.properties`

source: You also need to adjust the minimum log level for the relevant category.
pt_br: Também é necessário ajustar o nível mínimo de log para a categoria relevante.

source: Use Case - Inspect Beans, Observers and Injection Points
pt_br: Caso de Uso - Inspecionar Beans, Observadores e Pontos de Injeção

source: _Solution 1_: `BeanDiscoveryFinishedBuildItem`
pt_br: _Solução 1_: `BeanDiscoveryFinishedBuildItem`

source: Consumers of `BeanDiscoveryFinishedBuildItem` can easily inspect all class-based beans, observers and injection points registered in the application. However, synthetic beans and observers are _not included_ because this build item is produced _before_ the synthetic components are registered.
pt_br: Os consumidores do `BeanDiscoveryFinishedBuildItem` podem inspecionar facilmente todos os beans, observadores e pontos de injeção baseados em classe registrados na aplicação. No entanto, os beans e observadores sintéticos _não são incluídos_ porque esse item de construção é produzido _antes_ que os componentes sintéticos sejam registrados.

source: Additionally, the bean resolver returned from `BeanDiscoveryFinishedBuildItem#getBeanResolver()` can be used to apply the type-safe resolution rules, e.g. to find out whether there is a bean that would satisfy certain combination of required type and qualifiers.
pt_br: Além disso, o resolvedor de beans retornado por `BeanDiscoveryFinishedBuildItem#getBeanResolver()` pode ser utilizado para aplicar as regras de resolução de tipagem segura, por exemplo, para descobrir se existe um bean que satisfaça uma determinada combinação de tipo e qualificadores necessários.

source: `BeanDiscoveryFinishedBuildItem` Example
pt_br: Exemplo de `BeanDiscoveryFinishedBuildItem`

source: The resulting list will not contain `@Named` synthetic beans.
pt_br: A lista resultante não conterá beans sintéticos `@Named`.

source: _Solution 2_: `SynthesisFinishedBuildItem`
pt_br: _Solução 2_: `SynthesisFinishedBuildItem`

source: Consumers of `SynthesisFinishedBuildItem` can easily inspect all beans, observers and injection points registered in the application. Synthetic beans and observers are included because this build item is produced _after_ the synthetic components are registered.
pt_br: Os consumidores de `SynthesisFinishedBuildItem` podem inspecionar facilmente todos os beans, observadores e pontos de injeção registrados na aplicação. Os beans e observadores sintéticos estão incluídos porque este item de construção é produzido _depois_ dos componentes sintéticos serem registrados.

source: Additionally, the bean resolver returned from `SynthesisFinishedBuildItem#getBeanResolver()` can be used to apply the type-safe resolution rules, e.g. to find out whether there is a bean that would satisfy certain combination of required type and qualifiers.
pt_br: Além disso, o resolvedor de beans retornado por `SynthesisFinishedBuildItem#getBeanResolver()` pode ser utilizado para aplicar as regras de resolução de tipagem segura, por exemplo, para descobrir se existe um bean que satisfaça uma determinada combinação de tipo e qualificadores necessários.

source: `SynthesisFinishedBuildItem` Example
pt_br: Exemplo de `SynthesisFinishedBuildItem`

source: The resulting list will contain `@Named` synthetic beans.
pt_br: A lista resultante conterá beans sintéticos `@Named`.

source: Use Case - The Need for Synthetic Beans
pt_br: Caso de Uso - A Necessidade de Beans Sintéticos

source: _Solution_: If you need to register a synthetic bean then use the `SyntheticBeanBuildItem`.
pt_br: _Solução_: Se for necessário registrar um bean sintético, utilize o `SyntheticBeanBuildItem`.

source: `SyntheticBeanBuildItem` Example 1
pt_br: Exemplo 1 de `SyntheticBeanBuildItem`

source: Generate the bytecode of the `jakarta.enterprise.context.spi.Contextual#create(CreationalContext<T>)` implementation.
pt_br: Gerar o bytecode da implementação `jakarta.enterprise.context.spi.Contextual#create(CreationalContext<T>)`.

source: The output of a bean configurator is recorded as bytecode. Therefore, there are some limitations in how a synthetic bean instance is created at runtime. You can:
pt_br: A saída de um configurador de bean é gravada como bytecode. Portanto, há algumas limitações na forma como uma instância de bean sintético é criada em tempo de execução. Você pode:

source: Generate the bytecode of the `Contextual#create(CreationalContext<T>)` method directly via `ExtendedBeanConfigurator.creator(Consumer<MethodCreator>)`.
pt_br: Gerar o bytecode do método `Contextual#create(CreationalContext<T>)` diretamente através do `ExtendedBeanConfigurator.creator(Consumer<MethodCreator>)`.

source: Pass a subclass of `io.quarkus.arc.BeanCreator` via `ExtendedBeanConfigurator#creator(Class<? extends BeanCreator<U>>)`, and possibly specify some build-time parameters via `ExtendedBeanConfigurator#param()` and synthetic injection points via `ExtendedBeanConfigurator#addInjectionPoint()`.
pt_br: Passar uma subclasse de `io.quarkus.arc.BeanCreator` através do `ExtendedBeanConfigurator#creator(Class<? extends BeanCreator<U>>)`, e possivelmente especificar alguns parâmetros de tempo de construção através do `ExtendedBeanConfigurator#param()` e pontos de injeção sintéticos através do `ExtendedBeanConfigurator#addInjectionPoint()`.

source: `SyntheticBeanBuildItem` Example 2
pt_br: Exemplo 2 de `SyntheticBeanBuildItem`

source: By default, a synthetic bean is initialized during `STATIC_INIT`.
pt_br: Por padrão, um bean sintético é inicializado durante `STATIC_INIT`.

source: The bean instance is supplied by a value returned from a recorder method.
pt_br: A instância do bean é fornecida por um valor retornado por um método de gravação.

source: `RUNTIME_INIT` `SyntheticBeanBuildItem` Example
pt_br: Exemplo de `RUNTIME_INIT` `SyntheticBeanBuildItem`

source: The recorder must be executed in the `ExecutionTime.RUNTIME_INIT` phase.
pt_br: O gravador deve ser executado na fase `ExecutionTime.RUNTIME_INIT`.

source: The bean instance is initialized during `RUNTIME_INIT`.
pt_br: A instância do bean é inicializada durante `RUNTIME_INIT`.

source: Synthetic beans initialized during `RUNTIME_INIT` must not be accessed during `STATIC_INIT`. `RUNTIME_INIT` build steps that access a runtime-init synthetic bean should consume the `SyntheticBeansRuntimeInitBuildItem`:
pt_br: Os beans sintéticos inicializados durante `RUNTIME_INIT` não devem ser acessados durante `STATIC_INIT`. As etapas de construção de `RUNTIME_INIT` que acessam um bean sintético inicializado em tempo de execução devem consumir o `SyntheticBeansRuntimeInitBuildItem`:

source: This build step must be executed after `syntheticBean()` completes.
pt_br: Este passo de construção deve ser executado após a conclusão de `syntheticBean()`.

source: This recorder method results in an invocation upon the `Foo` bean instance and thus we need to make sure that the build step is executed after all synthetic beans are initialized.
pt_br: Este método de gravação resulta numa invocação da instância do bean `Foo` e, por isso, temos de nos certificar de que a etapa de construção é executada depois de todos os beans sintéticos serem inicializados.

source: It is also possible to use the `BeanRegistrationPhaseBuildItem` to register a synthetic bean. However, we recommend extension authors to stick with `SyntheticBeanBuildItem` which is more idiomatic for Quarkus.
pt_br: Também é possível utilizar o `BeanRegistrationPhaseBuildItem` para registrar um bean sintético. No entanto, recomendamos aos autores de extensões que utilizem `SyntheticBeanBuildItem`, que é mais idiomático para o Quarkus.

source: Synthetic Injection Points
pt_br: Pontos de Injeção Sintéticos

source: Synthetic Injection Point - Build Step Example
pt_br: Ponto de Injeção Sintético - Exemplo de Etapa de Construção

source: A synthetic injection point with required type `Bar` was added; this is an equivalent of `@Inject Bar`.
pt_br: Foi adicionado um ponto de injeção sintético com o tipo obrigatório `Bar`; este é equivalente a `@Inject Bar`.

source: The bean instance is created with a function returned from a recorder method.
pt_br: A instância do bean é criada com uma função retornada de um método de gravação.

source: Synthetic Injection Point - Recorder Example
pt_br: Ponto de Injeção Sintético - Exemplo de Gravador

source: Pass a contextual reference of `Bar` to the constructor of `Foo`.
pt_br: Passa uma referência contextual de `Bar` ao construtor de `Foo`.

source: Use Case - Synthetic Observers
pt_br: Caso de Uso - Observadores Sintéticos

source: _Solution_: If you need to register a synthetic observer, use the `ObserverRegistrationPhaseBuildItem`.
pt_br: _Solução_: Se for necessário registrar um observador sintético, utilize o `ObserverRegistrationPhaseBuildItem`.

source: A build step that consumes the `ObserverRegistrationPhaseBuildItem` should always produce an `ObserverConfiguratorBuildItem` or at least inject a `BuildProducer` for this build item, otherwise it could be ignored or processed at the wrong time (e.g. after the correct CDI bootstrap phase).
pt_br: Uma etapa de construção que consome o `ObserverRegistrationPhaseBuildItem` deve sempre produzir um `ObserverConfiguratorBuildItem` ou, pelo menos, injetar um `BuildProducer` para este item de construção, caso contrário, pode ser ignorado ou processado no momento errado (por exemplo, após a fase de bootstrap correta do CDI).

source: `ObserverRegistrationPhaseBuildItem` Example
pt_br: Exemplo de `ObserverRegistrationPhaseBuildItem`

source: The output of a `ObserverConfigurator` is recorded as bytecode. Therefore, there are some limitations in how a synthetic observer is invoked at runtime. Currently, you must generate the bytecode of the method body directly.
pt_br: A saída de um `ObserverConfigurator` é gravada como bytecode. Portanto, há algumas limitações na forma como um observador sintético é chamado no tempo de execução. Atualmente, você deve gerar o bytecode do corpo do método diretamente.

source: Use Case - I Have a Generated Bean Class
pt_br: Caso de Uso - Tenho uma Classe de Bean Gerada

source: No problem. You can generate the bytecode of a bean class manually and then all you need to do is to produce a `GeneratedBeanBuildItem` instead of `GeneratedClassBuildItem`.
pt_br: Sem problemas. Você pode gerar o bytecode de uma classe de bean manualmente e, então, tudo o que precisa fazer é produzir um `GeneratedBeanBuildItem` em vez de `GeneratedClassBuildItem` .

source: `GeneratedBeanBuildItem` Example
pt_br: Exemplo de `GeneratedBeanBuildItem`

source: `io.quarkus.arc.deployment.GeneratedBeanGizmoAdaptor` makes it easy to produce ``GeneratedBeanBuildItem``s from Gizmo constructs.
pt_br: `io.quarkus.arc.deployment.GeneratedBeanGizmoAdaptor` facilita a produção de ``GeneratedBeanBuildItem``s a partir de constructos Gizmo.

source: The resulting bean class is something like `public class @Singleton MyBean { }`.
pt_br: A classe de bean resultante é algo como `public class @Singleton MyBean { }`.

source: Use Case - I Need to Validate the Deployment
pt_br: Caso de Uso - Preciso Validar a Implantação

source: Sometimes extensions need to inspect the beans, observers and injection points, then perform additional validations and fail the build if something is wrong.
pt_br: Por vezes, as extensões precisam de inspecionar os beans, os observadores e os pontos de injeção e, em seguida, efetuar validações adicionais e falhar a construção se algo estiver errado.

source: _Solution_: If an extension needs to validate the deployment it should use the `ValidationPhaseBuildItem`.
pt_br: _Solução_: Se uma extensão precisa validar a implantação, deve utilizar o `ValidationPhaseBuildItem`.

source: A build step that consumes the `ValidationPhaseBuildItem` should always produce a `ValidationErrorBuildItem` or at least inject a `BuildProducer` for this build item, otherwise it could be ignored or processed at the wrong time (e.g. after the correct CDI bootstrap phase).
pt_br: Uma etapa de construção que consome o `ValidationPhaseBuildItem` deve sempre produzir um `ValidationErrorBuildItem` ou, pelo menos, injetar um `BuildProducer` para este item de construção, caso contrário, pode ser ignorado ou processado no momento errado (por exemplo, após a fase de bootstrap correta do CDI).

source: You can easily filter all registered beans via the convenient `BeanStream` returned from the `ValidationPhaseBuildItem.getContext().beans()` method.
pt_br: Você pode filtrar facilmente todos os beans registrados através do prático `BeanStream` retornado pelo método `ValidationPhaseBuildItem.getContext().beans()`.

source: Use Case - Register a Custom CDI Context
pt_br: Caso de Uso - Registrar um Contexto CDI Personalizado

source: Sometimes extensions need to extend the set of built-in CDI contexts.
pt_br: Às vezes, as extensões precisam estender o conjunto de contextos CDI integrados.

source: _Solution_: If you need to register a custom context, use the `ContextRegistrationPhaseBuildItem`.
pt_br: _Solução_: Se for necessário registrar um contexto personalizado, utilize o `ContextRegistrationPhaseBuildItem`.

source: A build step that consumes the `ContextRegistrationPhaseBuildItem` should always produce a `ContextConfiguratorBuildItem` or at least inject a `BuildProducer` for this build item, otherwise it could be ignored or processed at the wrong time (e.g. after the correct CDI bootstrap phase).
pt_br: Uma etapa de construção que consome o `ContextRegistrationPhaseBuildItem` deve sempre produzir um `ContextConfiguratorBuildItem` ou, pelo menos, injetar um `BuildProducer` para este item de construção, caso contrário, pode ser ignorado ou processado no momento errado (por exemplo, após a fase de bootstrap correta do CDI).

source: `ContextRegistrationPhaseBuildItem` Example
pt_br: Exemplo de `ContextRegistrationPhaseBuildItem`

source: Additionally, each extension that registers a custom CDI context via `ContextRegistrationPhaseBuildItem` should also produce the `CustomScopeBuildItem` in order to contribute the custom scope annotation name to the set of bean defining annotations.
pt_br: Além disso, cada extensão que registra um contexto CDI personalizado através do `ContextRegistrationPhaseBuildItem` deve também produzir o `CustomScopeBuildItem` de modo a contribuir com o nome da anotação de escopo personalizado para o conjunto de anotações que definem o bean.
