Repository: quarkusio/pt.quarkus.io
Catalog: l10n/po/*/_guides/cdi-integration.adoc.po
Languages: pt_br

source: `CustomScopeBuildItem` Example
pt_br: Exemplo de `CustomScopeBuildItem`

source: What if I Need to Know All the Scopes Used in the Application?
pt_br: E Se Eu Precisar Conhecer Todos os Escopos Utilizados na Aplicação?

source: _Solution_: You can inject the `CustomScopeAnnotationsBuildItem` in a build step and use the convenient methods such as `CustomScopeAnnotationsBuildItem.isScopeDeclaredOn()`.
pt_br: _Solução_: Você pode injetar o `CustomScopeAnnotationsBuildItem` numa etapa de construção e utilizar os métodos convenientes, como `CustomScopeAnnotationsBuildItem.isScopeDeclaredOn()`.

source: Use Case - Additional Interceptor Bindings
pt_br: Caso de Uso - Ligações de Interceptadores Adicionais

source: In rare cases it might be handy to programmatically register an existing annotation that is not annotated with `@jakarta.interceptor.InterceptorBinding` as an interceptor binding. This is similar to what CDI achieves through `BeforeBeanDiscovery#addInterceptorBinding()`. We are going to use `InterceptorBindingRegistrarBuildItem` to get it done.
pt_br: Em casos raros, pode ser útil registrar programaticamente uma anotação existente que não esteja anotada com `@jakarta.interceptor.InterceptorBinding` como uma vinculação de interceptador. Isso é semelhante ao que o CDI consegue fazer por meio de `BeforeBeanDiscovery#addInterceptorBinding()` . Vamos usar o `InterceptorBindingRegistrarBuildItem` para fazer isso.

source: `InterceptorBindingRegistrarBuildItem` Example
pt_br: Exemplo de `InterceptorBindingRegistrarBuildItem`

source: Use Case - Additional Qualifiers
pt_br: Caso de Uso - Qualificadores Adicionais

source: Sometimes it might be useful to register an existing annotation that is not annotated with `@jakarta.inject.Qualifier` as a CDI qualifier. This is similar to what CDI achieves through `BeforeBeanDiscovery#addQualifier()`. We are going to use `QualifierRegistrarBuildItem` to get it done.
pt_br: Às vezes, pode ser útil registrar uma anotação existente que não esteja anotada com `@jakarta.inject.Qualifier` como um qualificador CDI. Isso é semelhante ao que a CDI faz por meio do `BeforeBeanDiscovery#addQualifier()` . Vamos usar o `QualifierRegistrarBuildItem` para fazer isso.

source: `QualifierRegistrarBuildItem` Example
pt_br: Exemplo de `QualifierRegistrarBuildItem`

source: Use Case - Additional Stereotypes
pt_br: Caso de Uso - Estereótipos Adicionais

source: It is sometimes useful to register an existing annotation that is not annotated with `@jakarta.enterprise.inject.Stereotype` as a CDI stereotype. This is similar to what CDI achieves through `BeforeBeanDiscovery#addStereotype()`. We are going to use `StereotypeRegistrarBuildItem` to get it done.
pt_br: Às vezes, é útil registrar uma anotação existente que não esteja anotada com `@jakarta.enterprise.inject.Stereotype` como um estereótipo CDI. Isso é semelhante ao que a CDI faz por meio do `BeforeBeanDiscovery#addStereotype()` . Vamos usar o `StereotypeRegistrarBuildItem` para fazer isso.

source: `StereotypeRegistrarBuildItem` Example
pt_br: Exemplo de `StereotypeRegistrarBuildItem`

source: Use Case - Injection Point Transformation
pt_br: Caso de Uso - Transformação de Pontos de Injeção

source: Every now and then it is handy to be able to change the qualifiers of an injection point programmatically. You can do just that with `InjectionPointTransformerBuildItem`. The following sample shows how to apply transformation to injection points with type `Foo` that contain qualifier `MyQualifier`:
pt_br: De vez em quando, é útil poder alterar os qualificadores de um ponto de injeção de forma programática. Você pode fazer exatamente isso com `InjectionPointTransformerBuildItem` . O exemplo a seguir mostra como aplicar a transformação a pontos de injeção com o tipo `Foo` que contém o qualificador `MyQualifier` :

source: `InjectionPointTransformerBuildItem` Example
pt_br: Exemplo de `InjectionPointTransformerBuildItem`

source: Use Case - Resource Annotations and Injection
pt_br: Caso de Uso - Anotações e Injeção de Recursos

source: The `ResourceAnnotationBuildItem` can be used to specify resource annotations that make it possible to resolve non-CDI injection points, such as Jakarta EE resources. An integrator must also provide a corresponding `io.quarkus.arc.ResourceReferenceProvider` service provider implementation.
pt_br: O `ResourceAnnotationBuildItem` pode ser usado para especificar anotações de recursos que possibilitam a resolução de pontos de injeção não CDI, como os recursos do Jakarta EE. Um integrador também deve fornecer uma implementação correspondente do provedor de serviços `io.quarkus.arc.ResourceReferenceProvider`.

source: `ResourceAnnotationBuildItem` Example
pt_br: Exemplo de `ResourceAnnotationBuildItem`

source: Available Build Time Metadata
pt_br: Metadados de Tempo de Construção Disponíveis

source: Any of the above extensions that operates with `BuildExtension.BuildContext` can leverage certain build time metadata that are generated during build. The built-in keys located in `io.quarkus.arc.processor.BuildExtension.Key` are:
pt_br: Qualquer uma das extensões acima que opere com `BuildExtension.BuildContext` pode aproveitar determinados metadados de tempo de construção gerados durante a construção. As chaves integradas, localizadas em `io.quarkus.arc.processor.BuildExtension.Key` são:

source: Contains an `AnnotationStore` that keeps information about all `AnnotationTarget` annotations after application of annotation transformers
pt_br: Contém um `AnnotationStore` que mantém informações sobre todas as anotações `AnnotationTarget` após a aplicação de transformadores de anotações

source: `Collection<InjectionPointInfo>` containing all injection points
pt_br: `Collection<InjectionPointInfo>` contendo todos os pontos de injeção

source: `Collection<BeanInfo>` containing all beans
pt_br: `Collection<BeanInfo>` contendo todos os beans

source: `Collection<ObserverInfo>` containing all observers
pt_br: `Collection<ObserverInfo>` contendo todos os observadores

source: `Collection<ScopeInfo>` containing all scopes, including custom ones
pt_br: `Collection<ScopeInfo>` contendo todos os escopos, incluindo os personalizados

source: `Map<DotName, ClassInfo>` containing all qualifiers
pt_br: `Map<DotName, ClassInfo>` contendo todos os qualificadores

source: `Map<DotName, ClassInfo>` containing all interceptor bindings
pt_br: `Map<DotName, ClassInfo>` contendo todas os vínculos de interceptadores

source: `Map<DotName, StereotypeInfo>` containing all stereotypes
pt_br: `Map<DotName, StereotypeInfo>` contendo todos os estereótipos

source: To get hold of these, simply query the extension context object for given key. Note that these metadata are made available as build proceeds which means that extensions can only leverage metadata that were built before the extensions are invoked. If your extension attempts to retrieve metadata that wasn't yet produced, `null` will be returned. Here is a summary of which extensions can access which metadata:
pt_br: Para obtê-los, basta consultar o objeto de contexto da extensão para uma determinada chave. Observe que esses metadados são disponibilizados à medida que a construção avança, o que significa que as extensões só podem aproveitar os metadados que foram criados antes das extensões serem invocadas. Se sua extensão tentar recuperar metadados que ainda não foram produzidos, será retornado `null` . Aqui está um resumo de quais extensões podem acessar quais metadados:

source: Shouldn't rely on any metadata as it could be used at any time in any phase of the bootstrap
pt_br: Não deve depender de quaisquer metadados, uma vez que pode ser utilizado em qualquer momento de qualquer fase do bootstrap

source: Has access to `ANNOTATION_STORE`, `QUALIFIERS`, `INTERCEPTOR_BINDINGS`, `STEREOTYPES`
pt_br: Tem acesso a `ANNOTATION_STORE`, `QUALIFIERS`, `INTERCEPTOR_BINDINGS`, `STEREOTYPES`

source: Has access to `ANNOTATION_STORE`, `QUALIFIERS`, `INTERCEPTOR_BINDINGS`, `STEREOTYPES`, `BEANS` (class-based beans only), `OBSERVERS` (class-based observers only), `INJECTION_POINTS`
pt_br: Tem acesso a `ANNOTATION_STORE`, `QUALIFIERS`, `INTERCEPTOR_BINDINGS`, `STEREOTYPES`, `BEANS` (apenas beans baseados em classes), `OBSERVERS` (apenas observadores baseados em classes), `INJECTION_POINTS`

source: Has access to `ANNOTATION_STORE`, `QUALIFIERS`, `INTERCEPTOR_BINDINGS`, `STEREOTYPES`, `BEANS`, `OBSERVERS` (class-based observers only), `INJECTION_POINTS`
pt_br: Tem acesso a `ANNOTATION_STORE`, `QUALIFIERS`, `INTERCEPTOR_BINDINGS`, `STEREOTYPES`, `BEANS`, `OBSERVERS` (apenas observadores baseados em classes), `INJECTION_POINTS`

source: Has access to all build metadata
pt_br: Tem acesso a todos os metadados de construção
