Repository: quarkusio/pt.quarkus.io
Catalog: l10n/po/*/_guides/config-yaml.adoc.po
Languages: pt_br

source: YAML configuration
pt_br: Configuração YAML

source: You can use a YAML file,`application.yaml`, to configure your {project-name} application instead of the standard Java properties file, `application.properties`.
pt_br: Você pode usar um arquivo YAML, `application.yaml` , para configurar sua aplicação {project-name} em vez do arquivo de propriedades Java padrão, `application.properties` .

source: link:https://en.wikipedia.org/wiki/YAML[YAML] is widely used for defining resource descriptors, especially in Kubernetes.
pt_br: link:https://en.wikipedia.org/wiki/YAML[O YAML] é amplamente usado para definir descritores de recursos, especialmente no Kubernetes.

source: Enable YAML configuration
pt_br: Habilitar a configuração YAML

source: To enable YAML configuration, add the `quarkus-config-yaml` extension:
pt_br: Para ativar a configuração YAML, adicione a extensão `quarkus-config-yaml` :

source: Alternatively, add the following dependency to your project:
pt_br: Como alternativa, adicione a seguinte dependência ao seu projeto:

source: After adding the extension or dependency, to avoid confusion, remove the `src/main/resources/application.properties` file and create a `src/main/resources/application.yaml` file.
pt_br: Depois de adicionar a extensão ou a dependência, para evitar confusão, remova o arquivo `src/main/resources/application.properties` e crie um arquivo `src/main/resources/application.yaml` .

source: If both files are present, {project-name} gives precedence to properties in the YAML file.
pt_br: Se ambos os arquivos estiverem presentes, o {project-name} dará prioridade às propriedades do arquivo YAML.

source: {project-name} recognizes both `.yml` and `.yaml` file extensions.
pt_br: {project-name} reconhece ambas as extensões de arquivo `.yml` e `.yaml`.

source: Example YAML configurations
pt_br: Exemplo de configurações YAML

source: The following snippets give examples of YAML configurations:
pt_br: Os trechos a seguir fornecem exemplos de configurações do YAML:

source: Profiles
pt_br: Perfis

source: As you can see in the previous snippet, you can use xref:config-reference.adoc#profiles[profiles] in YAML.
pt_br: Como o você pode ver no trecho anterior, é possível usar xref:config-reference.adoc#profiles[perfis] no YAML.

source: In YAML, keys that begin with `%` are not allowed. However, profile keys must start with this symbol. To resolve this, enclose the profile keys in double quotes, as demonstrated by the example, `"%test"`.
pt_br: No YAML, as chaves que começam com `%` não são permitidas. Entretanto, as chaves de perfil devem começar com esse símbolo. Para resolver isso, coloque as chaves de perfil entre aspas duplas, conforme demonstrado no exemplo `"%test"` .

source: All configurations under the `"%test"` key activate only when the `test` profile is enabled. For instance, the previous snippet shows that OpenID Connect (OIDC) (`quarkus.oidc.enabled: false`) is disabled when the `test` profile is active. Without the `test` profile, OIDC is enabled by default.
pt_br: Todas as configurações sob a chave `"%test"` são ativadas somente quando o perfil `test` está ativado. Por exemplo, o trecho anterior mostra que o OpenID Connect (OIDC) ( `quarkus.oidc.enabled: false` ) está desativado quando o perfil `test` está ativo. Sem o perfil `test` , o OIDC é ativado por padrão.

source: You can also define custom profiles, such as `%staging` in the following example:
pt_br: Você pode também definir perfis personalizados, como `%staging` no exemplo a seguir:

source: If you enable the `staging` profile, the HTTP port is set to `8082` instead of `8081`.
pt_br: Se você ativar o perfil `staging` , a porta HTTP será definida como `8082` em vez de `8081` .

source: The YAML configuration also supports profile-aware files. In this case, properties for a specific profile can reside in an `application-{profile}.yaml` named file. The previous example can be expressed as:
pt_br: A configuração YAML também oferece suporte a arquivos com reconhecimento de perfil. Nesse caso, as propriedades de um perfil específico podem estar presente em um arquivo nomeado `application-{profile}.yaml` . O exemplo anterior pode ser expresso como:

source: Expressions
pt_br: Expressões

source: The YAML format also supports xref:config-reference.adoc#property-expressions[property expressions], by using the same format as Java properties:
pt_br: O formato YAML também é compatível com xref:config-reference.adoc#property-expressions[expressões de propriedade] (property expressions), usando o mesmo formato das propriedades Java:

source: You can reference nested properties by using the `.` (dot) separator, as in `${x.factor}`.
pt_br: Você pode fazer referência a propriedades vinculadas (nested) usando o separador `.` (ponto), como em `${x.factor}` .

source: External application.yaml file
pt_br: Arquivo application.yaml externo

source: The `application.yaml` file can also be placed in `config/application.yaml` to specialize the runtime configuration. The file must be present in the root of the working directory relative to the {project-name} application runner:
pt_br: O arquivo `application.yaml` também pode ser colocado em `config/application.yaml` para especializar a configuração do tempo de execução. O arquivo deve estar presente na raiz do diretório de trabalho em relação ao executor da aplicação {project-name}:

source: The values from this file override any values from the regular `application.yaml` file if it exists.
pt_br: Os valores deste arquivo substituem quaisquer valores do arquivo `application.yaml` regular, se ele existir.

source: Configuration property conflicts
pt_br: Conflitos de propriedades de configuração

source: The MicroProfile Config specification defines configuration properties as an arbitrary `.`-delimited string. However, structured formats such as YAML only support a subset of the possible configuration namespace. For example, consider the two configuration properties `quarkus.http.cors` and `quarkus.http.cors.methods`. One property is the prefix of another, so it might not be immediately evident how to specify both keys in your YAML configuration.
pt_br: A especificação MicroProfile Config define propriedades de configuração como uma string arbitrária delimitada por pontos (`.`) . No entanto, os formatos estruturados, como o YAML, suportam apenas um subconjunto do espaço de nomes de configuração possível. Por exemplo, considere as duas propriedades de configuração `quarkus.http.cors` e `quarkus.http.cors.methods` . Uma propriedade é o prefixo de outra, portanto, pode não ser imediatamente evidente como especificar ambas as chaves em sua configuração YAML.

source: This is solved by using `~` as a `null` key to represent any YAML property that is a prefix of another one:
pt_br: Isso é resolvido com o uso de `~` como uma chave `null` para representar qualquer propriedade YAML que seja um prefixo de outra:

source: YAML `null` keys are not included in the assembly of the configuration property name, allowing them to be used at any level for disambiguating configuration properties.
pt_br: As chaves YAML `null` não são incluídas na composição do nome da propriedade de configuração, permitindo que sejam usadas em qualquer nível para remover ambiguidade das propriedades de configuração.

source: Although Quarkus primarily uses `.properties` file extension for configuration, the snakeyaml library, which is used for parsing YAML in Quarkus, can also parse JSON structures. This means you can use YAML files with JSON content inside.
pt_br: Embora o Quarkus use principalmente a extensão de arquivo `.properties` para configuração, a biblioteca snakeyaml, que é usada para interpretar YAML no Quarkus, também pode interpretar estruturas JSON. Isso significa que você pode usar arquivos YAML com conteúdo JSON.

source: YAML and JSON structures can be read in an application.yaml file.
pt_br: Estruturas YAML e JSON podem ser interpretadas em um arquivo application.yaml.

source: Certainly, here's a step-by-step guide on how to use complex configuration structures with Quarkus:
pt_br: Certamente, aqui está um guia passo a passo sobre como usar estruturas de configuração complexas com o Quarkus:

source: Define Your Configuration Interface.
pt_br: Define sua interface de configuração.

source: Create the appropriate JSON structure and store it in a YAML file.
pt_br: Crie a estrutura JSON apropriada e armazene-a em um arquivo YAML.
