Repository: quarkusio/pt.quarkus.io
Catalog: l10n/po/*/_guides/container-image.adoc.po
Languages: es

source: Container Images
es: Imágenes de contenedores

source: Container Image extensions
es: Extensiones de la imagen del contenedor

source: The extension `quarkus-container-image-jib` is powered by https://github.com/GoogleContainerTools/jib[Jib] for performing container image builds. The major benefit of using Jib with Quarkus is that all the dependencies (everything found under `target/lib`) are cached in a different layer than the actual application making rebuilds really fast and small (when it comes to pushing). Another important benefit of using this extension is that it provides the ability to create a container image without having to have any dedicated client side tooling (like Docker) or running daemon processes (like the Docker daemon) when all that is needed is the ability to push to a container image registry.
es: La extensión `quarkus-container-image-jib` es impulsada por https://github.com/GoogleContainerTools/jib[Jib] para realizar construcciones de imágenes de contenedores. El mayor beneficio de usar Jib con Quarkus es que todas las dependencias (todo lo que se encuentra en `target/lib`) se almacenan en caché en una capa diferente a la de la aplicación real, haciendo que las reconstrucciones sean realmente rápidas y pequeñas (cuando se trata de subir). Otro beneficio importante de usar esta extensión es que proporciona la capacidad de crear una imagen de contenedor sin tener que tener ninguna herramienta dedicada del lado del cliente (como Docker) o ejecutar procesos de demonio (como el demonio Docker) cuando todo lo que se necesita es la capacidad de subir a un registro de imagen de contenedor.

source: To use this feature, add the following extension to your project:
es: Para utilizar esta función, añada la siguiente extensión a su proyecto:

source: In situations where all that is needed to build a container image and no push to a registry is necessary (essentially by having set `quarkus.container-image.build=true` and left `quarkus.container-image.push` unset - it defaults to `false`), then this extension creates a container image and registers it with the Docker daemon. This means that although Docker isn't used to build the image, it is nevertheless necessary. Also note that using this mode, the built container image *will* show up when executing `docker images`.
es: En situaciones en las que todo lo que se necesita para construir una imagen de contenedor y no es necesario empujar a un registro (esencialmente por haber establecido `quarkus.container-image.build=true` y dejado `quarkus.container-image.push` sin establecer - por defecto es `false`), entonces esta extensión crea una imagen de contenedor y la registra con el demonio Docker. Esto significa que aunque Docker no se utiliza para construir la imagen, es sin embargo necesario. También hay que tener en cuenta que usando este modo, la imagen de contenedor construida *aparecerá* cuando se ejecute `docker images`.

source: Including extra files
es: Inclusión de archivos adicionales

source: There are cases when additional files (other than ones produced by the Quarkus build) need to be added to a container image. To support these cases, Quarkus copies any file under `src/main/jib` into the built container image (which is essentially the same idea that the Jib Maven and Gradle plugins support). For example, the presence of `src/main/jib/foo/bar` would result in `/foo/bar` being added into the container filesystem.
es: Hay casos en los que es necesario añadir archivos adicionales (distintos de los producidos por la construcción de Quarkus) a una imagen de contenedor. Para soportar estos casos, Quarkus copia cualquier archivo bajo `src/main/jib` en la imagen de contenedor construida (que es esencialmente la misma idea que soportan los plugins Jib Maven y Gradle). Por ejemplo, la presencia de `src/main/jib/foo/bar` haría que se añadiera `/foo/bar` al sistema de archivos del contenedor.

source: JVM Debugging
es: Depuración de la JVM

source: There are cases where the built container image may need to have Java debugging conditionally enabled at runtime.
es: Hay casos en los que la imagen del contenedor construido puede necesitar tener la depuración de Java condicionada en tiempo de ejecución.

source: When the base image has not been changed (and therefore `ubi8/openjdk-11-runtime` or `ubi8/openjdk-17-runtime` is used), then the `quarkus.jib.jvm-additional-arguments` configuration property can be used in order to make the JVM listen on the debug port at startup.
es: Cuando la imagen base no ha sido cambiada (y por lo tanto se usa `ubi8/openjdk-11-runtime` o `ubi8/openjdk-17-runtime` ), entonces la propiedad de configuración `quarkus.jib.jvm-additional-arguments` puede ser usada para hacer que la JVM escuche en el puerto de depuración al inicio.

source: The exact configuration is:
es: La configuración exacta es:

source: Other base images might provide launch scripts that enable debugging when an environment variable is set, in which case you would set than environment variable when launching the container.
es: Otras imágenes base pueden proporcionar scripts de lanzamiento que permiten la depuración cuando se establece una variable de entorno, en cuyo caso se establecería esa variable de entorno al lanzar el contenedor.

source: Finally, the `quarkus.jib.jvm-entrypoint` configuration property can be used to completely override the container entry point and can thus be used to either hard code the JVM debug configuration or point to a script that handles the details.
es: Por último, la propiedad de configuración `quarkus.jib.jvm-entrypoint` se puede utilizar para anular completamente el punto de entrada del contenedor y, por lo tanto, se puede utilizar para codificar la configuración de depuración de la JVM o apuntar a un script que se encargue de los detalles.

source: The extension `quarkus-container-image-docker` is using the Docker binary and the generated Dockerfiles under `src/main/docker` in order to perform Docker builds.
es: La extensión `quarkus-container-image-docker` utiliza el binario Docker y los archivos Docker generados bajo `src/main/docker` para realizar las construcciones Docker.

source: To use this feature, add the following extension to your project.
es: Para utilizar esta función, añada la siguiente extensión a su proyecto.

source: The extension `quarkus-container-image-s2i` is using S2I binary builds in order to perform container builds inside the OpenShift cluster. The idea behind the binary build is that you just upload the artifact and its dependencies to the cluster and during the build they will be merged to a builder image (defaults to `fabric8/s2i-java`).
es: La extensión `quarkus-container-image-s2i` está usando construcciones binarias S2I para realizar construcciones de contenedores dentro del clúster OpenShift. La idea detrás de la construcción binaria es que sólo tienes que subir el artefacto y sus dependencias al clúster y durante la construcción se fusionarán con una imagen constructora (por defecto `fabric8/s2i-java`).

source: The benefit of this approach, is that it can be combined with OpenShift's `DeploymentConfig` that makes it easy to roll out changes to the cluster.
es: La ventaja de este enfoque es que puede combinarse con el sitio web de OpenShift `DeploymentConfig`, que facilita la introducción de cambios en el clúster.

source: S2I builds require creating a `BuildConfig` and two `ImageStream` resources, one for the builder image and one for the output image. The creation of such objects is being taken care of by the Quarkus Kubernetes extension.
es: Las construcciones S2I requieren la creación de un `BuildConfig` y dos recursos `ImageStream`, uno para la imagen constructora y otro para la imagen de salida. De la creación de estos objetos se encarga la extensión Quarkus Kubernetes.

source: The extension `quarkus-container-image-buildpack` is using buildpacks in order to perform container image builds. Under the hood buildpacks will use a Docker daemon for the actual build. While buildpacks support alternatives to Docker, this extension will only work with Docker.
es: La extensión `quarkus-container-image-buildpack` utiliza buildpacks para realizar la construcción de imágenes de contenedores. Bajo el capó, los buildpacks utilizarán un demonio Docker para la construcción real. Mientras que los buildpacks soportan alternativas a Docker, esta extensión sólo funcionará con Docker.

source: Additionally, the user will have to configure which build image to use (no default image is provided). For example:
es: Además, el usuario tendrá que configurar qué imagen de compilación utilizar (no se proporciona ninguna imagen por defecto). Por ejemplo:

source: or for native:
es: o para los nativos:

source: When using the buildpack container image extension it is strongly advised to avoid adding `quarkus.container-image.build=true` in your properties configuration as it might trigger nesting builds within builds. It's preferable to pass it as an option to the build command instead.
es: Cuando se utiliza la extensión de la imagen del contenedor buildpack se recomienda encarecidamente evitar añadir `quarkus.container-image.build=true` en la configuración de las propiedades, ya que podría desencadenar construcciones anidadas dentro de otras. Es preferible pasarla como una opción al comando de construcción.

source: Building
es: Construcción

source: To build a container image for your project, `quarkus.container-image.build=true` needs to be set using any of the ways that Quarkus supports.
es: Para construir una imagen de contenedor para su proyecto, `quarkus.container-image.build=true` necesita ser configurado usando cualquiera de las formas que Quarkus soporta.

source: If you ever want to build a native container image and already have an existing native image you can set `-Dquarkus.native.reuse-existing=true` and the native image build will not be re-run.
es: Si alguna vez quiere construir una imagen de contenedor nativo y ya tiene una imagen nativa existente, puede establecer `-Dquarkus.native.reuse-existing=true` y la construcción de la imagen nativa no se volverá a ejecutar.

source: Pushing
es: Subiendo

source: To push a container image for your project, `quarkus.container-image.push=true` needs to be set using any of the ways that Quarkus supports.
es: Para subir una imagen de contenedor para su proyecto, `quarkus.container-image.push=true` necesita ser establecido usando cualquiera de las formas que Quarkus soporta.

source: If no registry is set (using `quarkus.container-image.registry`) then `docker.io` will be used as the default.
es: Si no se establece ningún registro (utilizando `quarkus.container-image.registry`), se utilizará `docker.io` por defecto.

source: Selecting among multiple extensions
es: Seleccionar entre varias extensiones

source: It does not make sense to use multiple extension as part of the same build. When multiple container image extensions are present, an error will be raised to inform the user. The user can either remove the unneeded extensions or select one using `application.properties`.
es: No tiene sentido utilizar varias extensiones como parte de la misma construcción. Cuando haya varias extensiones de imagen de contenedor, se producirá un error para informar al usuario. El usuario puede eliminar las extensiones innecesarias o seleccionar una utilizando `application.properties`.

source: For example, if both `container-image-docker` and `container-image-s2i` are present and the user needs to use `container-image-docker`:
es: Por ejemplo, si tanto `container-image-docker` como `container-image-s2i` están presentes y el usuario necesita utilizar `container-image-docker`:

source: Customizing
es: Personalizar

source: The following properties can be used to customize the container image build process.
es: Las siguientes propiedades pueden utilizarse para personalizar el proceso de construcción de la imagen del contenedor.

source: Container Image Options
es: Opciones de imagen del contenedor

source: Using CI Environments
es: Uso de entornos de IC

source: Various CI environments provide a ready to use container-image registry which can be combined with the container-image Quarkus extensions in order to effortlessly create and push a Quarkus application to said registry.
es: Varios entornos de CI proporcionan un registro de imagen de contenedor listo para usar que puede combinarse con las extensiones de Quarkus de imagen de contenedor para crear y empujar sin esfuerzo una aplicación de Quarkus a dicho registro.

source: For example, https://gitlab.com/[GitLab] provides such a registry and in the provided CI environment, makes available the `CI_REGISTRY_IMAGE` environment variable (see GitLab's https://docs.gitlab.com/ee/ci/variables/[documentation]) for more information), which can be used in Quarkus like so:
es: Por ejemplo, https://gitlab.com/[GitLab] proporciona un registro de este tipo y en el entorno de CI proporcionado, pone a disposición la variable de entorno `CI_REGISTRY_IMAGE` (véase la https://docs.gitlab.com/ee/ci/variables/[documentación] de GitLab) para obtener más información), que se puede utilizar en Quarkus de esta manera:

source: Jib Options
es: Opciones de pluma

source: In addition to the generic container image options, the `container-image-jib` also provides the following options:
es: Además de las opciones genéricas de la imagen del contenedor, `container-image-jib` también proporciona las siguientes opciones:

source: Docker Options
es: Opciones de Docker

source: In addition to the generic container image options, the `container-image-docker` also provides the following options:
es: Además de las opciones genéricas de la imagen del contenedor, `container-image-docker` también proporciona las siguientes opciones:

source: S2I Options
es: Opciones S2I

source: In addition to the generic container image options, the `container-image-s2i` also provides the following options:
es: Además de las opciones genéricas de la imagen del contenedor, `container-image-s2i` también proporciona las siguientes opciones:
