Repository: quarkusio/pt.quarkus.io
Catalog: l10n/po/*/_guides/continuous-testing.adoc.po
Languages: pt_br

source: Continuous Testing
pt_br: Testes Contínuos

source: Learn how to use continuous testing in your Quarkus Application.
pt_br: Saiba como usar o teste contínuo em sua aplicação Quarkus.

source: Prerequisites
pt_br: Pré-requisitos

source: The completed greeter application from the xref:getting-started.adoc[Getting Started Guide]
pt_br: A aplicação de saudação concluída do xref:getting-started.adoc[Guia de Introdução]

source: Introduction
pt_br: Introdução

source: Quarkus supports continuous testing, where tests run immediately after code changes have been saved. This allows you to get instant feedback on your code changes. Quarkus detects which tests cover which code, and uses this information to only run the relevant tests when code is changed.
pt_br: O Quarkus suporta testes contínuos, onde os testes são executados imediatamente após as alterações de código terem sido salvas. Isso permite que você obtenha feedback instantâneo sobre as alterações no código. O Quarkus detecta quais testes cobrem qual código e usa essas informações para executar apenas os testes relevantes quando o código é alterado.

source: Solution
pt_br: Solução

source: Start the xref:getting-started.adoc[Getting Started] application (or any other application) using:
pt_br: Inicie a aplicação xref:getting-started.adoc[Guia de Introdução] (ou qualquer outra aplicação) utilizando:

source: Quarkus will start in development mode as normal, but down the bottom of the screen you should see the following:
pt_br: O Quarkus inicia normalmente no modo de desenvolvimento, mas na parte inferior da tela deve aparecer o seguinte:

source: Press `r` and the tests will start running. You should see the status change down the bottom of the screen as they are running, and it should finish with:
pt_br: Pressione `r` e os testes começarão a ser executados. Você deve ver a alteração do status na parte inferior da tela à medida que eles forem sendo executados e deve terminar com:

source: If you want continuous testing to start automatically you can set `quarkus.test.continuous-testing=enabled` in `application.properties`. If you don't want it at all you can change this to `disabled`.
pt_br: Se quiser que os testes contínuos sejam iniciados automaticamente, você pode definir `quarkus.test.continuous-testing=enabled` em `application.properties`. Se não quiser que eles sejam iniciados, você pode alterá-los para `disabled`.

source: Now you can start making changes to your application. Go into the `GreetingResource` and change the hello endpoint to return `"hello world"`, and save the file. Quarkus should immediately re-run the test, and you should get output similar to the following:
pt_br: Agora, você pode começar a fazer alterações na sua aplicação. Acesse `GreetingResource` e altere o endpoint hello para retornar `"hello world"` , e salve o arquivo. O Quarkus deve executar novamente o teste imediatamente, e você deve obter um resultado semelhante ao seguinte:

source: Change it back and the tests will run again.
pt_br: Altere-o novamente e os testes serão executados novamente.

source: Controlling Continuous Testing
pt_br: Controlando os Testes Contínuos

source: There are various hotkeys you can use to control continuous testing. Pressing `h` will display the following list of commands:
pt_br: Há várias teclas de atalho que você pode usar para controlar o teste contínuo. Pressione `h` para exibir a seguinte lista de comandos:

source: These are explained below:
pt_br: Estas são explicadas a seguir:

source: [r] - Re-run all tests
pt_br: [r] - Executar novamente todos os testes

source: This will re-run every test
pt_br: Isto irá executar novamente todos os testes

source: [f] - Re-run failed tests
pt_br: [f] - Repetir testes falhados

source: This will re-run every failing test
pt_br: Isto irá executar novamente todos os testes que falharem

source: [b] - Toggle 'broken only' mode, where only failing tests are run
pt_br: [b] - Alterna o modo 'broken only', onde apenas os testes que falharam são executados

source: Broken only mode will only run tests that have previously failed, even if other tests would normally be affected by a code change. This can be useful if you are modifying code that is used by lots of tests, but you only want to focus on debugging the failing one.
pt_br: O modo broken only executará somente os testes que falharam anteriormente, mesmo que outros testes sejam normalmente afetados por uma alteração de código. Isso pode ser útil se você estiver modificando o código que é usado por muitos testes, mas quiser se concentrar apenas na depuração do teste que falhou.

source: [v] - Print failures from the last test run
pt_br: [v] - Imprimir as falhas do último teste efetuado

source: Prints the failures to the console again, this can be useful if there has been lots of console output since the last run.
pt_br: Imprime novamente as falhas no console, o que pode ser útil se teve muita saída de console desde a última execução.

source: [p] - Pause tests
pt_br: [p] - Pausa nos testes

source: Temporarily stops running tests. This can be useful if you are making lots of changes, and don't want feedback until they are all done.
pt_br: Interrompe temporariamente a execução de testes. Isso pode ser útil se você estiver fazendo muitas alterações e não quiser receber feedback até que todas estejam concluídas.

source: [o] - Toggle test output
pt_br: [o] - Ativar a saída de teste

source: By default test output is filtered and not displayed on the console, so that test output and dev mode output is not interleaved. Enabling test output will print output to the console when tests are run. Even when output is disabled the filtered output is saved and can be viewed in the Dev UI.
pt_br: Por padrão, a saída de teste é filtrada e não é exibida no console, de modo que a saída de teste e a saída do modo de desenvolvimento não sejam intercaladas. A ativação da saída de teste imprimirá a saída no console quando os testes forem executados. Mesmo quando a saída está desativada, a saída filtrada é salva e pode ser visualizada na Dev UI.

source: [i] - Toggle instrumentation based reload
pt_br: [i] - Ativar o recarregamento baseado em instrumentação

source: This is not directly related to testing, but allows you to toggle instrumentation based reload. This will allow live reload to avoid a restart if a change does not affect the structure of a class, which gives a faster reload and allows you to keep state.
pt_br: Isso não está diretamente relacionado a testes, mas permite que você alterne o recarregamento baseado em instrumentação. Isso permitirá que o recarregamento ao vivo evite uma reinicialização se uma alteração não afetar a estrutura de uma classe, o que proporciona um recarregamento mais rápido e permite que você mantenha o estado.

source: [l] - Toggle live reload
pt_br: [l] - Ativar o recarregamento ao vivo

source: This is not directly related to testing, but allows you to turn live reload on and off.
pt_br: Esta opção não está diretamente relacionada com os testes, mas permite-lhe ativar e desativar o recarregamento ao vivo.

source: [s] - Force restart
pt_br: [s] - Forçar a reinicialização

source: This will force a scan for changed files, and will perform a live reload with and changes. Note that even if there are no changes the application will still restart. This will still work even if live reload is disabled.
pt_br: Isso forçará uma verificação de arquivos alterados e executará um recarregamento ao vivo com as alterações. Observe que, mesmo que não haja alterações, o aplicativo ainda será reiniciado. Isso ainda funcionará mesmo que o recarregamento ao vivo esteja desativado.

source: Continuous Testing Without Dev Mode
pt_br: Testes Contínuos Sem o Modo de Desenvolvimento

source: It is possible to run continuous testing without starting dev mode. This can be useful if dev mode will interfere with your tests (e.g. running wiremock on the same port), or if you only want to develop using tests. To start continuous testing mode run `mvn quarkus:test`.
pt_br: É possível executar testes contínuos sem iniciar o modo de desenvolvimento. Isso pode ser útil se o modo de desenvolvimento interferir nos testes (por exemplo, executar o wiremock na mesma porta) ou se você quiser desenvolver apenas usando testes. Para iniciar o modo de teste contínuo, execute `mvn quarkus:test` .

source: The Dev UI is not available when running in continuous testing mode, as this is provided by dev mode.
pt_br: A IU de Desenvolvimento não está disponível durante a execução no modo de teste contínuo, uma vez que é fornecida pelo modo de desenvolvimento.

source: Multi-module Projects
pt_br: Projetos de Múltiplos Módulos

source: Note that continuous testing supports multi-module projects, so tests in modules other than the application can still be run when files are changed. The modules that are run can be controlled using config as listed below.
pt_br: Observe que o teste contínuo é compatível com projetos de múltiplos módulos, portanto, os testes em módulos diferentes da aplicação ainda podem ser executados quando os arquivos são alterados. Os módulos que são executados podem ser controlados usando a configuração, conforme listado abaixo.

source: This is enabled by default, and can be disabled via `quarkus.test.only-test-application-module=true`.
pt_br: Esta opção está ativada por padrão e pode ser desativada através de `quarkus.test.only-test-application-module=true`.

source: Configuring Continuous Testing
pt_br: Configurando Testes Contínuos

source: Continuous testing supports multiple configuration options that can be used to limit the tests that are run, and to control the output. The configuration properties are shown below:
pt_br: O teste contínuo oferece suporte a várias opções de configuração que podem ser usadas para limitar os testes que são executados e para controlar a saída. As propriedades de configuração são mostradas abaixo:
