Repository: quarkusio/pt.quarkus.io
Catalog: l10n/po/*/_guides/deploying-to-azure-cloud.adoc.po
Languages: to

source: Deploying to Microsoft Azure Cloud
to: Despliegue en la nube de Microsoft Azure

source: This guide covers:
to: Esta guía abarca:

source: Update Quarkus HTTP Port
to: Actualizar el puerto HTTP de Quarkus

source: Install the Azure CLI
to: Instalar la CLI de Azure

source: Create an Azure Registry Service instance and upload the Docker image
to: Crear una instancia de Azure Registry Service y subir la imagen Docker

source: Deploy the Docker image to Azure Container Instances
to: Despliegue de la imagen Docker en Azure Container Instances

source: Deploy the Docker image to Azure Kubernetes Service
to: Desplegar la imagen Docker en el servicio Azure Kubernetes

source: Deploy the Docker image to Azure App Service for Linux Containers
to: Despliegue de la imagen Docker en Azure App Service para contenedores Linux

source: Prerequisites
to: Requisitos previos

source: Having access to an Azure subscription. https://azure.microsoft.com/free/?WT.mc_id=opensource-quarkus-brborges[Get a free one here]
to: Tener acceso a una suscripción a Azure. https://azure.microsoft.com/free/?WT.mc_id=opensource-quarkus-brborges[Obtenga una gratuita aquí]

source: This guide will take as input a native application developed in the xref:building-native-image.adoc[building native image guide].
to: Esta guía tomará como entrada una aplicación nativa desarrollada en la xref:building-native-image.html[guía de construcción de imágenes nativas].

source: Make sure you have the getting-started application at hand, or clone the Git repository: `git clone {quickstarts-clone-url}`, or download an {quickstarts-archive-url}[archive]. The solution is located in the `getting-started` directory.
to: Asegúrate de tener a mano la aplicación de inicio, o clona el repositorio Git: `git clone {quickstarts-clone-url}` o descargue un {quickstarts-archive-url}[archivo]. La solución se encuentra en el directorio `getting-started`.

source: Change Quarkus HTTP Port
to: Cambiar el puerto HTTP de Quarkus

source: If you correctly followed the xref:building-native-image.adoc[building native image guide], you should have a local container image named `quarkus-quickstart/getting-started`.
to: Si ha seguido correctamente la xref:building-native-image.html[guía de construcción de imágenes nativas], debería tener una imagen de contenedor local llamada `quarkus-quickstart/getting-started`.

source: While Quarkus by default runs on port 8080, most Azure services expect web applications to be running on port 80. Before we continue, go back to your quickstart code and open the file `src/main/docker/Dockerfile.native`.
to: Aunque Quarkus se ejecuta por defecto en el puerto 8080, la mayoría de los servicios de Azure esperan que las aplicaciones web se ejecuten en el puerto 80. Antes de continuar, vuelve a tu código de inicio rápido y abre el archivo `src/main/docker/Dockerfile.native`.

source: Change the last two commands in the `Dockerfile.native` file and make it read like this:
to: Cambia los dos últimos comandos en el archivo `Dockerfile.native` y haz que se lea así:

source: Now you can rebuild the docker image:
to: Ahora puedes reconstruir la imagen docker:

source: To test, run it by exposing port 80 into port 8080 in your host:
to: Para probarlo, ejecútelo exponiendo el puerto 80 en el puerto 8080 en su host:

source: Your container image is now ready to run on Azure. Remember, the Quarkus application is mapped to run on port 80.
to: Tu imagen de contenedor está ahora lista para ejecutarse en Azure. Recuerde que la aplicación Quarkus está mapeada para ejecutarse en el puerto 80.

source: To ease the user experience throughout this guide, it is better to have the Azure CLI installed and authenticated.
to: Para facilitar la experiencia del usuario a lo largo de esta guía, es mejor tener la CLI de Azure instalada y autenticada.

source: Visit the https://docs.microsoft.com/cli/azure/install-azure-cli?view=azure-cli-latest?WT.mc_id=opensource-quarkus-brborges[Azure CLI] installation page for instructions specific to your operating system.
to: Visite la página de instalación de https://docs.microsoft.com/cli/azure/install-azure-cli?view=azure-cli-latest?WT.mc_id=opensource-quarkus-brborges[Azure CLI] para obtener instrucciones específicas para su sistema operativo.

source: Once installed, ensure you are authenticated:
to: Una vez instalado, asegúrese de estar autentificado:

source: Create an Azure Container Registry instance
to: Crear una instancia de Azure Container Registry

source: It is possible to deploy images hosted on Docker Hub, but this location by default leaves images accessible to anyone. To better protect your container images, this guide shows how to host your images on a private instance of the Azure Container Registry service.
to: Es posible desplegar imágenes alojadas en Docker Hub, pero esta ubicación por defecto deja las imágenes accesibles a cualquiera. Para proteger mejor sus imágenes de contenedores, esta guía muestra cómo alojar sus imágenes en una instancia privada del servicio Azure Container Registry.

source: First, create an Azure Resource Group:
to: En primer lugar, cree un grupo de recursos de Azure:

source: Then you can create the ACR:
to: A continuación, puede crear el ACR:

source: Finally, authenticate your local Docker installation with this container registry by running:
to: Por último, autentique su instalación local de Docker con este registro de contenedores ejecutando:

source: Upload Container Image on Azure
to: Cargar la imagen del contenedor en Azure

source: If you've followed the build native image guide, you should have a local container image named `quarkus-quickstart/getting-started`.
to: Si ha seguido la guía de creación de imágenes nativas, debería tener una imagen de contenedor local llamada `quarkus-quickstart/getting-started`.

source: To upload this image to your ACR, you must tag and push the image under the ACR login server. To find the login server of the Azure Container Registry, run this command:
to: Para subir esta imagen a su ACR, debe etiquetar y empujar la imagen bajo el servidor de inicio de sesión del ACR. Para encontrar el servidor de inicio de sesión del Azure Container Registry, ejecute este comando:

source: To upload, now do:
to: Para subir, hazlo ahora:

source: At this point, you should have your Quarkus container image on your Azure Container Registry. To verify, run the following command:
to: En este punto, deberías tener tu imagen de contenedor Quarkus en tu Azure Container Registry. Para comprobarlo, ejecuta el siguiente comando:

source: Deploy to Azure Container Instances
to: Despliegue en instancias de contenedores Azure

source: The simplest way to start this container in the cloud is with the Azure Container Instances service. It simply creates a container on Azure infrastructure.
to: La forma más sencilla de iniciar este contenedor en la nube es con el servicio Azure Container Instances. Simplemente crea un contenedor en la infraestructura de Azure.

source: There are different approaches for using ACI. Check the documentation for details. The quickest way to get a container up and running goes as it follows.
to: Existen diferentes enfoques para utilizar ACI. Consulte la documentación para obtener más detalles. La forma más rápida de poner en marcha un contenedor es la siguiente.

source: First step is to find the username and password for the admin, so that ACI can authenticate into ACR and pull the Docker image:
to: El primer paso es encontrar el nombre de usuario y la contraseña del administrador, para que ACI pueda autenticarse en ACR y extraer la imagen Docker:

source: Now create the Docker instance on ACI pointing to your image on ACR:
to: Ahora cree la instancia Docker en ACI apuntando a su imagen en ACR:

source: The command above, if run successfully, will give you the address of your container in the Cloud. Access your Quarkus application in the address displayed as output.
to: El comando anterior, si se ejecuta con éxito, le dará la dirección de su contenedor en la Nube. Acceda a su aplicación Quarkus en la dirección mostrada como salida.

source: For more information and details on ACR authentication and the use of service principals, follow this guide below and remember the Azure Container Registry `loginServer` and the image name of your Quarkus application now hosted on the ACR.
to: Para obtener más información y detalles sobre la autenticación en el ACR y el uso de los principales del servicio, siga esta guía y recuerde el Azure Container Registry `loginServer` y el nombre de la imagen de su aplicación Quarkus ahora alojada en el ACR.

source: https://docs.microsoft.com/en-us/azure/container-instances/container-instances-using-azure-container-registry?WT.mc_id=opensource-quarkus-brborges[Deploy to Azure Container Instances from Azure Container Registry]
to: https://docs.microsoft.com/en-us/azure/container-instances/container-instances-using-azure-container-registry?WT.mc_id=opensource-quarkus-brborges[Despliegue en Instancias de Contenedores Azure desde el Registro de Contenedores Azure]

source: Keep in mind that this service does not provide scalability. A container instance is unique and does not scale.
to: Tenga en cuenta que este servicio no proporciona escalabilidad. Una instancia de contenedor es única y no es escalable.

source: Deploy to Azure Kubernetes Service
to: Despliegue en el servicio Azure Kubernetes

source: You can also deploy the container image as a microservice in a Kubernetes cluster on Azure. To do that, follow this tutorial:
to: También puedes desplegar la imagen del contenedor como un microservicio en un clúster de Kubernetes en Azure. Para ello, sigue este tutorial:

source: https://docs.microsoft.com/en-us/azure/aks/tutorial-kubernetes-deploy-cluster?WT.mc_id=opensource-quarkus-brborges[Tutorial: Deploy an Azure Kubernetes Service (AKS) cluster]
to: https://docs.microsoft.com/en-us/azure/aks/tutorial-kubernetes-deploy-cluster?WT.mc_id=opensource-quarkus-brborges[Tutorial: Despliegue de un clúster de Azure Kubernetes Service (AKS)]

source: Once deployed, the application will be running on whatever port is used to expose the service. By default, Quarkus apps run on port 8080 internally.
to: Una vez desplegada, la aplicación se ejecutará en cualquier puerto que se utilice para exponer el servicio. Por defecto, las aplicaciones de Quarkus se ejecutan internamente en el puerto 8080.

source: Deploy to Azure App Service on Linux Containers
to: Despliegue en Azure App Service en contenedores Linux

source: This service provides scalability out of the box for web applications. If more instances are required, it will provide a load-balancing automatically, plus monitoring, metrics, logging and so on.
to: Este servicio proporciona escalabilidad de forma inmediata para las aplicaciones web. Si se necesitan más instancias, proporcionará un equilibrio de carga automáticamente, además de monitorización, métricas, registro, etc.

source: To deploy your Quarkus Native container image to this service, follow this tutorial:
to: Para desplegar su imagen de contenedor Quarkus Native en este servicio, siga este tutorial:

source: https://docs.microsoft.com/en-us/azure/app-service/containers/tutorial-custom-docker-image?WT.mc_id=opensource-quarkus-brborges[Tutorial: Build a custom image and run in App Service from a private registry]
to: https://docs.microsoft.com/en-us/azure/app-service/containers/tutorial-custom-docker-image?WT.mc_id=opensource-quarkus-brborges[Tutorial: Construir una imagen personalizada y ejecutarla en App Service desde un registro privado]
