Repository: quarkusio/pt.quarkus.io
Catalog: l10n/po/*/_guides/doc-create-tutorial.adoc.po
Languages: pt

source: Creating a tutorial
pt: Criando um tutorial

source: Create a new tutorial that guides users through creating, running, and testing a Quarkus application that uses annotations from an imaginary extension.
pt: Crie um novo tutorial que oriente os usuários na criação, execução e teste de uma aplicação Quarkus que utilize anotações de uma extensão imaginária.

source: Prerequisites
pt: Pré-requisitos

source: Roughly 15 minutes
pt: Cerca de 15 minutos

source: An editor or IDE that provides syntax highlighting and previews for AsciiDoc, either natively or using a plugin.
pt: Um editor ou IDE que fornece realce de sintaxe e pré-visualizações para AsciiDoc, nativamente ou usando um plugin.

source: You should be familiar with the overview of what a xref:doc-concept.adoc#tutorial[Tutorial] is.
pt: Já deve estar familiarizado com a visão geral do que é um link:doc-concept.html#tutorial[Tutorial].

source: Have the xref:doc-reference.adoc[Quarkus style and content guidelines] handy as a reference for required syntax and other conventions.
pt: Tenha à mão as link:doc-reference.html[diretrizes de estilo e conteúdo do Quarkus] como referência para a sintaxe necessária e outras convenções.

source: Decide on a title and file name
pt: Decidir o título e o nome do arquivo

source: Decide on a title for the tutorial. For this worked example, we will use `Serve Http requests using the Acme extension`.
pt: Escolha um título para o tutorial. Para este exemplo de trabalho, usaremos `Serve Http requests using the Acme extension`.

source: Decide on a file name. For this example, we will use `acme-serve-http-requests-tutorial.adoc`:
pt: Escolha um nome para o arquivo. Para este exemplo, utilizaremos `acme-serve-http-requests-tutorial.adoc`:

source: `acme-` will group this guide with other resources related to the acme extension
pt: `acme-` este guia será agrupado com outros recursos relacionados com a extensão acme

source: `serve-http-requests` is a derivative of the document title
pt: `serve-http-requests` é um derivado do título do documento

source: `-tutorial` will indicate that this document is a tutorial (optional)
pt: `-tutorial` indicará que este documento é um tutorial (opcional)

source: `.adoc` to indicate this is an asciidoc file
pt: `.adoc` para indicar que se trata de um arquivo asciidoc

source: Copy the tutorial template
pt: Copiar o modelo de tutorial

source: Copy `docs/src/main/diataxis/_templates/template-tutorial.adoc` from the Quarkus repository into a new file called `acme-serve-http-requests-tutorial.adoc`.
pt: Copie `docs/src/main/diataxis/_templates/template-tutorial.adoc` do repositório Quarkus para um novo arquivo chamado `acme-serve-http-requests-tutorial.adoc`.

source: Update the document header
pt: Atualizar o cabeçalho do documento

source: Serve Http requests using the Acme extension // <2>
pt: Atende pedidos Http usando a extensão Acme // &lt;2&gt;

source: Use the file name as a unique id for the section.
pt: Utilize o nome do arquivo como uma identificação única para a seção.

source: Add the title as a top-level heading.
pt: Adicione o título como um cabeçalho de nível superior.

source: Include additional attributes that help define consistent formatting and provide source portability.
pt: Incluir atributos adicionais que ajudem a definir uma formatação consistente e proporcionem a portabilidade da fonte.

source: Specify the `web` category, as our imaginary extension works with Http requests.
pt: Especifique a categoria `web`, uma vez que a nossa extensão imaginária funciona com pedidos Http.

source: Our imaginary `acme` extension is experimental, so we include the extension status declaration in the header.
pt: A nossa extensão imaginária `acme` é experimental, por isso incluímos a declaração de estado da extensão no cabeçalho.

source: Document Preview
pt: Pré-visualização do documento

source: The preview of your document should contain the chosen title as a styled header at the top of the page.
pt: A pré-visualização do seu documento deve conter o título escolhido como um cabeçalho estilizado no topo da página.

source: Add an abstract
pt: Adicionar um resumo

source: We want to let the readers of our tutorial know what they will achieve by following the steps in the tutorial. This abstract should be concise and should use appropriate verbs (create, build, deploy, ...) to set expectations. They should be able to determine if they want to engage with the content.
pt: Queremos que os leitores do nosso tutorial saibam o que vão conseguir ao seguir os passos do tutorial. Este resumo deve ser conciso e deve utilizar verbos adequados (criar, construir, implementar, ...) para definir expectativas. Os leitores devem ser capazes de determinar se querem envolver-se com o conteúdo.

source: The preview of your document should contain the abstract as a paragraph immediately following the header.
pt: A pré-visualização do seu documento deve conter o resumo como um parágrafo imediatamente a seguir ao cabeçalho.

source: Include extension status descriptive text
pt: Incluir texto descritivo do estado da extensão

source: As the `acme` extension is experimental, we'll include `\{includes}/extension-status.adoc` that provides extension status text. It uses the extension status attribute defined in the header.
pt: Como a extensão `acme` é experimental, incluiremos `{includes}/extension-status.adoc` que fornece o texto de estado da extensão. Utiliza o atributo de estado da extensão definido no cabeçalho.

source: The preview of your document should now include an admonition box below the abstract explaining that the plugin is experimental technology, and describing what can be expected in terms of stability or support for experimental technologies.
pt: A pré-visualização do seu documento deve agora incluir uma caixa de advertência por baixo do resumo, explicando que o plugin é uma tecnologia experimental e descrevendo o que se pode esperar em termos de estabilidade ou suporte para tecnologias experimentais.

source: Define Prerequisites
pt: Definir pré-requisitos

source: We need to tell users what resources are required for completing the tutorial.
pt: Temos de dizer aos usuários quais os recursos necessários para completar o tutorial.

source: Any tutorial describing development activity should use `\{includes}/prerequisites.adoc` to ensure consistent language is used when describing prerequisites. Declared `prerequisites-` attributes can customize the final text.
pt: Qualquer tutorial que descreva a atividade de desenvolvimento deve utilizar `{includes}/prerequisites.adoc` para garantir que é utilizada uma linguagem consistente ao descrever os pré-requisitos. Os atributos declarados de `prerequisites-` podem personalizar o texto final.

source: Declare that our hypothetical tutorial will take about 30 minutes to complete.
pt: Declare que o nosso tutorial hipotético demorará cerca de 30 minutos a ser concluído.

source: Declare that our nonsensical acme extension also requires a container runtime.
pt: Declarar que a nossa extensão acme sem sentido também requer um tempo de execução de contentor.

source: For simplicity in this tutorial, we will avoid GraalVM and Mandrel prerequisites.
pt: Para simplificar este tutorial, evitaremos os pré-requisitos do GraalVM e do Mandrel.

source: Include the common file that provides text describing prerequisites.
pt: Incluir o arquivo comum que fornece o texto que descreve os pré-requisitos.

source: A second level `Prerequistes` heading should immediately follow the extension status box in your document preview. It should state:
pt: Um título de segundo nível `Prerequistes` deve seguir imediatamente a caixa de estado da extensão na pré-visualização do documento. Deve indicar:

source: that this tutorial will take roughly 30 minutes
pt: que este tutorial demorará cerca de 30 minutos

source: that you need an IDE, JDK (with versions), maven (with a placeholder for the maven version), a working container runtime, and (optionally) the Quarkus CLI.
pt: que você precisa de um IDE, JDK (com as versões), Maven (com um espaço reservado para a versão do Maven), um runtime de container funcionando e (opcionalmente) a CLI do Quarkus.

source: Describe the steps for completing the tutorial
pt: Descrever os passos para completar o tutorial

source: There are a few parts to this process. Just remember that each step should conclude with a comprehensible/observable result: "The output should look something like this..."
pt: Há algumas partes neste processo. Lembre-se apenas que cada passo deve terminar com um resultado compreensível/observável: "O resultado deve ser mais ou menos assim..."

source: Define the first step
pt: Definir o primeiro passo

source: Enable section numbering before specifying the header for the first step.
pt: Ativar a numeração de seções antes de especificar o cabeçalho para o primeiro passo.

source: Create a new project // <2>
pt: Criar um novo projeto // <2>

source: Enable section numbering
pt: Ativar a numeração das seções

source: Create a second level heading for the first step
pt: Criar um título de segundo nível para a primeira etapa

source: Describe the step briefly
pt: Descrever brevemente a etapa

source: Define the artifact id (Maven or Gradle)
pt: Definir o ID do artefacto (Maven ou Gradle)

source: List the extensions required by this project
pt: Lista das extensões necessárias para este projeto

source: Use common text to describe how to create a project
pt: Utilizar texto comum para descrever como criar um projeto

source: The document preview should now include a new section called `1. Create a new project`, that contains steps for creating a new project using both the Quarkus CLI and maven.
pt: A pré-visualização do documento deve agora incluir uma nova secção chamada `1. Create a new project`, que contém passos para criar um novo projeto utilizando tanto o Quarkus CLI como o maven.

source: Using a source file
pt: Utilizar um arquivo fonte

source: In this tutorial, we are going to include code from a separate Java file using tags.
pt: Neste tutorial, vamos incluir código de um arquivo Java separado utilizando etiquetas.

source: Consider this an aspirational example. Source is more commonly included directly in the source code block. While there are advantages to including source from Java files, there are details that we have to work out regarding where referenced code should live. Help and ideas are welcome!
pt: Considere isto um exemplo aspiracional. O código fonte geralmente é incluído diretamente no bloco de código. Embora haja vantagens em incluir o código a partir de arquivos Java, ainda precisamos resolver alguns detalhes sobre onde o código referenciado deve ser armazenado. Sugestões e ideias são bem-vindas!

source: Let's create a file called `acme-serve-http-requests-MyAcmeApplication.java`. While this is not a valid Java file name, it does sit nicely next to our tutorial source. We're going to rely on IDE magic for syntax checking.
pt: Vamos criar um arquivo chamado `acme-serve-http-requests-MyAcmeApplication.java`. Embora esse não seja um nome de arquivo Java válido, ele fica bem ao lado da fonte do nosso tutorial. Vamos confiar na magia do IDE para verificação de sintaxe.

source: Let's add the following code to that file:
pt: Vamos adicionar o seguinte código a esse arquivo:

source: There are a few things to notice in this code sample:
pt: Há alguns aspectos a ter em conta neste exemplo de código:

source: AsciiDoc callouts are shown as comments on some lines, and their numbering is not sequential.
pt: As chamadas do AsciiDoc são apresentadas como comentários em algumas linhas e a sua numeração não é sequencial.

source: AsciiDoc content regions are defined by tag pairs (`tag::` and `end::`) in comments surrounding different sections of code.
pt: As regiões de conteúdo do AsciiDoc são definidas por pares de etiquetas ( `tag::` e `end::`) em comentários que envolvem diferentes seções de código.

source: Provide concise subsequent steps
pt: Fornecer etapas subsequentes concisas

source: Let's now instruct the learner to create a simple endpoint using the imaginary `@Anvil` annotation.
pt: Vamos agora instruir o aluno a criar um ponto final simples utilizando a anotação imaginária `@Anvil`.

source: Create a source code file
pt: Criar um arquivo de código fonte

source: We'll start with the steps required to create and add an endpoint to a file.
pt: Começaremos com os passos necessários para criar e adicionar um ponto final a um arquivo.

source: Hello, World! as an Acme REST service
pt: Hello, World! como um serviço Acme REST

source: Some things to notice about these instructions:
pt: Alguns aspectos a ter em conta nestas instruções:

source: We are including code from the source file while using Asciidoc tagged regions to exclude the `goodbye` method from the listing.
pt: Estamos incluindo código do arquivo fonte enquanto utilizamos regiões marcadas Asciidoc para excluir o método `goodbye` da listagem.

source: We put some context around what `@ApplicationScoped` means, without going into details about alternative CDI lifecycles
pt: Contextualizamos o que significa `@ApplicationScoped`, sem entrar em pormenores sobre os ciclos de vida alternativos da CDI

source: We describe what `@Anvil` is providing in the specific case covered by this tutorial.
pt: Descrevemos o que o `@Anvil` está fornecendo no caso específico abrangido por este tutorial.

source: Be careful with the amount of explanation given in a tutorial. Include enough information in the tutorial to help the user determine what other resource (`howto`, `concept`, or `reference`) they should look at next.
pt: Tenha cuidado com a quantidade de explicações dadas num tutorial. Inclua informações suficientes no tutorial para ajudar o utilizador a determinar que outro recurso ( `howto`, `concept` ou `reference`) deve ser consultado a seguir.

source: Your preview should contain a new section, `2. Hello, World! as an Acme REST service` that includes the contents of `src/main/java/org/acme/MyAcmeApplication.java` with the `goodbye` method omitted.
pt: A sua pré-visualização deve conter uma nova secção, `2. Hello, World! as an Acme REST service`, que inclui o conteúdo de `src/main/java/org/acme/MyAcmeApplication.java` com o método `goodbye` omitido.

source: Explore continuous development and test
pt: Explorar o desenvolvimento e teste contínuos

source: It's now time to walk the user through starting Quarkus dev mode. A common include does most of the work for us:
pt: Agora é hora de guiar o usuário para iniciar o modo de desenvolvimento do Quarkus. Um include comum faz a maior parte do trabalho para nós:

source: Dev Mode: Hello, World!
pt: Modo de desenvolvimento: Olá, mundo!

source: $ curl -w "\n" http://localhost:8080/hello Hello, World!
pt: $ curl -w "\n" http://localhost:8080/hello Olá, Mundo!

source: $ curl localhost:8080/hello -d '{"name": "bananas"}' Hello, bananas!
pt: $ curl localhost:8080/hello -d '{"name": "bananas"}' Olá, bananas!

source: We're providing a few things here:
pt: Estamos fornecendo algumas coisas aqui:

source: We're using common text that describes how to start dev mode.
pt: Estamos utilizando um texto comum que descreve como iniciar o modo de desenvolvimento.

source: We describe how to use `curl` to test the output of our defined endpoint.
pt: Descrevemos como utilizar `curl` para testar a saída do nosso ponto final definido.

source: Your preview should contain a new section, "3. Dev Mode: Hello, World!" That section should include three methods of launching Quarkus dev mode (cli, maven, gradle). It should have codeblocks containing curl console commands and output, and instructions for how to exit dev mode.
pt: A pré-visualização deve conter uma nova secção, "3. Modo de desenvolvimento: Olá, Mundo!" Essa secção deve incluir três métodos de lançamento do modo de desenvolvimento do Quarkus (cli, maven, gradle). Deve ter blocos de código contendo comandos de console curl e saída, e instruções sobre como sair do modo de desenvolvimento.

source: Adding tests
pt: Adicionar testes

source: Now let's walk users through adding a test to their application:
pt: Agora vamos orientar os usuários na adição de um teste à sua aplicação:

source: Testing: Hello, World!
pt: Teste: Olá, mundo!

source: We're using Asciidoc region tags to exclude a method from the listing (that we will be adding later).
pt: Estamos utilizando etiquetas de região Asciidoc para excluir um método da listagem (que iremos adicionar mais tarde).

source: Your preview should contain a new section, `4. Testing: Hello, World!` that includes the contents of `src/main/java/org/acme/MyAcmeApplicationTest.java` with the `testGoodbyeEndpoint` method omitted.
pt: A sua pré-visualização deve conter uma nova secção, `4. Testing: Hello, World!`, que inclui o conteúdo de `src/main/java/org/acme/MyAcmeApplicationTest.java` com o método `testGoodbyeEndpoint` omitido.

source: Add additional capabilities
pt: Adicionar capacidades adicionais

source: Let's add another step for creating a different endpoint using the imaginary `@Toaster` annotation, and for providing a corresponding test.
pt: Vamos acrescentar outro passo para criar um ponto final diferente utilizando a anotação imaginária `@Toaster` e para fornecer um teste correspondente.

source: Goodbye, Sweet Planet! Server sent events with Acme
pt: Adeus, Sweet Planet! Eventos enviados pelo servidor com Acme

source: Testing: Goodbye, Sweet Planet!
pt: Testes: Adeus, Doce Planeta!

source: A few things to note:
pt: Alguns aspectos a ter em conta:

source: We're using the AsciiDoc region tag to include only one region of the target file.
pt: Estamos a utilizar a etiqueta de região AsciiDoc para incluir apenas uma região do arquivo de destino.

source: We do not go into detail explaining concepts:
pt: Não entramos em pormenores para explicar conceitos:

source: We talk about what the `@Toaster` annotation is doing in this example.
pt: Falamos sobre o que a anotação `@Toaster` está a fazer neste exemplo.

source: We define the term `Multi` in a way that helps a user find their way to other related materials (How to, Concept, or Reference).
pt: Definimos o termo `Multi` de uma forma que ajuda um utilizador a encontrar o caminho para outros materiais relacionados (Como fazer, Conceito ou Referência).

source: Document preview
pt: Pré-visualização do documento

source: Your preview should now contain two new sections, `5. Goodbye, Sweet Planet! Server sent events with Acme` and `6. Testing: Goodbye, Sweet Planet!`.
pt: A pré-visualização deve agora conter duas novas seções, `5. Goodbye, Sweet Planet! Server sent events with Acme` e `6. Testing: Goodbye, Sweet Planet!`.

source: The two new code listings should be focused on the methods that were omitted before: `goodbye` from `src/main/java/org/acme/MyAcmeApplication.java`, and `testGoodbyeEndpoint` from `src/main/java/org/acme/MyAcmeApplicationTest.java`.
pt: As duas novas listagens de código devem centrar-se nos métodos que foram omitidos anteriormente: `goodbye` de `src/main/java/org/acme/MyAcmeApplication.java`, e `testGoodbyeEndpoint` de `src/main/java/org/acme/MyAcmeApplicationTest.java`.

source: Provide a Summary section
pt: Fornecer uma seção de resumo

source: Summary
pt: Resumo

source: Turn off section numbering
pt: Desativar a numeração das seções

source: Congratulate the user on a job well done!
pt: Felicitar o usuário por um trabalho bem feito!

source: Your preview should now contain an unnumbered `Summary` section.
pt: A pré-visualização deve agora conter uma secção `Summary` não numerada.

source: Congratulations! You have created a tutorial that describes how to create an application that uses annotations of dubious merit from a hypothetical extension.
pt: Parabéns! Criou um tutorial que descreve como criar uma aplicação que utiliza anotações de mérito duvidoso de uma extensão hipotética.

source: Compare your result against the complete worked example:
pt: Compara o teu resultado com o exemplo completo:
