Repository: quarkusio/pt.quarkus.io
Catalog: l10n/po/*/_guides/elasticsearch-dev-services.adoc.po
Languages: es

source: Dev Services for Elasticsearch
es: Servicios de desarrollo para Elasticsearch

source: If any Elasticsearch-related extension is present (e.g. `quarkus-elasticsearch-rest-client` or `quarkus-hibernate-search-orm-elasticsearch`), Dev Services for Elasticsearch automatically starts an Elasticsearch server in dev mode and when running tests. So, you don't have to start a server manually. The application is configured automatically.
es: Si cualquier extensión relacionada con Elasticsearch está presente (por ejemplo, `quarkus-elasticsearch-rest-client` o `quarkus-hibernate-search-orm-elasticsearch`), Dev Services for Elasticsearch inicia automáticamente un servidor de Elasticsearch en modo dev y cuando se ejecutan pruebas. Por lo tanto, no tienes que iniciar un servidor manualmente. La aplicación se configura automáticamente.

source: Enabling / Disabling Dev Services for Elasticsearch
es: Activación/desactivación de los servicios de desarrollo para Elasticsearch

source: Dev Services for Elasticsearch is automatically enabled unless:
es: Los servicios de desarrollo para Elasticsearch se activan automáticamente a menos que:

source: `quarkus.devservices.enabled` is set to `false`.
es: `quarkus.devservices.enabled` se fija en `false`.

source: `quarkus.elasticsearch.devservices.enabled` is set to `false`
es: `quarkus.elasticsearch.devservices.enabled` se ajusta a `false`

source: the hosts property is configured, depending of the extension used it can be:
es: la propiedad hosts está configurada, dependiendo de la extensión utilizada puede ser:

source: Dev Services for Elasticsearch relies on Docker to start the server. If your environment does not support Docker, you will need to start the server manually, or connect to an already running server.
es: Dev Services for Elasticsearch se basa en Docker para iniciar el servidor. Si su entorno no admite Docker, tendrá que iniciar el servidor manualmente o conectarse a un servidor ya en funcionamiento.

source: Shared Elasticsearch
es: Elasticsearch compartido

source: Sometimes you need to share the server between applications. Dev Services for Elasticsearch implements a _service discovery_ mechanism for your multiple Quarkus applications running in _dev_ mode to share a single server.
es: A veces es necesario compartir el servidor entre aplicaciones. Dev Services for Elasticsearch implementa un mecanismo de _descubrimiento de servicios_ para que sus múltiples aplicaciones Quarkus que se ejecutan en modo _dev_ compartan un único servidor.

source: Dev Services for Elasticsearch starts the container with the `quarkus-dev-service-elasticsearch` label which is used to identify the container.
es: Dev Services for Elasticsearch inicia el contenedor con la etiqueta `quarkus-dev-service-elasticsearch` que se utiliza para identificar el contenedor.

source: If you need multiple (shared) servers, you can configure the `quarkus.elasticsearch.devservices.service-name` attribute and indicate the server name. It looks for a container with the same value, or starts a new one if none can be found. The default service name is `elasticsearch`.
es: Si necesitas varios servidores (compartidos), puedes configurar el atributo `quarkus.elasticsearch.devservices.service-name` e indicar el nombre del servidor. Se busca un contenedor con el mismo valor, o se inicia uno nuevo si no se encuentra ninguno. El nombre de servicio por defecto es `elasticsearch`.

source: Sharing is enabled by default in dev mode, but disabled in test mode. You can disable the sharing with `quarkus.elasticsearch.devservices.shared=false`.
es: El uso compartido está activado por defecto en el modo de desarrollo, pero está desactivada en el modo de prueba. Puede desactivar el uso compartido con `quarkus.elasticsearch.devservices.shared=false`.

source: Setting the port
es: Ajuste del puerto

source: By default, Dev Services for Elasticsearch picks a random port and configures the application. You can set the port by configuring the `quarkus.elasticsearch.devservices.port` property.
es: Por defecto, Dev Services for Elasticsearch elige un puerto aleatorio y configura la aplicación. Puedes establecer el puerto configurando la propiedad `quarkus.elasticsearch.devservices.port`.

source: Note that the Elasticsearch hosts property is automatically configured with the chosen port.
es: Tenga en cuenta que la propiedad de hosts de Elasticsearch se configura automáticamente con el puerto elegido.

source: Configuring the image
es: Configuración de la imagen

source: Dev Services for Elasticsearch only support Elasticsearch based images, Opensearch is not supported at the moment.
es: Los servicios de desarrollo para Elasticsearch sólo admiten imágenes basadas en Elasticsearch, Opensearch no es compatible por el momento.

source: Current limitations
es: Limitaciones actuales

source: Currently, only the default backend for Hibernate Search Elasticsearch is supported, because Dev Services for Elasticsearch can only start one Elasticsearch container.
es: Actualmente, sólo se admite el backend predeterminado para Hibernate Search Elasticsearch, porque Dev Services for Elasticsearch sólo puede iniciar un contenedor de Elasticsearch.

source: Configuration reference
es: Referencia de configuración
