Repository: quarkusio/pt.quarkus.io
Catalog: l10n/po/*/_guides/funqy-gcp-functions-http.adoc.po
Languages: pt

source: Funqy HTTP Binding with Google Cloud Functions
pt: Integração HTTP do Funqy com o Google Cloud Functions

source: If you want to allow HTTP clients to invoke your Funqy functions on Google Cloud Functions, Quarkus allows you to expose multiple Funqy functions through HTTP deployed as one Google Cloud Function. This approach does add overhead over the regular Funqy Google Cloud Function integration.
pt: Se você quiser permitir que os clientes HTTP invoquem suas funções Funqy no Google Cloud Functions, o Quarkus permite expor várias funções Funqy por meio de HTTP implantado como um Google Cloud Function. Essa abordagem adiciona uma sobrecarga em relação à integração regular do Funqy com o Google Cloud Function.

source: Follow the xref:gcp-functions-http.adoc[Google Cloud Functions Http Guide]. It walks through using a variety of HTTP frameworks on Google Cloud Functions, including Funqy.
pt: Siga o link:gcp-functions-http.html[Guia de HTTP do Google Cloud Functions]. Ele apresenta o uso de uma variedade de frameworks HTTP no Google Cloud Functions, incluindo o Funqy.

source: The Funqy HTTP + Google Cloud Functions binding is not a replacement for REST over HTTP. Because Funqy needs to be portable across a lot of different protocols and function providers its HTTP binding is very minimalistic and you will lose REST features like linking and the ability to leverage HTTP features like cache-control and conditional GETs. You may want to consider using Quarkus's Jakarta REST, Spring MVC, or Vert.x Web Reactive Route xref:gcp-functions-http.adoc[support] instead. They also work with Quarkus and Google Cloud Functions.
pt: A integração Funqy HTTP + Google Cloud Functions não é um substituto para REST sobre HTTP. Como o Funqy precisa ser portátil em vários protocolos e provedores de funções diferentes, sua vinculação HTTP é muito minimalista e você perderá os recursos REST, como linking e a capacidade de aproveitar os recursos HTTP, como controle de cache e GETs condicionais. Em vez disso, pode considerar usar o link:gcp-functions-http.html[suporte a] Jakarta REST, Spring MVC ou Rota reativa da Web Vert.x do Quarkus. Eles também funcionam com o Quarkus e o Google Cloud Functions.

source: An additional Quickstart
pt: Um Quickstart adicional

source: Beyond generating a Google Cloud Functions project that is covered in the xref:gcp-functions-http.adoc[Google Cloud Functions HTTP Guide], there's also a quickstart for running Funqy HTTP on Google Cloud Functions.
pt: Além de gerar um projeto do Google Cloud Functions que é abordado no link:gcp-functions-http.html[Guia HTTP do Google Cloud Functions], há também um Quickstart para executar o Funqy HTTP no Google Cloud Functions.

source: Clone the Git repository: `git clone {quickstarts-clone-url}`, or download an {quickstarts-archive-url}[archive].
pt: Clone o repositório Git: `git clone {quickstarts-clone-url}`, ou baixe um {quickstarts-archive-url}[arquivo].

source: The solution is located in the `funqy-google-cloud-functions-http-quickstart` link:{quickstarts-tree-url}/funqy-quickstarts/funqy-google-cloud-functions-http-quickstart[directory].
pt: A solução está localizada no link:{quickstarts-tree-url}/funqy-quickstarts/funqy-google-cloud-functions-http-quickstart[diretório] `funqy-google-cloud-functions-http-quickstart`.

source: The Code
pt: O Código

source: There is nothing special about the code and more importantly nothing Google Cloud specific. Funqy functions can be deployed to many environments and Google Cloud Functions is one of them. The Java code is actually the same exact code as the link:{quickstarts-tree-url}/funqy-quickstarts/funqy-http-quickstart[funqy-http-quickstart].
pt: Não há nada de especial no código e, mais importante, nada específico do Google Cloud. As funções Funqy podem ser implantadas em muitos ambientes e o Google Cloud Functions é um deles. O código Java é, na verdade, exatamente o mesmo código do link:{quickstarts-tree-url}/funqy-quickstarts/funqy-http-quickstart[funqy-http-quickstart].

source: Getting Started
pt: Iniciando o projeto

source: The steps to get this quickstart running are exactly the same as defined in the xref:gcp-functions-http.adoc[Google Cloud Functions HTTP Guide]. These differences are that you are running from a quickstart and the Maven dependencies are slightly different.
pt: As etapas para executar este Quickstart são exatamente as mesmas definidas no link:gcp-functions-http.html[Guia HTTP do Google Cloud Functions]. As diferenças são que você está executando a partir de um Quickstart e as dependências do Maven são ligeiramente diferentes.
