Repository: quarkusio/pt.quarkus.io
Catalog: l10n/po/*/_guides/gcp-functions-http.adoc.po
Languages: es

source: Google Cloud Functions (Serverless) with RESTEasy Reactive, Undertow, or Reactive Routes
es: Google Cloud Functions (Serverless) con RESTEasy Reactive, Undertow o Reactive Routes

source: The `quarkus-google-cloud-functions-http` extension allows you to write microservices with RESTEasy Reactive (JAX-RS), Undertow (Servlet), Reactive Routes, or xref:funqy-http.adoc[Funqy HTTP], and make these microservices deployable to the Google Cloud Functions runtime.
es: La extensión `quarkus-google-cloud-functions-http` permite escribir microservicios con RESTEasy Reactive (JAX-RS), Undertow (Servlet), Reactive Routes o xref:funqy-http.html[Funqy HTTP], y hacer que estos microservicios se puedan desplegar en el tiempo de ejecución de Google Cloud Functions.

source: One Google Cloud Functions deployment can represent any number of JAX-RS, Servlet, Reactive Routes, or xref:funqy-http.adoc[Funqy HTTP] endpoints.
es: Una implementación de Google Cloud Functions puede representar cualquier número de endpoints JAX-RS, Servlet, Rutas Reactivas o xref:funqy-http.html[Funqy HTTP].

source: Prerequisites
es: Requisitos previos

source: https://cloud.google.com/[A Google Cloud Account]. Free accounts work.
es: https://cloud.google.com/[Una cuenta de Google Cloud]. Las cuentas gratuitas funcionan.

source: https://cloud.google.com/sdk[Cloud SDK CLI Installed]
es: https://cloud.google.com/sdk[Cloud SDK CLI instalado]

source: Solution
es: Solución

source: This guide walks you through generating a sample project followed by creating three HTTP endpoints written with JAX-RS APIs, Servlet APIs, Reactive Routes, or xref:funqy-http.adoc[Funqy HTTP] APIs. Once built, you will be able to deploy the project to Google Cloud.
es: Esta guía le guiará a través de la generación de un proyecto de ejemplo, seguido de la creación de tres endpoints HTTP escritos con APIs JAX-RS, APIs Servlet, Rutas Reactivas o APIs xref:funqy-http.html[Funqy HTTP]. Una vez construido, podrás desplegar el proyecto en Google Cloud.

source: If you don't want to follow all these steps, you can go right to the completed example.
es: Si no quieres seguir todos estos pasos, puedes ir directamente al ejemplo completo.

source: Clone the Git repository: `git clone {quickstarts-clone-url}`, or download an {quickstarts-archive-url}[archive].
es: Clone el repositorio Git: `git clone {quickstarts-clone-url}` o descargue un {quickstarts-archive-url}[archivo].

source: The solution is located in the `google-cloud-functions-http-quickstart` {quickstarts-tree-url}/google-cloud-functions-http-quickstart[directory].
es: La solución se encuentra en `google-cloud-functions-http-quickstart` {quickstarts-tree-url}/google-cloud-functions-http-quickstart[directorio].

source: Creating the Maven Deployment Project
es: Creación del proyecto de Maven

source: Create an application with the `quarkus-google-cloud-functions-http` extension. You can use the following Maven command to create it:
es: Cree una aplicación con la extensión `quarkus-google-cloud-functions-http`. Puedes utilizar el siguiente comando de Maven para crearla:

source: Login to Google Cloud
es: Iniciar sesión en Google Cloud

source: Creating the endpoints
es: Creación de los endpoints

source: For this example project, we will create four endpoints, one for RESTEasy (JAX-RS), one for Undertow (Servlet), one for Reactive routes and one for xref:funqy-http.adoc[Funqy HTTP].
es: Para este proyecto de ejemplo, crearemos cuatro endpoints, uno para RESTEasy (JAX-RS), uno para Undertow (Servlet), uno para Reactive routes y uno para xref:funqy-http.html[Funqy HTTP].

source: These various endpoints are for demonstration purposes. For real life applications, you should choose one of this technology and stick to it.
es: Estos diferentes endpoints son para fines de demostración. Para las aplicaciones de la vida real, debes elegir una de estas tecnologías y ceñirte a ella.

source: If you don't need endpoints of each type, you can remove the corresponding extensions from your `pom.xml`.
es: Si no necesita endpoints de cada tipo, puede eliminar las extensiones correspondientes de su `pom.xml`.

source: The JAX-RS endpoint
es: El endpoint JAX-RS

source: The Servlet endpoint
es: El endpoints del Servlet

source: The Reactive Routes endpoint
es: El endpoints de las rutas reactivas

source: The Funqy HTTP endpoint
es: El endpoints HTTP de Funqy

source: Build and Deploy to Google Cloud
es: Construir y desplegar en Google Cloud

source: Quarkus forces a packaging of type `uber-jar` for your function as Google Cloud Function deployment requires a single JAR.
es: Quarkus obliga a un empaquetado de tipo `uber-jar` para su función, ya que el despliegue de Google Cloud Function requiere un único JAR.

source: Package your application using the standard `mvn clean package` command. The result of the previous command is a single JAR file inside the `target/deployment` directory that contains the classes and the dependencies of the project.
es: Empaqueta tu aplicación utilizando el comando estándar `mvn clean package`. El resultado del comando anterior es un único archivo JAR dentro del directorio `target/deployment` que contiene las clases y las dependencias del proyecto.

source: Then you will be able to use `gcloud` to deploy your function to Google Cloud.
es: A continuación, podrá utilizar `gcloud` para desplegar su función en Google Cloud.

source: The entry point must always be set to `io.quarkus.gcp.functions.http.QuarkusHttpFunction` as this is the class that integrates Cloud Functions with Quarkus.
es: El punto de entrada debe ser siempre `io.quarkus.gcp.functions.http.QuarkusHttpFunction` ya que esta es la clase que integra las Funciones Cloud con Quarkus.

source: The first time you launch this command, you can have the following error message:
es: La primera vez que se lanza este comando, puede aparecer el siguiente mensaje de error:

source: This means that Cloud Build is not activated yet. To overcome this error, open the URL shown in the error, follow the instructions and then wait a few minutes before retrying the command.
es: Esto significa que Cloud Build aún no está activado. Para superar este error, abra la URL que se muestra en el error, siga las instrucciones y luego espere unos minutos antes de volver a intentar el comando.

source: This command will give you as output a `httpsTrigger.url` that points to your function.
es: Este comando le dará como salida un `httpsTrigger.url` que apunta a su función.

source: You can then call your endpoints via:
es: A continuación, puede llamar a sus endpoints a través de:

source: For JAX-RS: {httpsTrigger.url}/hello
es: Para JAX-RS: {httpsTrigger.url}/hello

source: For servlet: {httpsTrigger.url}/servlet/hello
es: Para el servlet: {httpsTrigger.url}/servlet/hello

source: For Reactive Routes: {httpsTrigger.url}/vertx/hello
es: Para las rutas reactivas: {httpsTrigger.url}/vertx/hello

source: For Funqy: {httpsTrigger.url}/funqy
es: Para Funqy: {httpsTrigger.url}/funqy

source: Testing locally
es: Pruebas locales

source: The easiest way to locally test your function is using the Cloud Function invoker JAR.
es: La forma más fácil de probar localmente su función es utilizando el JAR invocador de funciones en la nube.

source: You can download it via Maven using the following command:
es: Puede descargarlo a través de Maven utilizando el siguiente comando:

source: Before using the invoker, you first need to build your function via `mvn package`.
es: Antes de utilizar el invocador, primero hay que construir la función a través de `mvn package`.

source: Then you can use it to launch your function locally.
es: A continuación, puede utilizarlo para lanzar su función localmente.

source: The `--classpath` parameter needs to be set to the previously packaged JAR that contains your function class and all Quarkus related classes.
es: El parámetro `--classpath` necesita ser establecido en el JAR previamente empaquetado que contiene su clase de función y todas las clases relacionadas con Quarkus.

source: Your endpoints will be available on http://localhost:8080.
es: Sus endpoints estarán disponibles en http://localhost:8080.

source: What's next?
es: ¿Qué es lo siguiente?
