Repository: quarkusio/pt.quarkus.io
Catalog: l10n/po/*/_guides/getting-started.adoc.po
Languages: pt_br

source: What's next?
pt_br: E agora, o que vem por aí?

source: This guide covered the creation of an application using Quarkus. However, there is much more. We recommend continuing the journey by creating xref:getting-started-dev-services.adoc[your second Quarkus application], with dev services and persistence. You can learn about creating a native executable and packaging it in a container with the xref:building-native-image.adoc[building a native executable guide]. If you are interested in reactive, we recommend the xref:getting-started-reactive.adoc[getting started with reactive guide], where you can see how to implement reactive applications with Quarkus.
pt_br: Este guia abordou a criação de um aplicativo usando o Quarkus. No entanto, há muito mais pela frente. Recomendamos continuar a jornada criando sua segunda aplicação Quarkus, com serviços de desenvolvimento e persistência. xref:getting-started-dev-services.adoc[seu segundo aplicativo Quarkus], Você pode aprender sobre a criação de um executável nativo e empacotá-lo em um contêiner com o guia de criação de um executável nativo xref:building-native-image.adoc[guia de criação de um executável nativo]. Se você estiver interessado em reatividade, sugerimos o xref:getting-started-reactive.adoc[guia de início com reatividade], onde você pode ver como implementar aplicações reativas com o Quarkus.

source: In addition, the xref:tooling.adoc[tooling guide] document explains how to:
pt_br: Além disso, o documento link:tooling.html[do guia de ferramentas] explica como:

source: scaffold a project in a single command line
pt_br: montar um projeto com uma única linha de comando

source: enable the _development mode_ (hot reload)
pt_br: ativar o _modo de desenvolvimento_ (hot reload)

source: import the project in your favorite IDE
pt_br: importar o projeto no seu IDE favorito

source: and more
pt_br: e muito mais…
