Repository: quarkusio/pt.quarkus.io
Catalog: l10n/po/*/_guides/grpc-xds.adoc.po
Languages: es, pt

source: Using xDS gRPC
es: Uso de xDS gRPC
pt: Usando o xDS gRPC

source: This page explains how to enable xDS gRPC usage in your Quarkus application.
es: Esta página explica cómo habilitar el uso de xDS gRPC en su aplicación Quarkus.
pt: Esta página explica como habilitar o uso do gRPC xDS em sua aplicação Quarkus.

source: This Quarkus xDS gRPC integration currently doesn't support building native executables due to the issues with shaded grpc-netty library while running native IT tests.
es: Esta integración Quarkus xDS gRPC actualmente no admite la construcción de ejecutables nativos debido a los problemas con la biblioteca grpc-netty sombreado durante la ejecución de pruebas nativas de TI.
pt: Atualmente, essa integração Quarkus xDS gRPC não suporta a construção de executáveis nativos devido a problemas com a biblioteca grpc-netty sombreada ao executar testes de integração nativos.

source: Configuring your project
es: Configurar el proyecto
pt: Configurando seu projeto

source: Add the Quarkus gRPC xDS extension to your build file:
es: Añada la extensión Quarkus gRPC xDS a su archivo de construcción:
pt: Adicione a extensão Quarkus gRPC xDS ao arquivo de compilação do seu projeto:

source: This transitively adds `io.quarkus:quarkus-grpc` extension dependency.
es: Esto añade transitoriamente la dependencia de la extensión `io.quarkus:quarkus-grpc`.
pt: Isso adiciona de forma transitiva a dependência da extensão `io.quarkus:quarkus-grpc`.

source: Server configuration
es: Configuración del servidor
pt: Configurando servidor

source: Server configuration example
es: Ejemplo de configuración del servidor
pt: Exemplo de configuração do servidor

source: To enable server xDS, use the following configuration.
es: Para activar el servidor xDS, utilice la siguiente configuración.
pt: Para habilitar o servidor xDS, utilize a seguinte configuração:

source: xDS must be explicitly enabled on the server, then verify you use it on the right xDS server port (default is 9000). If you want to use `XdsServerCredentials` set `xds.secure` to `true`.
es: xDS debe estar explícitamente habilitado en el servidor, luego verifique que lo usa en el puerto correcto del servidor xDS (por defecto es 9000). Si desea utilizar `XdsServerCredentials` ajuste `xds.secure` a `true`.
pt: O xDS deve estar explicitamente habilitado no servidor e, em seguida, verifique se você o usa na porta correta do servidor xDS (o padrão é 9000). Se você quiser usar `XdsServerCredentials`, defina `xds.secure` como `true`.

source: When xDS is configured, `plain-text` is automatically disabled.
es: Cuando se configura xDS, `plain-text` se desactiva automáticamente.
pt: Quando o xDS está configurado, o modo "plain-text" é automaticamente desabilitado.

source: Client configuration
es: Configuración del cliente
pt: Configurando cliente

source: When xDS target property is used, name resolver, host, and port are not used
es: Cuando se utiliza la propiedad de destino xDS, no se utilizan los datos de resolución de nombres, host y puerto
pt: Quando a propriedade de destino do xDS é utilizada, o resolvedor de nomes, host e porta não são utilizados.

source: Client configuration example
es: Ejemplo de configuración de cliente
pt: Exemplo de configuração do cliente

source: To enable client xDS, use the following configuration.
es: Para activar xDS de cliente, utilice la siguiente configuración.
pt: Para ativar o xDS do cliente, utilize a seguinte configuração:

source: You can either explicitly enable xDS or you use `xds` name resolver, and make sure you point it to the right xDS server port (default is 9000). If you want to use `XdsChannelCredentials` set `xds.secure` to `true`.
es: Puede habilitar xDS explícitamente o utilizar `xds` name resolver, y asegúrese de apuntarlo al puerto correcto del servidor xDS (por defecto es 9000). Si desea utilizar `XdsChannelCredentials` ajuste `xds.secure` a `true`.
pt: Você pode tanto habilitar explicitamente o xDS quanto utilizar o name resolver `xds`, assegurando-se de configurá-lo para a porta correta do servidor xDS (o default é 9000). Se desejar utilizar `XdsChannelCredentials`, defina `xds.secure` como `true`.

source: Kubernetes configuration example
es: Ejemplo de configuración de Kubernetes
pt: Exemplo de configuração do Kubernetes

source: Below is an example of (required) additional configuration when using xDS gRPC with the Istio Service Mesh in Kubernetes.
es: A continuación se muestra un ejemplo de configuración adicional (necesaria) cuando se utiliza xDS gRPC con Istio Service Mesh en Kubernetes.
pt: Abaixo está um exemplo de configuração adicional (obrigatória) ao usar xDS gRPC com o Istio Service Mesh no Kubernetes.
