Repository: quarkusio/pt.quarkus.io
Catalog: l10n/po/*/_guides/kafka-dev-services.adoc.po
Languages: es, pt

source: Dev Services for Kafka
es: Servicios de desarrollo para Kafka
pt: Dev Services para o Kafka

source: If any Kafka-related extension is present (e.g. `quarkus-smallrye-reactive-messaging-kafka`), Dev Services for Kafka automatically starts a Kafka broker in dev mode and when running tests. So, you don't have to start a broker manually. The application is configured automatically.
es: Si hay alguna extensión relacionada con Kafka (por ejemplo, `quarkus-smallrye-reactive-messaging-kafka`), Dev Services for Kafka inicia automáticamente un broker de Kafka en modo dev y al ejecutar pruebas. Por lo tanto, no es necesario iniciar un broker manualmente. La aplicación se configura automáticamente.
pt: Se qualquer extensão relacionada ao Kafka estiver presente (por exemplo, `quarkus-smallrye-reactive-messaging-kafka`), o Dev Services para Kafka iniciará automaticamente um broker Kafka no modo de desenvolvimento e ao executar testes. Portanto, não é necessário iniciar um broker manualmente. A aplicação é configurada de forma automática.

source: Because starting a Kafka broker can be long, Dev Services for Kafka uses https://vectorized.io/redpanda[Redpanda], a Kafka compatible broker which starts in ~1 second.
es: Dado que el inicio de un broker de Kafka puede ser largo, Dev Services for Kafka utiliza https://vectorized.io/redpanda[Redpanda], un broker compatible con Kafka que se inicia en ~1 segundo.
pt: Como a inicialização de um broker Kafka pode ser demorada, o Dev Services para o Kafka usa o link:https://vectorized.io/redpanda[Redpanda], um broker compatível com o Kafka que inicia em aproximadamente 1 segundo.

source: Enabling / Disabling Dev Services for Kafka
es: Activación/desactivación de los servicios de desarrollo para Kafka
pt: Ativar/desativar Dev Services para o Kafka

source: Dev Services for Kafka is automatically enabled unless:
es: Los servicios de desarrollo para Kafka se activan automáticamente a menos que:
pt: Os Dev Services para o Kafka é ativado automaticamente, a menos que:

source: `quarkus.kafka.devservices.enabled` is set to `false`
es: `quarkus.kafka.devservices.enabled` se ajusta a `false`
pt: `quarkus.kafka.devservices.enabled` esteja definido como `false`

source: the `kafka.bootstrap.servers` is configured
es: el `kafka.bootstrap.servers` está configurado
pt: o `kafka.bootstrap.servers` esteja configurado

source: all the Reactive Messaging Kafka channels have the `bootstrap.servers` attribute set
es: todos los canales de Kafka de Mensajería Reactiva tienen el atributo `bootstrap.servers` establecido
pt: todos os canais Kafka de mensagens reativas tenham o atributo `bootstrap.servers` definido

source: Dev Services for Kafka relies on Docker to start the broker. If your environment does not support Docker, you will need to start the broker manually, or connect to an already running broker. You can configure the broker address using `kafka.bootstrap.servers`.
es: Dev Services for Kafka se basa en Docker para iniciar el broker. Si su entorno no soporta Docker, tendrá que iniciar el broker manualmente, o conectarse a un broker ya en funcionamiento. Puede configurar la dirección del broker utilizando `kafka.bootstrap.servers`.
pt: O Dev Services para o Kafka depende do Docker para iniciar o broker. Se o seu ambiente não for compatível com o Docker, terá de iniciar o broker manualmente ou conectar-se a um broker já em execução. É possível configurar o endereço do broker usando `kafka.bootstrap.servers`.

source: Shared broker
es: Broker compartido
pt: broker compartilhado

source: Most of the time you need to share the broker between applications. Dev Services for Kafka implements a _service discovery_ mechanism for your multiple Quarkus applications running in _dev_ mode to share a single broker.
es: La mayoría de las veces se necesita compartir el broker entre aplicaciones. Dev Services for Kafka implementa un mecanismo de _descubrimiento de servicios_ para que sus múltiples aplicaciones Quarkus que se ejecutan en modo _dev_ compartan un único broker.
pt: Na maioria das vezes, é necessário compartilhar o broker entre as aplicações. O Dev Services para o Kafka implementa um mecanismo de _descoberta de serviços_ para que seus vários aplicativos Quarkus em execução no _modo_ de _desenvolvimento_ compartilhem um único broker.

source: Dev Services for Kafka starts the container with the `quarkus-dev-service-kafka` label which is used to identify the container.
es: Dev Services for Kafka inicia el contenedor con la etiqueta `quarkus-dev-service-kafka` que se utiliza para identificar el contenedor.
pt: O Dev Services para o Kafka inicia o broker com a etiqueta `quarkus-dev-service-kafka` que é utilizada para identificar o container.

source: If you need multiple (shared) brokers, you can configure the `quarkus.kafka.devservices.service-name` attribute and indicate the broker name. It looks for a container with the same value, or starts a new one if none can be found. The default service name is `kafka`.
es: Si necesitas varios brokers (compartidos), puedes configurar el atributo `quarkus.kafka.devservices.service-name` e indicar el nombre del broker. Se busca un contenedor con el mismo valor, o se inicia uno nuevo si no se encuentra ninguno. El nombre de servicio por defecto es `kafka`.
pt: Se você precisar de vários brokers (compartilhados), você pode configurar o atributo `quarkus.kafka.devservices.service-name` e indicar o nome do broker. Este procura um container com o mesmo valor ou inicia um novo se não for encontrado nenhum. O nome de serviço predefinido é `kafka`.

source: Sharing is enabled by default in dev mode, but disabled in test mode. You can disable the sharing with `quarkus.kafka.devservices.shared=false`.
es: El uso compartido está activado por defecto en el modo de desarrollo, pero está desactivado en el modo de prueba. Puede desactivar el uso compartido con `quarkus.kafka.devservices.shared=false`.
pt: O compartilhamento é ativado por padrão no modo de desenvolvimento, mas desativado no modo de teste. Você pode desativar o compartilhamento com `quarkus.kafka.devservices.shared=false`.

source: Setting the port
es: Ajuste del puerto
pt: Definindo a porta

source: By default, Dev Services for Kafka picks a random port and configures the application. You can set the port by configuring the `quarkus.kafka.devservices.port` property.
es: Por defecto, Dev Services for Kafka elige un puerto aleatorio y configura la aplicación. Puedes establecer el puerto configurando la propiedad `quarkus.kafka.devservices.port`.
pt: Por padrão, o Dev Services para o Kafka escolhe uma porta aleatória e configura o aplicativo. Você pode definir a porta configurando a propriedade `quarkus.kafka.devservices.port`.

source: Note that the Kafka advertised address is automatically configured with the chosen port.
es: Tenga en cuenta que la dirección anunciada de Kafka se configura automáticamente con el puerto elegido.
pt: Note que o endereço anunciado do Kafka é automaticamente configurado com a porta escolhida.

source: Configuring the image
es: Configuración de la imagen
pt: Configurando a imagem

source: Dev Services for Kafka supports https://redpanda.com[Redpanda], https://github/ozangunalp/kafka-native[kafka-native] and https://strimzi.io[Strimzi] (in https://github.com/apache/kafka/blob/trunk/config/kraft/README.md[Kraft] mode) images.
pt: O Dev Services para o Kafka suporta imagens link:https://redpanda.com[Redpanda], link:https://github/ozangunalp/kafka-native[kafka-native] e link:https://strimzi.io[Strimzi] (no modo link:https://github.com/apache/kafka/blob/trunk/config/kraft/README.md[Kraft] ).

source: **Redpanda** is a Kafka compatible event streaming platform. Because it provides a fast startup times, dev services defaults to Redpanda images from `vectorized/redpanda`. You can select any version from https://hub.docker.com/r/vectorized/redpanda.
pt: *Redpanda* é uma plataforma de streaming de eventos compatível com o Kafka. Uma vez que proporciona tempos de startup rápidos, o Dev services têm como padrão as imagens Redpanda de `vectorized/redpanda`. Pode selecionar qualquer versão de https://hub.docker.com/r/vectorized/redpanda

source: **kafka-native** provides images of standard Apache Kafka distribution compiled to native binary using Quarkus and GraalVM. While still being _experimental_, it provides very fast startup times with small footprint.
pt: *kafka-native* fornece imagens da distribuição padrão do Apache Kafka compiladas para binário nativo usando Quarkus e GraalVM. Embora ainda esteja em fase _experimental_, fornece tempos de startup muito rápidos e com consumo reduzido.

source: Image type can be configured using
pt: O tipo da imagem pode ser configurado utilizando

source: **Strimzi** provides container images and Operators for running Apache Kafka on Kubernetes. While Strimzi is optimized for Kubernetes, the images work perfectly in classic container environments. Strimzi container images run "genuine" Kafka broker on JVM, which is slower to start.
pt: *O Strimzi* fornece imagens de container e Operadores para executar o Apache Kafka no Kubernetes. Embora o Strimzi seja otimizado para Kubernetes, as imagens funcionam perfeitamente em ambientes de container clássicos. As imagens de container do Strimzi rodam o broker Kafka "genuíno" na JVM, que é mais lento para iniciar.

source: For Strimzi, you can select any image with a Kafka version which has Kraft support (2.8.1 and higher) from https://quay.io/repository/strimzi-test-container/test-container?tab=tags
es: Para Strimzi, puede seleccionar cualquier imagen con una versión de Kafka que tenga soporte para Kraft (2.8.1 y superior) desde https://quay.io/repository/strimzi-test-container/test-container?tab=tags
pt: Para o Strimzi, você pode selecionar qualquer imagem com uma versão Kafka que tenha suporte para o Kraft (2.8.1 e superior) em https://quay.io/repository/strimzi-test-container/test-container?tab=tags

source: Configuring Kafka topics
es: Configuración de los temas de Kafka
pt: Configurando os tópicos no Kafka

source: You can configure the Dev Services for Kafka to create topics once the broker is started. Topics are created with given number of partitions and 1 replica.
es: Se puede configurar el Dev Services for Kafka para que cree temas una vez que se inicie el broker. Los temas se crean con un número determinado de particiones y 1 réplica.
pt: Você pode configurar os Dev Services para o Kafka para criar tópicos assim que o broker for iniciado. Os tópicos são criados com um determinado número de partições e uma réplica.

source: You can configure timeout for Kafka admin client calls used in topic creation using `quarkus.kafka.devservices.topic-partitions-timeout`, it defaults to 2 seconds.
es: Puede configurar el tiempo de espera para las llamadas del cliente Kafka admin utilizadas en la creación de temas utilizando `quarkus.kafka.devservices.topic-partitions-timeout`, por defecto es de 2 segundos.
pt: Você pode configurar o tempo limite para as chamadas do client admin do Kafka utilizadas na criação de tópicos utilizando `quarkus.kafka.devservices.topic-partitions-timeout`. A predefinição é de 2 segundos.

source: Transactional and Idempotent producers support
pt: Suporte aos producers transacionais e idempotentes

source: By default, the Red Panda broker is configured to enable transactions and idempotence features. You can disable those using:
pt: Por padrão, o broker do Red Panda está configurado para ativar as funcionalidades de transações e idempotência. Você pode desativá-las utilizando:

source: Redpanda transactions does not support exactly-once processing.
pt: As transações Redpanda não suportam um processamento exatamente único.

source: Dev Services for Kafka supports https://redpanda.com[Redpanda] and https://strimzi.io[Strimzi] (in https://github.com/apache/kafka/blob/trunk/config/kraft/README.md[Kraft] mode).
es: Dev Services for Kafka soporta htps://redpanda.com[Redpanda] y link:https://strimzi.io[Strimzi] (en modo https://github.com/apache/kafka/blob/trunk/config/kraft/README.md[Kraft] ).

source: Redpanda is a Kafka compatible event streaming platform. Because it provides a faster startup time dev services defaults to `vectorized/redpanda` images. You can select any version from https://hub.docker.com/r/vectorized/redpanda.
es: Redpanda es una plataforma de streaming de eventos compatible con Kafka. Debido a que proporciona un tiempo de inicio más rápido los servicios de dev por defecto a `vectorized/redpanda` imágenes. Puedes seleccionar cualquier versión de https://hub.docker.com/r/vectorized/redpanda.

source: Strimzi provides container images and Operators for running Apache Kafka on Kubernetes. While Strimzi is optimized for Kubernetes, the images work perfectly in classic container environments. Strimzi container images run "genuine" Kafka broker on JVM, which is slower to start.
es: Strimzi proporciona imágenes de contenedores y operadores para ejecutar Apache Kafka en Kubernetes. Aunque Strimzi está optimizado para Kubernetes, las imágenes funcionan perfectamente en entornos de contenedores clásicos. Las imágenes de contenedor de Strimzi ejecutan el broker de Kafka "genuino" en la JVM, que es más lenta de arrancar.

source: The following example creates a topic named `test` with 3 partitions, and a second topic named `messages` with 2 partitions.
es: El siguiente ejemplo crea un tema llamado `test` con 3 particiones, y un segundo tema llamado `messages` con 2 particiones.

source: If a topic already exists with the given name, the creation is skipped, without trying to re-partition the existing topic to a different number of partitions.
es: Si ya existe un tema con el nombre dado, se salta la creación, sin intentar volver a particionar el tema existente a un número diferente de particiones.
