Repository: quarkusio/pt.quarkus.io
Catalog: l10n/po/*/_guides/kogito-dev-services.adoc.po
Languages: es

source: Dev Services for Kogito
es: Servicios de desarrollo para Kogito

source: If any Kogito process-related extension is present (e.g. `kogito-quarkus` or `kogito-quarkus-processes`), Dev Services for Kogito automatically starts a Data Index in dev mode. So, you don't have to start it manually or have any other service set-up manually. The application is configured automatically, meaning that will replicate any Kogito messaging events related to Process Instances and User Tasks into the provisioned Data Index instance.
es: Si hay alguna extensión relacionada con el proceso de Kogito (por ejemplo, `kogito-quarkus` o `kogito-quarkus-processes`), Dev Services for Kogito inicia automáticamente un índice de datos en modo dev. Por lo tanto, no es necesario iniciarlo manualmente ni tener ningún otro servicio configurado manualmente. La aplicación se configura automáticamente, lo que significa que replicará cualquier evento de mensajería de Kogito relacionado con las Instancias de Proceso y las Tareas de Usuario en la instancia de Data Index aprovisionada.

source: For more details about how to query data about processes and user tasks, please visit https://docs.kogito.kie.org/latest/html_single/#ref-data-index-service-queries_kogito-configuring[Kogito Data Index documentation].
es: Para más detalles sobre cómo consultar los datos de los procesos y las tareas de los usuarios, visite https://docs.kogito.kie.org/latest/html_single/#ref-data-index-service-queries_kogito-configuring[la documentación de Kogito Data Index].

source: Enabling / Disabling Dev Services for Kogito
es: Activación/desactivación de los servicios de desarrollo para Kogito

source: Dev Services for Kogito is automatically enabled unless:
es: Los servicios de desarrollo para Kogito se activan automáticamente a menos que:

source: `quarkus.kogito.devservices.enabled` is set to `false`
es: `quarkus.kogito.devservices.enabled` se ajusta a `false`

source: Dev Services for Kogito relies on Docker to start the broker. If your environment does not support Docker, you will need to start the broker manually, or connect to an already running Data Index.
es: Dev Services for Kogito se basa en Docker para iniciar el broker. Si su entorno no es compatible con Docker, tendrá que iniciar el broker manualmente o conectarse a un Data Index ya en funcionamiento.

source: Shared Data Index
es: Índice de datos compartidos

source: In case you would like to share the Data Index instance between applications. Dev Services for Kogito implements a _service discovery_ mechanism for your multiple Quarkus applications running in _dev_ mode to share a single instance.
es: En caso de que quiera compartir la instancia de Data Index entre aplicaciones. Dev Services for Kogito implementa un mecanismo de _descubrimiento de servicios_ para que sus múltiples aplicaciones Quarkus que se ejecutan en modo _dev_ compartan una única instancia.

source: Dev Services for Kogito starts the container with the `kogito-dev-service-data-index` label which is used to identify the container.
es: Dev Services for Kogito inicia el contenedor con la etiqueta `kogito-dev-service-data-index` que se utiliza para identificar el contenedor.

source: If you need multiple (shared) Data Index instances, you can configure the `quarkus.kogito.devservices.service-name` attribute and indicate the instance name. It looks for a container with the same value, or starts a new one if none can be found. The default service name is `kogito-data-index`.
es: Si necesita varias instancias (compartidas) de Data Index, puede configurar el atributo `quarkus.kogito.devservices.service-name` e indicar el nombre de la instancia. Se busca un contenedor con el mismo valor, o se inicia uno nuevo si no se encuentra ninguno. El nombre de servicio por defecto es `kogito-data-index`.

source: Sharing is enabled by default in dev mode. You can disable the sharing with `quarkus.kogito.devservices.shared=false`.
es: El uso compartido está activado por defecto en el modo dev. Puede desactivar el uso compartido con `quarkus.kogito.devservices.shared=false`.

source: Setting the port
es: Ajuste del puerto

source: By default, Dev Services for Kogito starts a Data Index using port 8180. You can set the port by configuring the `quarkus.kogito.devservices.port` property.
es: Por defecto, Dev Services for Kogito inicia un índice de datos utilizando el puerto 8180. Puede establecer el puerto configurando la propiedad `quarkus.kogito.devservices.port`.

source: Configuring the image
es: Configuración de la imagen

source: Dev Services for Kogito uses: `kiegroup/kogito-data-index-ephemeral` images. You can select any version from https://quay.io/repository/kiegroup/kogito-data-index-ephemeral?tab=tags.
es: Los servicios de desarrollo para Kogito utilizan: `kiegroup/kogito-data-index-ephemeral` images. Puede seleccionar cualquier versión de https://quay.io/repository/kiegroup/kogito-data-index-ephemeral?tab=tags.

source: References
es: Referencias

source: https://docs.kogito.kie.org/latest/html_single/[Kogito Documentation]
es: https://docs.kogito.kie.org/latest/html_single/[Documentación de Kogito]
