Repository: quarkusio/pt.quarkus.io
Catalog: l10n/po/*/_guides/kubernetes-dev-services.adoc.po
Languages: pt

source: Dev Services for Kubernetes
pt: Dev Services para Kubernetes

source: Dev Services for Kubernetes automatically starts a Kubernetes API server in dev mode and when running tests. So you don't have to start a Kubernetes cluster manually. The application is configured automatically.
pt: O Dev Services para Kubernetes inicia automaticamente um servidor de API do Kubernetes no modo de desenvolvimento e ao executar testes. Assim, não é necessário iniciar um cluster do Kubernetes manualmente. A aplicação é configurada de forma automática.

source: Enabling / Disabling Dev Services for Kubernetes
pt: Ativar/desativar Dev Services para Kubernetes

source: Dev Services for Kubernetes is automatically enabled unless:
pt: O Dev Services para Kubernetes é ativado automaticamente, a menos que:

source: `quarkus.kubernetes-client.devservices.enabled` is set to `false`
pt: `quarkus.kubernetes-client.devservices.enabled` esteja definido como `false`

source: the `api-server-url` is configured
pt: a URL `api-server-url` esteja configurada

source: a valid Kube config file is found and `quarkus.kubernetes-client.devservices.override-kubeconfig` is not set to `true`
pt: um arquivo de configuração Kube válido seja encontrado e `quarkus.kubernetes-client.devservices.override-kubeconfig` não está definido como `true`

source: you include the `quarkus-test-kubernetes-client` dependency
pt: você inclua a dependência `quarkus-test-kubernetes-client`

source: Dev Services for Kubernetes relies on Docker to start the API server. If your environment does not support Docker, you will need to start the Kubernetes cluster manually, or connect to an already running Kubernetes cluster. You can configure the Kubernetes cluster access using either a Kube config file or the various properties available in the https://github.com/quarkusio/quarkus/blob/main/extensions/kubernetes-client/runtime-internal/src/main/java/io/quarkus/kubernetes/client/runtime/KubernetesClientBuildConfig.java[KubernetesClientBuildConfig] class.
pt: O Dev Services para Kubernetes depende do Docker para iniciar o servidor de API. Se o seu ambiente não suportar o Docker, terá de iniciar o cluster Kubernetes manualmente ou conectar-se a um cluster Kubernetes já em execução. É possível configurar o acesso ao cluster do Kubernetes usando um arquivo de configuração do Kube ou as várias propriedades disponíveis na classe link:https://github.com/quarkusio/quarkus/blob/main/extensions/kubernetes-client/runtime-internal/src/main/java/io/quarkus/kubernetes/client/runtime/KubernetesClientBuildConfig.java[KubernetesClientBuildConfig].

source: Shared cluster
pt: Cluster compartilhado

source: Most of the time you need to share the cluster between applications. Dev Services for Kubernetes implements a _service discovery_ mechanism for your multiple Quarkus applications running in dev mode to share a single cluster.
pt: Na maioria das vezes, é necessário compartilhar o cluster entre aplicações. O Dev Services para Kubernetes implementa um mecanismo de _service discovery_ para que suas várias aplicações Quarkus em execução no _dev_ mode_ compartilhem um único cluster.

source: Dev Services for Kubernetes starts the container with the `quarkus-dev-service-kubernetes` label which is used to identify the container.
pt: O Dev Services para Kubernetes inicia o container com a etiqueta `quarkus-dev-service-kubernetes` que é utilizada para identificar o container.

source: If you need multiple (shared) clusters, you can configure the `quarkus.kubernetes-client.devservices.service-name` configuration property and indicate the cluster name. It looks for a container with the name defined, or starts a new one if none can be found. The default service name is `kubernetes`.
pt: Se você precisar de vários clusters (compartilhados), você pode configurar a propriedade de configuração `quarkus.kubernetes-client.devservices.service-name` e indicar o nome do cluster. Esta buscará um container com o nome definido ou iniciar um novo se não for encontrado nenhum. O nome do serviço predefinido é `kubernetes`.

source: Sharing is enabled by default in dev mode, but disabled in test mode. You can disable the sharing with `quarkus.kubernetes-client.devservices.shared=false`.
pt: O compartilhamento está habilitado por padrão no modo de desenvolvimento, mas desabilitado no modo de teste. Você pode desabilitar o compartilhamento com `quarkus.kubernetes-client.devservices.shared=false`.

source: Configuring the cluster
pt: Configurando o cluster

source: Dev Services for Kubernetes provides three different flavors of Kubernetes cluster. Each flavor supports different Kubernetes API versions. You can configure the flavor and version using the `quarkus.kubernetes-client.devservices.flavor` and `quarkus.kubernetes-client.devservices.api-version` properties:
pt: O Dev Services para Kubernetes oferece três variantes diferentes de cluster Kubernetes. Cada variante suporta diferentes versões da API do Kubernetes. Você pode configurar a variante e a versão usando as propriedades quarkus.kubernetes-client.devservices.flavor e quarkus.kubernetes-client.devservices.api-version:

source: `api-only` only starts a Kubernetes API Server. If you need a fully-featured Kubernetes cluster that can spin up Pods, you can use `k3s` or `kind`. Note that they both requires to run in Docker privileged mode.
pt: 'api-only' inicia apenas um Servidor de API Kubernetes. Se você precisa de um cluster Kubernetes totalmente funcional que possa criar Pods, você pode usar k3s ou kind. Observe que ambos requerem que sejam executados em modo privilegiado do Docker.

source: If `api-version` is not set, the latest version for the given flavor will be used. Otherwise, the version must match a https://github.com/dajudge/kindcontainer/blob/master/k8s-versions.json[version supported by the given flavor].
pt: Se a api-version não estiver definida, a versão mais recente para a variante fornecido será usada. Caso contrário, a versão deve corresponder a uma https://github.com/dajudge/kindcontainer/blob/master/k8s-versions.json[versão suportada pela variante fornecida].
