Repository: quarkusio/pt.quarkus.io
Catalog: l10n/po/*/_guides/kubernetes-config.adoc.po
Languages: es

source: Kubernetes Config
es: Configuración de Kubernetes

source: Configuration
es: Configuración

source: Once you have your Quarkus project configured you can add the `kubernetes-config` extension by running the following command in your project base directory.
es: Una vez que tenga configurado su proyecto Quarkus, puede añadir la extensión `kubernetes-config` ejecutando el siguiente comando en el directorio base de su proyecto.

source: This will add the following to your build file:
es: Esto añadirá lo siguiente a su archivo de construcción:

source: Usage
es: Uso

source: The extension works by reading ConfigMaps and Secrets directly from the Kubernetes API server using the xref:kubernetes-client.adoc[Kubernetes Client].
es: La extensión funciona leyendo ConfigMaps y Secretos directamente desde el servidor de la API de Kubernetes utilizando el xref:kubernetes-client.html[Cliente Kubernetes].

source: The extension understands the following types of ConfigMaps and Secrets as input sources:
es: La extensión entiende los siguientes tipos de ConfigMaps y Secretos como fuentes de entrada:

source: ConfigMaps and Secrets that contain literal data (see https://kubernetes.io/docs/tasks/configure-pod-container/configure-pod-configmap/#create-configmaps-from-literal-values[this] for an example on how to create one)
es: ConfigMaps y Secretos que contienen datos literales (vea https://kubernetes.io/docs/tasks/configure-pod-container/configure-pod-configmap/#create-configmaps-from-literal-values[esto] para un ejemplo sobre cómo crear uno)

source: ConfigMaps and Secrets created from files named `application.properties`, `application.yaml` or `application.yml` (see https://kubernetes.io/docs/tasks/configure-pod-container/configure-pod-configmap/#create-configmaps-from-files[this] for an example on how to create one).
es: ConfigMaps y Secretos creados a partir de archivos denominados `application.properties`, `application.yaml` o `application.yml` (ver https://kubernetes.io/docs/tasks/configure-pod-container/configure-pod-configmap/#create-configmaps-from-files[aquí] un ejemplo de cómo crear uno).

source: The extension is disabled by default in order to prevent the application for making API calls when it is not running in a Kubernetes environment. To enable it, set `quarkus.kubernetes-config.enabled=true` (for example using a specific xref:config-reference.adoc#profiles[profile]).
es: La extensión está desactivada por defecto para evitar que la aplicación realice llamadas a la API cuando no se ejecuta en un entorno Kubernetes. Para habilitarla, configure `quarkus.kubernetes-config.enabled=true` (por ejemplo, utilizando un xref:config-reference.html#profiles[perfil] específico).

source: The values of `quarkus.kubernetes-config.config-maps` and `quarkus.kubernetes-config.secrets` determine which ConfigMaps and/or Secrets will be used as configuration sources. Keep in mind that these ConfigMaps and Secrets must be in the same Kubernetes `Namespace` as the running application. If they are to be found in a different namespace, then `quarkus.kubernetes-config.namespace` must be set to the proper value.
es: Los valores de `quarkus.kubernetes-config.config-maps` y `quarkus.kubernetes-config.secrets` determinan qué ConfigMaps y/o Secretos se utilizarán como fuentes de configuración. Tenga en cuenta que estos ConfigMaps y Secretos deben estar en el mismo Kubernetes `Namespace` que la aplicación en ejecución. Si se encuentran en un espacio de nombres diferente, entonces `quarkus.kubernetes-config.namespace` debe establecerse en el valor adecuado.

source: Priority of obtained properties
es: Prioridad de las propiedades obtenidas

source: The properties obtained from the ConfigMaps and Secrets have a higher priority than (i.e. they override) any properties of the same name that are found in `application.properties` (or the YAML equivalents), but they have lower priority than properties set via Environment Variables or Java System Properties.
es: Las propiedades obtenidas a partir de los ConfigMaps y Secretos tienen mayor prioridad que (es decir, anulan) cualquier propiedad del mismo nombre que se encuentre en `application.properties` (o los equivalentes en YAML), pero tienen menor prioridad que las propiedades establecidas a través de Variables de Entorno o Propiedades del Sistema Java.

source: Furthermore, when multiple ConfigMaps (or Secrets) are used, ConfigMaps (or Secrets) defined later in the list have a higher priority that ConfigMaps defined earlier in the list.
es: Además, cuando se utilizan varios ConfigMaps (o Secretos), los ConfigMaps (o Secretos) definidos más tarde en la lista tienen una mayor prioridad que los ConfigMaps definidos anteriormente en la lista.

source: Finally, when both ConfigMaps and Secrets are used, the latter always a higher priority than the former.
es: Por último, cuando se utilizan tanto ConfigMaps como Secretos, estos últimos siempre tienen mayor prioridad que los primeros.

source: Kubernetes Permissions
es: Permisos de Kubernetes

source: Since reading ConfigMaps involves interacting with the Kubernetes API Server, when https://kubernetes.io/docs/reference/access-authn-authz/rbac/[RBAC] is enabled on the cluster, the https://kubernetes.io/docs/tasks/configure-pod-container/configure-service-account/[ServiceAccount] that is used to run the application needs to have the proper permissions for such access.
es: Dado que la lectura de ConfigMaps implica la interacción con el servidor de la API de Kubernetes, cuando el https://kubernetes.io/docs/reference/access-authn-authz/rbac/[RBAC] está habilitado en el clúster, la https://kubernetes.io/docs/tasks/configure-pod-container/configure-service-account/[ServiceAccount] que se utiliza para ejecutar la aplicación debe tener los permisos adecuados para dicho acceso.

source: Thankfully, when using the `kubernetes-config` extension along with the xref:deploying-to-kubernetes.adoc[Kubernetes] extension, all the necessary Kubernetes resources to make that happen are automatically generated.
es: Afortunadamente, cuando se utiliza la extensión `kubernetes-config` junto con la extensión xref:deploying-to-kubernetes.html[Kubernetes], se generan automáticamente todos los recursos Kubernetes necesarios para que esto ocurra.

source: Secrets
es: Secretos

source: By default, the xref:deploying-to-kubernetes.adoc[Kubernetes] extension doesn't generate the necessary resources to allow accessing secrets. Set `quarkus.kubernetes-config.secrets.enabled=true` to generate the necessary role and corresponding role binding.
es: Por defecto, la extensión de xref:deploying-to-kubernetes.html[Kubernetes] no genera los recursos necesarios para permitir el acceso a los secretos. Configure `quarkus.kubernetes-config.secrets.enabled=true` para generar el rol necesario y el correspondiente enlace de rol.

source: Example configuration
es: Ejemplo de configuración

source: A very common use case is to deploy a Quarkus application that needs to access a relational database which has itself already been deployed on Kubernetes. Using the `quarkus-kubernetes-config` extension makes this use case very simple to handle.
es: Un caso de uso muy común es desplegar una aplicación de Quarkus que necesita acceder a una base de datos relacional que a su vez ya ha sido desplegada en Kubernetes. El uso de la extensión `quarkus-kubernetes-config` hace que este caso de uso sea muy sencillo de manejar.

source: Let's assume that our Quarkus application needs to talk to PostgreSQL and that when PostgreSQL was deployed on our Kubernetes cluster, a `Secret` named `postgresql` was created as part of that deployment and contains the following entries:
es: Supongamos que nuestra aplicación Quarkus necesita hablar con PostgreSQL y que cuando PostgreSQL se desplegó en nuestro clúster Kubernetes, se creó un `Secret` llamado `postgresql` como parte de ese despliegue y contiene las siguientes entradas:

source: One possible way to make Quarkus use these entries to connect the database is to use the following configuration:
es: Una posible forma de hacer que Quarkus utilice estas entradas para conectar la base de datos es utilizar la siguiente configuración:

source: Enable reading of secrets. Note the use of `%prod` profile as we only want this setting applied when the application is running in production.
es: Habilitar la lectura de secretos. Tenga en cuenta el uso del perfil `%prod` ya que sólo queremos que esta configuración se aplique cuando la aplicación se ejecute en producción.

source: Configure the name of the secret that will be used. This doesn't need to be prefixed with the `%prod` profile as it won't have any effect if secret reading is disabled.
es: Configure el nombre del secreto que se utilizará. No es necesario anteponer el perfil `%prod`, ya que no tendrá ningún efecto si la lectura del secreto está desactivada.

source: Quarkus will substitute `${database-name}` with the value obtained from the entry with name `database-name` of the `postgres` Secret. `somehost` is the name of the Kubernetes `Service` that was created when PostgreSQL was deployed to Kubernetes.
es: Quarkus sustituirá `${database-name}` por el valor obtenido de la entrada con nombre `database-name` del `postgres` Secret. `somehost` es el nombre del Kubernetes `Service` que se creó cuando se desplegó PostgreSQL en Kubernetes.

source: Quarkus will substitute `${database-user}` with the value obtained from the entry with name `database-user` of the `postgres` Secret.
es: Quarkus sustituirá `${database-user}` por el valor obtenido de la entrada con nombre `database-user` del `postgres` Secret.

source: Quarkus will substitute `${database-password}` with the value obtained from the entry with name `database-password` of the `postgres` Secret.
es: Quarkus sustituirá `${database-password}` por el valor obtenido de la entrada con nombre `database-password` del `postgres` Secret.

source: The values above allow the application to be completely agnostic of the actual database configuration used in production while also not inhibiting the usability of the application at development time.
es: Los valores anteriores permiten que la aplicación sea completamente agnóstica con respecto a la configuración de la base de datos real utilizada en producción, al tiempo que no inhibe la usabilidad de la aplicación en tiempo de desarrollo.

source: Alternatives
es: Alternativas

source: The use of the `quarkus-kubernetes-config` extensions is completely optional as there are other ways an application can be configured to use ConfigMaps or Secrets.
es: El uso de las extensiones de `quarkus-kubernetes-config` es completamente opcional, ya que existen otras formas de configurar una aplicación para que utilice ConfigMaps o Secrets.

source: One common alternative is to map each entry of the ConfigMap and / Secret to an environment variable on the Kubernetes `Deployment` - see link:https://kubernetes.io/docs/concepts/configuration/secret/#use-case-as-container-environment-variables[this] for more details. To achieve that in Quarkus, we could use the `quarkus-kubernetes` extension (which is responsible for creating Kubernetes manifests and include the following configuration) and configure it as so:
es: Una alternativa común es mapear cada entrada del ConfigMap y/o Secret a una variable de entorno en el Kubernetes `Deployment` - ver link:https://kubernetes.io/docs/concepts/configuration/secret/#use-case-as-container-environment-variables[esto] para más detalles. Para lograr eso en Quarkus, podríamos utilizar la extensión `quarkus-kubernetes` (que se encarga de crear manifiestos de Kubernetes e incluir la siguiente configuración) y configurarla así:

source: The end result of the above configuration would be the following `env` part being applied the generated `Deployment`:
es: El resultado final de la configuración anterior sería la siguiente `env` parte que se aplica el `Deployment` generado:

source: See xref:deploying-to-kubernetes.adoc#secret-mapping[this] for more details.
es: Vea xref:deploying-to-kubernetes.html#secret-mapping[esto] para más detalles.

source: Configuration Reference
es: Referencia de configuración
