Repository: quarkusio/pt.quarkus.io
Catalog: l10n/po/*/_guides/pulsar-dev-services.adoc.po
Languages: pt

source: Dev Services for Pulsar
pt: Dev Services para Pulsar

source: With Quarkus Smallrye Reactive Messaging Pulsar extension (`quarkus-smallrye-reactive-messaging-pulsar`) Dev Services for Pulsar automatically starts a Pulsar broker in dev mode and when running tests. So, you don't have to start a broker manually. The application is configured automatically.
pt: Com a extensão Quarkus Smallrye Reactive Messaging Pulsar ( `quarkus-smallrye-reactive-messaging-pulsar`), o Dev Services para Pulsar inicia automaticamente um `broker` Pulsar em modo de desenvolvimento e durante a execução de testes. Assim, não é necessário iniciar um `broker` manualmente. A aplicação é configurada automaticamente.

source: Enabling / Disabling Dev Services for Pulsar
pt: Ativando / Desativando Dev Services para o Pulsar

source: Dev Services for Pulsar is automatically enabled unless:
pt: Os Dev services para Pulsar são ativados automaticamente, a menos que:

source: `quarkus.pulsar.devservices.enabled` is set to `false`
pt: `quarkus.pulsar.devservices.enabled` é definido como `false`

source: the `pulsar.client.serviceUrl` is configured
pt: o `pulsar.client.serviceUrl` está configurado

source: all the Reactive Messaging Pulsar channels have the `serviceUrl` attribute set
pt: todos os canais Pulsar de mensagens reativas têm o atributo `serviceUrl` definido

source: Dev Services for Pulsar relies on Docker to start the broker. If your environment does not support Docker, you will need to start the broker manually, or connect to an already running broker. You can configure the broker address using `pulsar.client.`.
pt: O Dev Services para Pulsar depende do Docker para iniciar o broker. Se o seu ambiente não suportar o Docker, será necessário iniciar o broker manualmente ou conectar-se a um broker já em execução. É possível configurar o endereço do broker usando `pulsar.client.`.

source: Shared broker
pt: Broker partilhado

source: Most of the time you need to share the broker between applications. Dev Services for Pulsar implements a _service discovery_ mechanism for your multiple Quarkus applications running in _dev_ mode to share a single broker.
pt: Na maioria das vezes, é necessário compartilhar o broker entre as aplicações. O Dev Services para Pulsar implementa um mecanismo de _service discovery_ para que suas múltiplas aplicações Quarkus rodando em modo _dev_ compartilhem um único broker.

source: Dev Services for Pulsar starts the container with the `quarkus-dev-service-pulsar` label which is used to identify the container.
pt: O Dev Services para Pulsar inicia o contêiner com a etiqueta `quarkus-dev-service-pulsar` que é utilizada para identificar o contêiner.

source: If you need multiple (shared) brokers, you can configure the `quarkus.pulsar.devservices.service-name` attribute and indicate the broker name. It looks for a container with the same value, or starts a new one if none can be found. The default service name is `pulsar`.
pt: Se precisar de vários brokers (partilhados), pode configurar o atributo `quarkus.pulsar.devservices.service-name` e indicar o nome do broker. Este procura um broker com o mesmo valor ou inicia um novo se não for encontrado nenhum. O nome de serviço predefinido é `pulsar`.

source: Sharing is enabled by default in dev mode, but disabled in test mode. You can disable the sharing with `quarkus.pulsar.devservices.shared=false`.
pt: O compartilhamento é ativado em _dev_ mode_ por padrão , mas desativado no modo de teste. É possível desabilitar este compartilhamento com `quarkus.pulsar.devservices.shared=false`.

source: Setting the port
pt: Definindo a porta

source: By default, Dev Services for Pulsar picks a random port and configures the application. You can set the port by configuring the `quarkus.pulsar.devservices.port` property.
pt: Por padrão, o Dev Services for Pulsar escolhe uma porta aleatória e configura o aplicativo. É possível definir a porta configurando a propriedade `quarkus.pulsar.devservices.port`.

source: Note that the Pulsar advertised address is automatically configured with the chosen port.
pt: Note que o endereço anunciado pelo Pulsar é automaticamente configurado com a porta escolhida.

source: Configuring the image
pt: Configurando a imagem

source: Dev Services for Pulsar supports the https://hub.docker.com/r/apachepulsar/pulsar[official Apache Pulsar image].
pt: O Dev Services para Pulsar suporta a link:https://hub.docker.com/r/apachepulsar/pulsar[imagem oficial do Apache Pulsar].

source: A custom image name can be configured as such:
pt: Um nome de imagem personalizado pode ser configurado. Por exemplo:

source: Configuring the Pulsar broker
pt: Configurar o broker Pulsar

source: You can configure the Dev Services for Pulsar with custom broker configuration.
pt: É possível configurar o Dev Services para a Pulsar com a configuração personalizada do broker.

source: The following example enables transaction support:
pt: O exemplo seguinte ativa o suporte de transação:
