Repository: quarkusio/pt.quarkus.io
Catalog: l10n/po/*/_guides/quarkus-intro.adoc.po
Languages: es

source: What is Quarkus
es: Qué es Quarkus

source: Quarkus is a Cloud Native, Container First framework for writing Java applications.
es: Quarkus es un marco de trabajo nativo de la nube y de primer contenedor para escribir aplicaciones Java.

source: Container First
es: Contenedor primero

source: Minimal footprint Java applications optimized for running in containers
es: Aplicaciones Java de huella mínima optimizadas para su ejecución en contenedores

source: Cloud Native
es: Nativo de la nube

source: Embraces 12 factor architecture in environments like Kubernetes
es: Adopta una arquitectura de 12 factores en entornos como Kubernetes

source: Unify imperative and reactive
es: Unificar lo imperativo y lo reactivo

source: Standards-based
es: Basado en estandares

source: Based on the standards and the libraries you love and use (RESTEasy Reactive, Hibernate, Netty, Eclipse Vert.x, Apache Camel...)
es: Basado en los estándares y las librerías que te gustan y utilizas (RESTEasy Reactive, Hibernate, Netty, Eclipse Vert.x, Apache Camel...)

source: Microservice First
es: Primero los microservicios

source: Brings lightning fast startup time to Java applications
es: Aporta un tiempo de arranque rapidísimo a las aplicaciones Java

source: Extreme productivity
es: Productividad extrema

source: Instant hot code replacement: don't allow build, deploy, boot delays disrupt your flow
es: Sustitución instantánea del código en caliente: no permita que los retrasos en la construcción, el despliegue y el arranque interrumpan su flujo

source: Developer Joy
es: Satisfacción de los desarrolladores

source: Development-centric experience without compromises to bring your amazing applications to life in no time
es: Experiencia centrada en el desarrollo sin compromisos para dar vida a sus increíbles aplicaciones en poco tiempo

source: All under one framework.
es: Todo bajo un mismo marco.

source: Scratch pad
es: Bloc de notas

source: Quarkus believes in developer Joy.
es: Quarkus cree en la satisfacción de los desarrolladores.

source: It unifies imperative and reactive. It is a Microservice first toolkit.
es: Unifica lo imperativo y lo reactivo. Es un conjunto de herramientas de Microservice first.

source: Standards based Quarkus brings all the standards and frameworks you love and use: RESTEasy Reactive, Hibernate, Netty, vert.x, Camel...)
es: Basado en estándares Quarkus trae todos los estándares y frameworks que amas y usas: RESTEasy Reactive, Hibernate, Netty, vert.x, Camel...)

source: Imperative and Reactive
es: Imperativo y reactivo

source: ahead-of-time native binary (executable binary)
es: binario nativo anticipado (binario ejecutable)

source: Substrate VM native
es: Substrate VM nativo

source: Seamlessly build container optimal
es: Construya sin problemas un contenedor óptimo

source: Container affinity
es: Afinidad del contenedor

source: Container optimal
es: Contenedor óptimo

source: low memory
es: poca memoria

source: low startup time
es: bajo tiempo de arranque

source: ahead of time optimal
es: con antelación óptima

source: Unifying Imperative and Reactive under one framework.
es: Unificar el imperativo y el reactivo en un solo marco.

source: Usability
es: Usabilidad

source: easy to use
es: fácil de usar

source: productive environment
es: entorno productivo

source: hot reload
es: recarga en caliente

source: Standards based
es: Basado en normas
