Repository: quarkusio/pt.quarkus.io
Catalog: l10n/po/*/_guides/rabbitmq-dev-services.adoc.po
Languages: es

source: Dev Services for RabbitMQ
es: Servicios de desarrollo para RabbitMQ

source: Dev Services for RabbitMQ automatically starts a RabbitMQ broker in dev mode and when running tests. So, you don't have to start a broker manually. The application is configured automatically.
es: Dev Services for RabbitMQ inicia automáticamente un broker RabbitMQ en modo dev y cuando se ejecutan pruebas. Así, no tiene que iniciar un broker manualmente. La aplicación se configura automáticamente.

source: Enabling / Disabling Dev Services for RabbitMQ
es: Activación/desactivación de los servicios de desarrollo para RabbitMQ

source: Dev Services for RabbitMQ is automatically enabled unless:
es: Los servicios de desarrollo para RabbitMQ se activan automáticamente a menos que:

source: `quarkus.rabbitmq.devservices.enabled` is set to `false`
es: `quarkus.rabbitmq.devservices.enabled` se ajusta a `false`

source: the `rabbitmq-host` or `rabbitmq-port` is configured
es: el `rabbitmq-host` o `rabbitmq-port` está configurado

source: all the Reactive Messaging RabbitMQ channels have the `host` or `port` attributes set
es: todos los canales de Reactive Messaging RabbitMQ tienen los atributos `host` o `port` establecidos

source: Dev Services for RabbitMQ relies on Docker to start the broker. If your environment does not support Docker, you will need to start the broker manually, or connect to an already running broker. You can configure the broker access using the `rabbitmq-host`, `rabbitmq-port`, `rabbitmq-username` and `rabbitmq-password` properties.
es: Dev Services for RabbitMQ se basa en Docker para iniciar el broker. Si su entorno no soporta Docker, tendrá que iniciar el broker manualmente, o conectarse a un broker ya en funcionamiento. Puede configurar el acceso al broker usando las propiedades `rabbitmq-host`, `rabbitmq-port`, `rabbitmq-username` y `rabbitmq-password`.

source: Shared broker
es: Broker compartido

source: Most of the time you need to share the broker between applications. Dev Services for RabbitMQ implements a _service discovery_ mechanism for your multiple Quarkus applications running in _dev_ mode to share a single broker.
es: La mayoría de las veces se necesita compartir el broker entre aplicaciones. Dev Services for RabbitMQ implementa un mecanismo de _descubrimiento de servicios_ para que sus múltiples aplicaciones Quarkus que se ejecutan en modo _dev_ compartan un único broker.

source: Dev Services for RabbitMQ starts the container with the `quarkus-dev-service-rabbitmq` label which is used to identify the container.
es: Dev Services for RabbitMQ inicia el contenedor con la etiqueta `quarkus-dev-service-rabbitmq` que se utiliza para identificar el contenedor.

source: If you need multiple (shared) brokers, you can configure the `quarkus.rabbitmq.devservices.service-name` attribute and indicate the broker name. It looks for a container with the same value, or starts a new one if none can be found. The default service name is `rabbitmq`.
es: Si necesitas varios brokers (compartidos), puedes configurar el atributo `quarkus.rabbitmq.devservices.service-name` e indicar el nombre del broker. Se busca un contenedor con el mismo valor, o se inicia uno nuevo si no se encuentra ninguno. El nombre de servicio por defecto es `rabbitmq`.

source: Sharing is enabled by default in dev mode, but disabled in test mode. You can disable the sharing with `quarkus.rabbitmq.devservices.shared=false`.
es: El uso compartido está activado por defecto en el modo de desarrollo, pero está desactivado en el modo de prueba. Puede desactivar el uso compartido con `quarkus.rabbitmq.devservices.shared=false`.

source: Setting the port
es: Ajuste del puerto

source: By default, Dev Services for RabbitMQ picks a random port and configures the application. You can set the port by configuring the `quarkus.rabbitmq.devservices.port` property.
es: Por defecto, Dev Services for RabbitMQ elige un puerto aleatorio y configura la aplicación. Puede establecer el puerto configurando la propiedad `quarkus.rabbitmq.devservices.port`.

source: Configuring the image
es: Configuración de la imagen

source: Dev Services for RabbitMQ uses official images available at https://hub.docker.com/_/rabbitmq. You can configure the image and version using the `quarkus.rabbitmq.devservices.image-name` property:
es: Dev Services for RabbitMQ utiliza imágenes oficiales disponibles en https://hub.docker.com/_/rabbitmq Puede configurar la imagen y la versión utilizando la propiedad `quarkus.rabbitmq.devservices.image-name`:

source: Predefined Topology
es: Topología predefinida

source: Dev Services for RabbitMQ supports defining topology upon broker start. You can define Exchanges, Queues, and Bindings using standard Quarkus configuration.
es: Dev Services for RabbitMQ soporta la definición de la topología al iniciar el broker. Puede definir intercambios, colas y enlaces utilizando la configuración estándar de Quarkus.

source: Defining Exchanges
es: Definición de los intercambios

source: To define a RabbitMQ exchange you provide the exchange's name after the `quarkus.rabbitmq.devservices.exchanges` key, followed by one (or more) of the exchange's properties:
es: Para definir un intercambio RabbitMQ se proporciona el nombre del intercambio después de la clave `quarkus.rabbitmq.devservices.exchanges`, seguido de una (o más) de las propiedades del intercambio:

source: Additionally, any additional arguments may be provided to the exchange's definition by using the `arguments` key:
es: Además, se puede proporcionar cualquier argumento adicional a la definición del intercambio utilizando la clave `arguments`:

source: Defining Queues
es: Definición de colas

source: To define a RabbitMQ queue you provide the queue's name after the `quarkus.rabbitmq.devservices.queues` key, followed by one (or more) of the queue's properties:
es: Para definir una cola RabbitMQ se proporciona el nombre de la cola después de la clave `quarkus.rabbitmq.devservices.queues`, seguido de una (o más) de las propiedades de la cola:

source: Additionally, any additional arguments may be provided to the queue's definition by using the `arguments` key:
es: Además, se puede proporcionar cualquier argumento adicional a la definición de la cola utilizando la tecla `arguments`:

source: Defining Bindings
es: Definición de enlaces

source: To define a RabbitMQ binding you provide the binding's name after the `quarkus.rabbitmq.devservices.bindings` key, followed by one (or more) of the binding's properties:
es: Para definir un enlace de RabbitMQ se proporciona el nombre del enlace después de la clave `quarkus.rabbitmq.devservices.bindings`, seguido de una (o más) de las propiedades del enlace:

source: The name of the binding is only used for the purposes of the Dev Services configuration and is not part of the binding defined in RabbitMQ.
es: El nombre del enlace sólo se utiliza para la configuración de los servicios de desarrollo y no forma parte del enlace definido en RabbitMQ.

source: Additionally, any additional arguments may be provided to the binding's definition by using the `arguments` key:
es: Además, se puede proporcionar cualquier argumento adicional a la definición del enlace utilizando la tecla `arguments`:
