Repository: quarkusio/pt.quarkus.io
Catalog: l10n/po/*/_guides/redis.adoc.po
Languages: pt

source: Using the Redis Client
pt: Usando o cliente Redis

source: This guide demonstrates how your Quarkus application can connect to a Redis server using the Redis Client extension.
pt: Este guia demonstra como a sua aplicação Quarkus pode se conectar a um servidor Redis utilizando a extensão Redis Client.

source: Prerequisites
pt: Pré-requisitos

source: A working Docker environment
pt: Um ambiente Docker funcional

source: Architecture
pt: Arquitetura

source: In this guide, we are going to expose a simple Rest API to increment numbers by using the https://redis.io/commands/incrby[`INCRBY`] command. Along the way, we'll see how to use other Redis commands like `GET`, `SET` (from the string group), `DEL` and `KEYS` (from the key group).
pt: Neste guia, vamos expor uma API Rest simples para incrementar números usando o comando link:https://redis.io/commands/incrby[`INCRBY`] . Ao longo do caminho, veremos como usar outros comandos do Redis, como `GET`, `SET` (do grupo de strings), `DEL` e `KEYS` (do grupo de chaves).

source: We'll be using the Quarkus Redis extension to connect to interact with Redis.
pt: Vamos utilizar a extensão Quarkus Redis para nos conectar e interagir com o Redis.

source: Solution
pt: Solução

source: We recommend that you follow the instructions in the next sections and create the application step by step. However, you can go right to the completed example.
pt: Recomendamos que siga as instruções nas seções seguintes e crie a aplicação passo a passo. No entanto, você pode ir diretamente para o exemplo completo.

source: Clone the Git repository: `git clone {quickstarts-clone-url}`, or download an {quickstarts-archive-url}[archive].
pt: Clone o repositório Git: `git clone {quickstarts-clone-url}`, ou baixe um {quickstarts-archive-url}[arquivo].

source: The solution is located in the `redis-quickstart` link:{quickstarts-tree-url}/redis-quickstart[directory].
pt: A solução está localizada no link:{quickstarts-tree-url}/redis-quickstart[diretório] `redis-quickstart` .

source: Creating the Maven Project
pt: Criando o projeto Maven

source: First, we need a new project. Create a new project with the following command:
pt: Primeiro, precisamos de um novo projeto. Crie um novo projeto com o seguinte comando:

source: This command generates a new project, importing the Redis extension.
pt: Este comando gera um novo projeto, importando a extensão Redis.

source: If you already have your Quarkus project configured, you can add the `redis-client` extension to your project by running the following command in your project base directory:
pt: Se já tiver o seu projeto Quarkus configurado, pode adicionar a extensão `redis-client` ao seu projeto executando o seguinte comando no diretório base do seu projeto:

source: This will add the following to your build file:
pt: Isto irá adicionar o seguinte trecho no seu arquivo de build:

source: Creating the Increment POJO
pt: Criando o POJO Incremento

source: We are going to model our increments using the `Increment` POJO. Create the `src/main/java/org/acme/redis/Increment.java` file, with the following content:
pt: Vamos modelar os nossos incrementos utilizando o POJO `Incremento`. Crie o arquivo `src/main/java/org/acme/redis/Incremento.java`, com o seguinte conteúdo:

source: public class Increment { public String key; // <1> public long value; // <2>
pt: public class Incremento { public String chave; // <1> public long valor; // <2>

source: public Increment(String key, long value) { this.key = key; this.value = value; }
pt: public Incremento(String chave, long valor) { this.chave = chave; this.valor = valor; }

source: The key that will be used as the Redis key
pt: A variável `chave` que será utilizada como chave do Redis

source: The value held by the Redis key
pt: A variável `valor` que será o valor mantido pela chave Redis

source: Creating the Increment Service
pt: Criando o Serviço de Incremento `IncrementoService`

source: We are going to create an `IncrementService` class which will play the role of a Redis client. With this class, we'll be able to perform the `SET`, `GET` , `DEL`, `KEYS` and `INCRBY` Redis commands.
pt: Vamos criar uma classe `IncrementoService` que desempenhará o papel de um cliente Redis. Com essa classe, poderemos executar os comandos Redis `SET`, `GET`, `DEL`, `KEYS` e `INCRBY`.

source: Create the `src/main/java/org/acme/redis/IncrementService.java` file, with the following content:
pt: Criar o arquivo `src/main/java/org/acme/redis/IncrementoService.java`, com o seguinte conteúdo:

source: @ApplicationScoped public class IncrementService {
pt: @ApplicationScoped public class IncrementoService {

source: // This quickstart demonstrates both the imperative // and reactive Redis data sources // Regular applications will pick one of them.
pt: // Esse exemplo demonstra tanto a instanciação imperativa // quanto reativa do seu datasource Redis. // Sua aplicação geralmente precisará de uma delas.

source: private ReactiveKeyCommands<String> keyCommands; // <1> private ValueCommands<String, Long> countCommands; // <2>
pt: private ReactiveKeyCommands<String> chaveKeyCommands; // <1> private ValueCommands<String, Long> contadorValueCommands; // <2>

source: public IncrementService(RedisDataSource ds, ReactiveRedisDataSource reactive) { // <3> countCommands = ds.value(Long.class); // <4> keyCommands = reactive.key(); // <5>
pt: public IncrementoService(RedisDataSource ds, ReactiveRedisDataSource reactive) { // <3> contadorValueCommands = ds.value(Long.class); // <4> chaveKeyCommands = reactive.key(); // <5>

source: long get(String key) { Long value = countCommands.get(key); // <6> if (value == null) { return 0L; } return value; }
pt: long get(String chave) { Long valor = contadorValueCommands.get(chave); // <6> if (valor == null) { return 0L; } return valor; }

source: void set(String key, Long value) { countCommands.set(key, value); // <7> }
pt: void set(String chave, Long valor) { contadorValueCommands.set(chave, valor); // <7> }

source: void increment(String key, Long incrementBy) { countCommands.incrby(key, incrementBy); // <8> }
pt: void incrementar(String chave, Long valor) { contadorValueCommands.incrby(chave, valor); // <8> }

source: Uni<Void> del(String key) { return keyCommands.del(key) // <9> .replaceWithVoid(); }
pt: Uni<Void> deletar(String chave) { return chaveKeyCommands.del(chave) // <9> .replaceWithVoid(); }

source: Uni<List<String>> keys() { return keyCommands.keys("*"); // <10> } }
pt: Uni<List<String>> chaves() { return chaveKeyCommands.keys("*"); // <10> } }

source: The field use to manipulate keys
pt: O campo utilizado para manipular chaves

source: The field use to manipulate the counter
pt: O campo utilizado para manipular o contador

source: Inject both the imperative and reactive data sources
pt: Injeta os datasources imperativo e reativo

source: Retrieve the commands to manipulate the counters
pt: Recuperar os comandos para manipular os contadores

source: Retrieve the commands to manipulate the keys
pt: Recuperar os comandos para manipular as chaves

source: Retrieve the value associated with the given key. It `null`, returns 0.
pt: Recupera o valor associado à chave indicada. Se `null`, retorna 0.

source: Set the value associated with the given key
pt: Define o valor associado a uma determinada chave

source: Increment the value associated with the given key
pt: Incrementa o valor associado à chave indicada

source: Delete a key (and its associated value)
pt: Exclui uma chave (e o respetivo valor associado)

source: List all the keys
pt: Lista todas as chaves

source: Creating the Increment Resource
pt: Criando o recurso de incremento `IncrementoResource`

source: Create the `src/main/java/org/acme/redis/IncrementResource.java` file, with the following content:
pt: Criar o arquivo `src/main/java/org/acme/redis/IncrementoResource.java`, com o seguinte conteúdo:

source: @Path("/increments") public class IncrementResource {
pt: @Path("/incrementos") public class IncrementoResource {

source: @Inject IncrementService service;
pt: @Inject IncrementoService service;

source: @GET public Uni<List<String>> keys() { return service.keys(); }
pt: @GET public Uni<List<String>> chaves() { return service.chaves(); }

source: @POST public Increment create(Increment increment) { service.set(increment.key, increment.value); return increment; }
pt: @POST public Incremento create(Incremento incremento) { service.set(incremento.chave, incremento.valor); return incremento; }

source: @GET @Path("/{key}") public Increment get(String key) { return new Increment(key, service.get(key)); }
pt: @GET @Path("/{chave}") public Incremento get(String chave) { return new Incremento(key, service.get(chave)); }

source: @PUT @Path("/{key}") public void increment(String key, long value) { service.increment(key, value); }
pt: @PUT @Path("/{chave}") public void incrementar(String chave, long valor) { service.incrementar(chave, valor); }

source: @DELETE @Path("/{key}") public Uni<Void> delete(String key) { return service.del(key); } }
pt: @DELETE @Path("/{chave}") public Uni<Void> delete(String chave) { return service.del(chave); } }

source: Creating the test class
pt: Criando a classe de teste

source: Edit the `pom.xml` file to add the following dependency:
pt: Edite o arquivo `pom.xml` para adicionar a seguinte dependência:

source: Create the `src/test/java/org/acme/redis/IncrementResourceTest.java` file with the following content:
pt: Crie o arquivo `src/test/java/org/acme/redis/IncrementoResourceTest.java` com o seguinte conteúdo:

source: @QuarkusTest public class IncrementResourceTest {
pt: @QuarkusTest public class IncrementoResourceTest {

source: @Test public void testRedisOperations() { // verify that we have nothing given() .accept(ContentType.JSON) .when() .get("/increments") .then() .statusCode(200) .body("size()", is(0));
pt: @Test public void testOperacoesRedis() { // verifique que está vazio given() .accept(ContentType.JSON) .when() .get("/incrementos") .then() .statusCode(200) .body("size()", is(0));

source: // create a first increment key with an initial value of 0 given() .contentType(ContentType.JSON) .accept(ContentType.JSON) .body("{\"key\":\"first-key\",\"value\":0}") .when() .post("/increments") .then() .statusCode(200) .body("key", is("first-key")) .body("value", is(0));
pt: // cria a primeira chave de incremento com valor inicial 0 given() .contentType(ContentType.JSON) .accept(ContentType.JSON) .body("{\"chave\":\"primeira-chave\",\"valor\":0}") .when() .post("/incrementos") .then() .statusCode(200) .body("chave", is("primeira-chave")) .body("valor", is(0));

source: // create a second increment key with an initial value of 10 given() .contentType(ContentType.JSON) .accept(ContentType.JSON) .body("{\"key\":\"second-key\",\"value\":10}") .when() .post("/increments") .then() .statusCode(200) .body("key", is("second-key")) .body("value", is(10));
pt: // cria a primeira chave de incremento com valor inicial 10 given() .contentType(ContentType.JSON) .accept(ContentType.JSON) .body("{\"chave\":\"segunda-chave\",\"valor\":10}") .when() .post("/incrementos") .then() .statusCode(200) .body("chave", is("segunda-chave")) .body("valor", is(10));

source: // increment first key by 1 given() .contentType(ContentType.JSON) .body("1") .when() .put("/increments/first-key") .then() .statusCode(204);
pt: // incrementa a primeira chave em 1 given() .contentType(ContentType.JSON) .body("1") .when() .put("/incrementos/primeira-chave") .then() .statusCode(204);

source: // verify that key has been incremented given() .accept(ContentType.JSON) .when() .get("/increments/first-key") .then() .statusCode(200) .body("key", is("first-key")) .body("value", is(1));
pt: // verifica que a primeira chave foi incrementada given() .accept(ContentType.JSON) .when() .get("/incrementos/primeira-chave") .then() .statusCode(200) .body("chave", is("primeira-chave")) .body("valor", is(1));

source: // increment second key by 1000 given() .contentType(ContentType.JSON) .body("1000") .when() .put("/increments/second-key") .then() .statusCode(204);
pt: // incrementa a segunda chave em 1000 given() .contentType(ContentType.JSON) .body("1000") .when() .put("/incrementos/segunda-chave") .then() .statusCode(204);

source: // verify that key has been incremented given() .accept(ContentType.JSON) .when() .get("/increments/second-key") .then() .statusCode(200) .body("key", is("second-key")) .body("value", is(1010));
pt: // verifica que a segunda chave foi incrementada given() .accept(ContentType.JSON) .when() .get("/incrementos/segunda-chave") .then() .statusCode(200) .body("chave", is("segunda-chave")) .body("valor", is(1010));

source: // verify that we have two keys in registered given() .accept(ContentType.JSON) .when() .get("/increments") .then() .statusCode(200) .body("size()", is(2));
pt: // verifica que existem duas chaves registradas given() .accept(ContentType.JSON) .when() .get("/incrementos") .then() .statusCode(200) .body("size()", is(2));

source: // delete first key given() .accept(ContentType.JSON) .when() .delete("/increments/first-key") .then() .statusCode(204);
pt: // deleta a primeira chave given() .accept(ContentType.JSON) .when() .delete("/incrementos/primeira-chave") .then() .statusCode(204);

source: // verify that we have one key left after deletion given() .accept(ContentType.JSON) .when() .get("/increments") .then() .statusCode(200) .body("size()", is(1));
pt: // verifica que existe apenas uma chave após a deleção given() .accept(ContentType.JSON) .when() .get("/incrementos") .then() .statusCode(200) .body("size()", is(1));

source: // delete second key given() .accept(ContentType.JSON) .when() .delete("/increments/second-key") .then() .statusCode(204);
pt: // deleta a segunda chave given() .accept(ContentType.JSON) .when() .delete("/incrementos/segunda-chave") .then() .statusCode(204);

source: // verify that there is no key left given() .accept(ContentType.JSON) .when() .get("/increments") .then() .statusCode(200) .body("size()", is(0)); } }
pt: // verifica que não existem mais chaves given() .accept(ContentType.JSON) .when() .get("/incrementos") .then() .statusCode(200) .body("size()", is(0)); } }

source: Get it running
pt: Executando a aplicação

source: If you followed the instructions, you should have the Redis server running. Then, you just need to run the application using:
pt: Se você seguiu as instruções, deve ter o servidor Redis funcionando. Depois, você só precisa executar a aplicação utilizando:

source: Open another terminal and run the `curl http://localhost:8080/increments` command.
pt: Abra outro terminal e execute o comando `curl http://localhost:8080/incrementos`.

source: Interacting with the application
pt: Interagindo com a aplicação

source: As we have seen above, the API exposes five Rest endpoints. In this section we are going to see how to initialise an increment, see the list of current increments, incrementing a value given its key, retrieving the current value of an increment, and finally deleting a key.
pt: Como vimos acima, a API expõe cinco endpoints Rest. Nesta seção, vamos ver como inicializar um incremento, ver a lista de incrementos atuais, incrementar um valor dado a sua chave, recuperar o valor atual de um incremento e, finalmente, excluir uma chave.

source: Creating a new increment
pt: Criando um novo incremento

source: curl -X POST -H "Content-Type: application/json" -d '{"key":"first","value":10}' http://localhost:8080/increments <1>
pt: curl -X POST -H "Content-Type: application/json" -d '{"chave":"primeira","valor":10}' http://localhost:8080/incrementos <1>

source: We create the first increment, with the key `first` and an initial value of `10`.
pt: Criamos o primeiro incremento, com a chave `primeira` e um valor inicial de `10`.

source: Running the above command should return the result below:
pt: A execução do comando acima deve retornar o resultado abaixo:

source: { "key": "first", "value": 10 }
pt: { "chave": "primeira", "valor": 10 }

source: See current increments keys
pt: Ver as chaves atuais de incrementos

source: To see the list of current increments keys, run the following command:
pt: Para ver a lista de chaves de incrementos atuais, execute o seguinte comando:

source: curl http://localhost:8080/increments
pt: curl http://localhost:8080/incrementos

source: The above command should return `["first"]` indicating that we have only one increment thus far.
pt: O comando acima deve retornar `["primeira"]` indicando que temos apenas um incremento até o momento.

source: Retrieve a new increment
pt: Recuperar um novo incremento

source: To retrieve an increment using its key, we will have to run the below command:
pt: Para recuperar um incremento utilizando a sua chave, teremos de executar o comando abaixo:

source: curl http://localhost:8080/increments/first <1>
pt: curl http://localhost:8080/increments/primeira <1>

source: Running this command, should return the following result:
pt: Ao executar este comando, deverá obter o seguinte resultado:

source: Increment a value given its key
pt: Incrementa um valor dada a sua chave

source: To increment a value, run the following command:
pt: Para incrementar um valor, execute o seguinte comando:

source: curl -X PUT -H "Content-Type: application/json" -d '27' http://localhost:8080/increments/first <1>
pt: curl -X PUT -H "Content-Type: application/json" -d '27' http://localhost:8080/incrementos/primeira <1>

source: Increment the `first` value by 27.
pt: Incrementa o valor `primeira` em 27.

source: Now, running the command `curl http://localhost:8080/increments/first` should return the following result:
pt: Agora, ao executar o comando `curl http://localhost:8080/incrementos/primeira` deve retornar o seguinte resultado:

source: { "key": "first", "value": 37 <1> }
pt: { "chave": "primeira", "valor": 37 <1> }

source: We see that the value of the `first` key is now `37` which is exactly the result of `10 + 27`, quick maths.
pt: Vemos que o valor da chave `primeira` é agora `37` que é exatamente o resultado de `10 + 27`.

source: Deleting a key
pt: Excluindo uma chave

source: Use the command below, to delete an increment given its key.
pt: Utilize o comando abaixo, para excluir um incremento dada a sua chave.

source: curl -X DELETE http://localhost:8080/increments/first <1>
pt: curl -X DELETE http://localhost:8080/increments/primeira <1>

source: Delete the `first` increment.
pt: Excluir o incremento `primeira`.

source: Now, running the command `curl http://localhost:8080/increments` should return an empty list `[]`
pt: Agora, ao executar o comando `curl http://localhost:8080/incrementos` deve retornar uma lista vazia `[]`

source: Configuring for production
pt: Configuração para produção

source: At this point, Quarkus uses the Redis Dev Service to run a Redis server and configure the application. However, in production, you will run your own Redis (or used a Cloud offering).
pt: Neste ponto, o Quarkus usa o Redis Dev Service para executar um servidor Redis e configurar a aplicação. No entanto, em produção, você irá executar o seu próprio Redis (ou utilizar um oferecido por algum serviço de Cloud).

source: Let's start a Redis server on the port 6379 using:
pt: Vamos iniciar um servidor Redis na porta 6379 usando:

source: Then, open the `src/main/resources/application.properties` file and add:
pt: Em seguida, abra o arquivo `src/main/resources/application.properties` e adicione:

source: Packaging and running in JVM mode
pt: Empacotando e execução no modo JVM

source: You can run the application as a conventional jar file.
pt: Você pode executar a aplicação como um arquivo jar convencional.

source: First, we will need to package it:
pt: Em primeiro lugar, temos que empacotar a aplicação:

source: This command will start a Redis instance to execute the tests.
pt: Este comando iniciará uma instância Redis para executar os testes.

source: Then run it:
pt: Em seguida, execute:

source: Running Native
pt: Executando em modo nativo

source: You can also create a native executable from this application without making any source code changes. A native executable removes the dependency on the JVM: everything needed to run the application on the target platform is included in the executable, allowing the application to run with minimal resource overhead.
pt: Também é possível criar um executável nativo a partir dessa aplicação sem fazer nenhuma alteração no código-fonte. Um executável nativo elimina a dependência da JVM: tudo o que é necessário para executar a aplicação na plataforma de destino é incluído no executável, permitindo que a aplicação seja executada com um mínimo de sobrecarga de recursos.

source: Compiling a native executable takes a bit longer, as GraalVM performs additional steps to remove unnecessary codepaths. Use the `native` profile to compile a native executable:
pt: A compilação de um executável nativo demora um pouco mais, pois o GraalVM executa etapas adicionais para remover caminhos de código desnecessários. Use o perfil `native` para compilar um executável nativo:

source: Once the build is finished, you can run the executable with:
pt: Quando a compilação estiver concluída, pode rodar o executável com:

source: Going further
pt: Indo mais longe

source: To learn more about the Quarkus Redis extension, check xref:redis-reference.adoc[the Redis extension reference guide].
pt: Para saber mais sobre a extensão Quarkus Redis, consulte xref:redis-reference.adoc[o guia de referência da extensão Redis].
