Repository: quarkusio/pt.quarkus.io
Catalog: l10n/po/*/_guides/redis-dev-services.adoc.po
Languages: es, pt_br

source: Dev Services for Redis
es: Servicios de desarrollo para Redis
pt_br: Dev Services para Redis

source: Quarkus supports a feature called Dev Services that allows you to create various datasources without any config. What that means practically, is that if you have docker running and have not configured `quarkus.redis.hosts`, Quarkus will automatically start a Redis container when running tests or dev-mode, and automatically configure the connection.
es: Quarkus soporta una característica llamada Dev Services que le permite crear varias fuentes de datos sin ninguna configuración. Lo que esto significa en la práctica, es que si tienes docker ejecutando y no has configurado `quarkus.redis.hosts`, Quarkus iniciará automáticamente un contenedor Redis cuando ejecute pruebas o el modo dev, y configurará automáticamente la conexión.

source: Available properties to customize the Redis DevService.
es: Propiedades disponibles para personalizar el Redis DevService.

source: When running the production version of the application, the Redis connection need to be configured as normal, so if you want to include a production database config in your `application.properties` and continue to use Dev Services we recommend that you use the `%prod.` profile to define your Redis settings.
es: Cuando se ejecuta la versión de producción de la aplicación, la conexión de Redis debe configurarse de forma normal, por lo que si desea incluir una configuración de base de datos de producción en su `application.properties` y seguir utilizando los servicios de desarrollo, le recomendamos que utilice el perfil `%prod.` para definir su configuración de Redis.

source: Dev Services for Redis relies on Docker to start the server. If your environment does not support Docker, you will need to start the server manually, or connect to an already running server.
es: Dev Services for Redis se basa en Docker para iniciar el servidor. Si su entorno no admite Docker, tendrá que iniciar el servidor manualmente o conectarse a un servidor ya en funcionamiento.

source: Shared server
es: Servidor compartido
pt_br: Servidor compartilhado

source: Most of the time you need to share the server between applications. Dev Services for Redis implements a _service discovery_ mechanism for your multiple Quarkus applications running in _dev_ mode to share a single server.
es: La mayoría de las veces se necesita compartir el servidor entre aplicaciones. Dev Services for Redis implementa un mecanismo de _descubrimiento de servicios_ para que tus múltiples aplicaciones Quarkus que se ejecutan en modo _dev_ compartan un único servidor.

source: Dev Services for Redis starts the container with the `quarkus-dev-service-redis` label which is used to identify the container.
es: Dev Services for Redis inicia el contenedor con la etiqueta `quarkus-dev-service-redis` que se utiliza para identificar el contenedor.
pt_br: O Dev Services para Redis inicia o contêiner com o rótulo `quarkus-dev-service-redis` que é utilizado para identificar o contêiner.

source: If you need multiple (shared) servers, you can configure the `quarkus.redis.devservices.service-name` attribute and indicate the server name. It looks for a container with the same value, or starts a new one if none can be found. The default service name is `redis`.
es: Si necesitas varios servidores (compartidos), puedes configurar el atributo `quarkus.redis.devservices.service-name` e indicar el nombre del servidor. Se busca un contenedor con el mismo valor, o se inicia uno nuevo si no se encuentra ninguno. El nombre de servicio por defecto es `redis`.

source: Sharing is enabled by default in dev mode, but disabled in test mode. You can disable the sharing with `quarkus.redis.devservices.shared=false`.
es: El uso compartido está activado por defecto en el modo de desarrollo, pero está desactivada en el modo de prueba. Puede desactivar el uso compartido con `quarkus.redis.devservices.shared=false`.

source: Quarkus supports a feature called Dev Services that allows you to create various datasources without any config. What that means practically, is that if you have docker running and have not configured `quarkus.redis.hosts`, Quarkus will automatically start a Redis container when running tests or dev mode, and automatically configure the connection.
pt_br: O Quarkus oferece suporte a um recurso chamado Dev Services que permite que você crie várias origens de dados sem nenhuma configuração. O que isso significa na prática é que, se você tiver o docker rodando e não tiver configurado `quarkus.redis.hosts`, o Quarkus iniciará automaticamente um contêiner Redis ao executar testes ou o modo de desenvolvimento e configurará automaticamente a conexão.

source: When running the production version of the application, the Redis connection need to be configured as normal, so if you want to include a production database config in your `application.properties` and continue to use Dev Services we recommend that you use the `%prod.` profile to define your Redis settings.
pt_br: Ao executar a versão de produção da aplicação, a conexão Redis precisa ser configurada normalmente, portanto, se quiser incluir uma configuração de banco de dados de produção no seu `application.properties` e continuar a usar o Dev Services, recomendamos que use o perfil `%prod.` para definir as configurações do Redis.

source: Dev Services for Redis relies on Docker to start the server. If your environment does not support Docker, you will need to start the server manually, or connect to an already running server.
pt_br: O Dev Services para Redis conta com o Docker para iniciar o servidor. Se o seu ambiente não for compatível com o Docker, você precisará iniciar o servidor manualmente ou conectar-se a um servidor já em execução.

source: If you want to use Redis Stack _modules_ (bloom, graph, search...), set the image-name to `redis/redis-stack:latest`
pt_br: Se quiser usar _os módulos_ Redis Stack (bloom, graph, search...), defina o image-name para `redis/redis-stack:latest`

source: Most of the time you need to share the server between applications. Dev Services for Redis implements a _service discovery_ mechanism for your multiple Quarkus applications running in _dev_ mode to share a single server.
pt_br: Na maioria das vezes, você precisa compartilhar o servidor entre as aplicações. O Dev Services para Redis implementa um mecanismo de _descoberta de serviços_ para que os várias aplicações Quarkus em execução no modo de _desenvolvimento_ compartilhem um único servidor.

source: If you need multiple (shared) servers, you can configure the `quarkus.redis.devservices.service-name` attribute and indicate the server name. It looks for a container with the same value, or starts a new one if none can be found. The default service name is `redis`.
pt_br: Se precisar de vários servidores (compartilhados), você pode configurar o atributo `quarkus.redis.devservices.service-name` e indicar o nome do servidor. Ele procura um contêiner com o mesmo valor ou inicia um novo se nenhum for encontrado. O nome do serviço padrão é `redis`.

source: Sharing is enabled by default in dev mode, but disabled in test mode. You can disable the sharing with `quarkus.redis.devservices.shared=false`.
pt_br: O compartilhamento é ativado por padrão no modo de desenvolvimento, mas desativado no modo de teste. Você pode desativar o compartilhamento com `quarkus.redis.devservices.shared=false`.
