Repository: quarkusio/pt.quarkus.io
Catalog: l10n/po/*/_guides/security-enabling-basic-auth-howto.adoc.po
Languages: es

source: Enable HTTP Basic authentication
es: Activar la autenticación básica HTTP

source: Enable the HTTP Basic authentication for your Quarkus project and allow users to authenticate with a username and password.
es: Habilite la autenticación básica HTTP para su proyecto Quarkus y permita que los usuarios se autentiquen con un nombre de usuario y una contraseña.

source: Prerequisites
es: Requisitos previos

source: You have installed at least one extension that provides an `IdentityProvider` based on username and password, such as xref:security-jdbc.adoc[Elytron JDBC].
es: Ha instalado al menos una extensión que proporciona un `IdentityProvider` basado en el nombre de usuario y la contraseña, como xref:security-jdbc.adoc[Elytron JDBC].

source: Enable Basic authentication by setting the value of `quarkus.http.auth.basic` property to `true`.
es: Habilite la autenticación básica estableciendo el valor de la propiedad `quarkus.http.auth.basic` en `true`.

source: For a Basic authentication configuration walk-through that uses `JPA`, see the xref:security-getting-started.adoc[Getting Started With Security] guide.
es: Para ver una configuración de autenticación básica que utiliza `JPA`, consulte la guía de xref:security-getting-started.adoc[introducción a la seguridad].

source: Additional resources
es: Recursos adicionales

source: xref:security.adoc[Security Architecture and Guides]
es: xref:security.adoc[Arquitectura y guías de seguridad]

source: xref:security.adoc#identity-providers[Security Identity Providers]
es: xref:security.adoc#identity-providers[Proveedores de identidades de seguridad]

source: xref:security-testing.adoc#configuring-user-information[Configuring User Information in application.properties]
es: xref:security-testing.adoc#configuring-user-information[Configuración de la información del usuario en application.properties]
