Repository: quarkusio/pt.quarkus.io
Catalog: l10n/po/*/_guides/security-identity-providers.adoc.po
Languages: es

source: Identity providers
es: Proveedores de identidad

source: In the Quarkus Security framework, identity providers play a crucial role in authentication and authorization by verifying user identities. `IdentityProvider` creates a `SecurityIdentity` instance, which gets used during user authentication to verify and authorize access requests to your Quarkus application.
es: En el marco de seguridad de Quarkus, los proveedores de identidad desempeñan un papel crucial en la autenticación y autorización mediante la verificación de las identidades de los usuarios. `IdentityProvider` crea una instancia `SecurityIdentity`, que se utiliza durante la autenticación del usuario para verificar y autorizar las solicitudes de acceso a su aplicación Quarkus.

source: `IdentityProvider` converts the authentication credentials provided by `HttpAuthenticationMechanism` to a `SecurityIdentity` instance.
es: `IdentityProvider` convierte las credenciales de autenticación proporcionadas por `HttpAuthenticationMechanism` en una instancia de `SecurityIdentity`.

source: Some extensions, for example, `OIDC`, `OAuth2`, and `SmallRye JWT`, have inline `IdentityProvider` implementations specific to the supported authentication flow. For example, `quarkus-oidc` uses its own `IdentityProvider` to convert a token to a `SecurityIdentity` instance.
es: Algunas extensiones, por ejemplo, `OIDC`, `OAuth2`, y `SmallRye JWT`, tienen implementaciones en línea `IdentityProvider` específicas para el flujo de autenticación soportado. Por ejemplo, `quarkus-oidc` utiliza su propio `IdentityProvider` para convertir un token en una instancia de `SecurityIdentity`.

source: If you use Basic or form-based authentication, you must add an `IdentityProvider` instance to convert a username and password to a `SecurityIdentity` instance.
es: Si utiliza autenticación básica o basada en formularios, debe añadir una instancia `IdentityProvider` para convertir un nombre de usuario y una contraseña en una instancia `SecurityIdentity`.

source: To get started with security in Quarkus, consider combining the Quarkus built-in Basic HTTP authentication with the Jakarta Persistence identity provider to enable role-based access control (RBAC).
es: Para comenzar con la seguridad en Quarkus, considere combinar la autenticación HTTP básica incorporada en Quarkus con el proveedor de identidad Jakarta Persistence para habilitar el control de acceso basado en roles (RBAC).

source: For more information about Basic authentication, its mechanisms, and related identity providers, see the following resources:
es: Para obtener más información sobre la autenticación básica, sus mecanismos y los proveedores de identidad relacionados, consulte los siguientes recursos:

source: xref:security-jpa.adoc[Quarkus Security with Jakarta Persistence]
es: xref:security-jpa.adoc[Seguridad Quarkus con Jakarta Persistence]

source: xref:security-basic-authentication-tutorial.adoc[Secure a Quarkus application with Basic authentication and Jakarta Persistence]
es: xref:security-basic-authentication-tutorial.adoc[Proteger una aplicación Quarkus con autenticación básica y Jakarta Persistence]

source: xref:security-authentication-mechanisms.adoc#form-auth[Form-based authentication]
es: xref:security-authentication-mechanisms.adoc#form-auth[Autenticación basada en formularios]

source: xref:security-jdbc.adoc[Using security with JDBC]
es: xref:security-jdbc.adoc[Uso de la seguridad con JDBC]

source: xref:security-ldap.adoc[Using security with an LDAP realm]
es: xref:security-ldap.adoc[Utilizar la seguridad con un dominio LDAP]

source: xref:security-overview.adoc[Quarkus Security overview]
es: xref:security-overview.adoc [Visión general de Quarkus Security]
