Repository: quarkusio/pt.quarkus.io
Catalog: l10n/po/*/_guides/security-basic-authentication-tutorial.adoc.po
Languages: pt_br

source: For more information about Jakarta Persistence, see the xref:security-jpa.adoc[Quarkus Security with Jakarta Persistence] guide.
pt_br: Para obter mais informações sobre o Jakarta Persistence, consulte o guia xref:security-jpa.adoc[Quarkus Security com Jakarta Persistence] .

source: This tutorial prepares you for implementing more advanced security mechanisms in Quarkus, for example, how to use the OpenID Connect (OIDC) authentication mechanism.
pt_br: Este tutorial prepara você para implementar mecanismos de segurança mais avançados no Quarkus, por exemplo, como usar o mecanismo de autenticação OpenID Connect (OIDC).

source: Prerequisites
pt_br: Pré-requisitos

source: What you will build
pt_br: O que você vai construir

source: To demonstrate different authorization policies, the steps in this tutorial guide you through building an application that provides the following endpoints:
pt_br: Para demonstrar diferentes políticas de autorização, as etapas deste tutorial orientam você na criação de uma aplicação que fornece os seguintes endpoints:

source: Description
pt_br: Descrição

source: The `/api/public` endpoint can be accessed anonymously.
pt_br: O endpoint `/api/public` pode ser acessado anonimamente.

source: The `/api/admin` endpoint is protected with role-based access control (RBAC). Only users granted with the `admin` role can access it. At this endpoint, the `@RolesAllowed` annotation enforces the access constraint declaratively.
pt_br: O endpoint `/api/admin` é protegido com controle de acesso baseado em função (RBAC). Somente usuários com a função `admin` podem acessá-lo. Nesse endpoint, a anotação `@RolesAllowed` impõe a restrição de acesso de forma declarativa.

source: The `/api/users/me` endpoint is protected by RBAC. Only users that have the `user` role can access the endpoint. This endpoint returns the caller's username as a string.
pt_br: O endpoint `/api/users/me` é protegido por RBAC. Somente os usuários que têm a função `user` podem acessar o endpoint. Esse endpoint retorna o nome de usuário do chamador como uma cadeia de caracteres.

source: To examine the completed example, download the {quickstarts-archive-url}[archive] or clone the Git repository:
pt_br: Para examinar o exemplo concluído, faça o download do {quickstarts-archive-url}[archive] ou clone o repositório Git:

source: You can find the solution in the `security-jpa-quickstart` link:{quickstarts-tree-url}/security-jpa-quickstart[directory] in the upstream {ProductName} community.
pt_br: Você pode encontrar a solução no link:{quickstarts-tree-url}/security-jpa-quickstart[diretório] `security-jpa-quickstart` na comunidade upstream do {ProductName}.

source: Create and verify the Maven project
pt_br: Crie e verifique o projeto Maven

source: For Quarkus Security to be able to map your security source to Jakarta Persistence entities, ensure that the Maven project that is used in this tutorial includes the `security-jpa` or the `security-jpa-reactive` extension.
pt_br: Para que o Quarkus Security possa mapear sua fonte de segurança para as entidades do Jakarta Persistence, certifique-se de que o projeto Maven usado neste tutorial inclua a extensão `security-jpa` ou `security-jpa-reactive` .

source: xref:hibernate-orm-panache.adoc[Hibernate ORM with Panache] is used to store your user identities but you can also use xref:hibernate-orm.adoc[Hibernate ORM] with the `security-jpa` extension. Both xref:hibernate-reactive.adoc[Hibernate Reactive] and xref:hibernate-reactive-panache.adoc[Hibernate Reactive with Panache] can be used with the `security-jpa-reactive` extension.
pt_br: xref:hibernate-orm-panache.adoc[Hibernate ORM com Panache] é usado para armazenar as identidades dos usuários, mas também é possível usar xref:hibernate-orm.adoc[Hibernate ORM] com a extensão `security-jpa`. Tanto xref:hibernate-reactive.adoc[o Hibernate Reativo] quanto xref:hibernate-reactive-panache.adoc[o Hibernate Reativo com Panache] podem ser usados com a extensão `security-jpa-reactive`.

source: You must also add your preferred database connector library. The instructions in this example tutorial use a PostgreSQL database for the identity store.
pt_br: Você também deve adicionar sua biblioteca de conector de banco de dados preferida. As instruções neste tutorial de exemplo usam um banco de dados PostgreSQL para o armazenamento de identidade.

source: Create the Maven project
pt_br: Crie o projeto Maven

source: You can either create a new Maven project with the Security Jakarta Persistence extension or you can add the extension to an existing Maven project. You can use either Hibernate ORM or Hibernate Reactive.
pt_br: Você pode criar um novo projeto Maven com a extensão Security Jakarta Persistence ou pode adicionar a extensão a um projeto Maven existente. Você pode usar o Hibernate ORM ou o Hibernate Reativo.

source: To create a new Maven project with the Jakarta Persistence extension, complete one of the following steps:
pt_br: Para criar um novo projeto Maven com a extensão Jakarta Persistence, conclua uma das etapas a seguir:

source: To create the Maven project with Hibernate ORM, use the following command:
pt_br: Para criar o projeto Maven com o Hibernate ORM, use o seguinte comando:

source: To create a Gradle project, add the `--gradle` or `--gradle-kotlin-dsl` option.
pt_br: Para criar um projeto Gradle, adicione a opção `--gradle` ou `--gradle-kotlin-dsl`.

source: For more information about how to install and use the Quarkus CLI, see the xref:cli-tooling.adoc[Quarkus CLI] guide.
pt_br: Para obter mais informações sobre como instalar e usar a CLI do Quarkus, consulte o guia xref:cli-tooling.adoc[Quarkus CLI].

source: To create a Gradle project, add the `-DbuildTool=gradle` or `-DbuildTool=gradle-kotlin-dsl` option.
pt_br: Para criar um projeto Gradle, adicione a opção '-DbuildTool=gradle' ou '-DbuildTool=gradle-kotlin-dsl'.

source: For Windows users:
pt_br: Para usuários do Windows:

source: If using cmd, (don't use backward slash `\` and put everything on the same line)
pt_br: Se estiver usando cmd, (não use barra invertida '\' e coloque tudo na mesma linha)

source: If using Powershell, wrap `-D` parameters in double quotes e.g. `"-DprojectArtifactId={create-app-artifact-id}"`
pt_br: Se estiver usando o Powershell, envolva os parâmetros '-D' entre aspas duplas, por exemplo, '"-DprojectArtifactId={create-app-artifact-id}"'

source: To create the Maven project with Hibernate Reactive, use the following command:
pt_br: Para criar o projeto Maven com o Hibernate Reativo, use o seguinte comando:

source: To add the Jakarta Persistence extension to an existing Maven project, complete one of the following steps:
pt_br: Para adicionar a extensão Jakarta Persistence a um projeto Maven existente, conclua uma das etapas a seguir:

source: To add the Security Jakarta Persistence extension to an existing Maven project with Hibernate ORM, run the following command from your project base directory:
pt_br: Para adicionar a extensão Security Jakarta Persistence a um projeto Maven existente com o Hibernate ORM, execute o seguinte comando no diretório base do projeto:

source: To add the Security Jakarta Persistence extension to an existing Maven project with Hibernate Reactive, run the following command from your project base directory:
pt_br: Para adicionar a extensão Security Jakarta Persistence a um projeto Maven existente com o Hibernate Reativo, execute o seguinte comando no diretório base do projeto:

source: Verify the quarkus-security-jpa dependency
pt_br: Verifique a dependência do quarkus-security-jpa

source: After you have run either of the preceding commands to create the Maven project, verify that the `security-jpa` dependency was added to your project build XML file.
pt_br: Depois de executar um dos comandos anteriores para criar o projeto Maven, verifique se a dependência `security-jpa` foi adicionada ao arquivo XML de construção do projeto.

source: To verify the `security-jpa` extension, check for the following configuration:
pt_br: Para verificar a extensão `security-jpa`, verifique a seguinte configuração:

source: To verify the `security-jpa-reactive` extension, check for the following configuration:
pt_br: Para verificar a extensão `security-jpa-reactive`, verifique a seguinte configuração:

source: Write the application
pt_br: Escreva a aplicação

source: Secure the API endpoint to determine who can access the application by using one of the following approaches:
pt_br: Proteja o endpoint da API para determinar quem pode acessar a aplicação usando uma das seguintes abordagens:

source: Implement the `/api/public` endpoint to allow all users access to the application. Add a regular Jakarta REST resource to your Java source code, as shown in the following code snippet:
pt_br: Implemente o endpoint `/api/public` para permitir que todos os usuários acessem a aplicação. Adicione um recurso Jakarta REST regular ao seu código-fonte Java, conforme mostrado no trecho de código a seguir:

source: Implement the `/api/public` endpoint to allow all users to access the application. The source code for the `/api/admin` endpoint is similar, but instead, you use a `@RolesAllowed` annotation to ensure that only users granted the `admin` role can access the endpoint. Add a Jakarta REST resource with the following `@RolesAllowed` annotation:
pt_br: Implemente o endpoint `/api/public` para permitir que todos os usuários acessem a aplicação. O código-fonte do endpoint `/api/admin` é semelhante, mas, em vez disso, você usa uma anotação `@RolesAllowed` para garantir que somente os usuários aos quais foi concedida a função `admin` possam acessar o endpoint. Adicione um recurso Jakarta REST com a seguinte anotação `@RolesAllowed` :

source: Implement an `/api/users/me` endpoint that can only be accessed by users who have the `user` role. Use `SecurityContext` to get access to the currently authenticated `Principal` user and to return their username, all of which is retrieved from the database.
pt_br: Implemente um endpoint `/api/users/me` que só possa ser acessado por usuários que tenham a função `user`. Use `SecurityContext` para obter acesso ao usuário `Principal` autenticado no momento e para retornar o nome de usuário dele, que é recuperado do banco de dados.

source: Define the user entity
pt_br: Defina a entidade do usuário

source: You can now describe how you want security information to be stored in the model by adding annotations to the `user` entity, as outlined in the following code snippet:
pt_br: Agora, você pode descrever como deseja que as informações de segurança sejam armazenadas no modelo, adicionando anotações à entidade `user`, conforme descrito no seguinte trecho de código:

source: The `security-jpa` extension initializes only if a single entity is annotated with `@UserDefinition`.
pt_br: A extensão `security-jpa` é inicializada somente se uma única entidade for anotada com `@UserDefinition`.

source: The `@UserDefinition` annotation must be present on a single entity and can be either a regular Hibernate ORM entity or a Hibernate ORM with Panache entity.
pt_br: A anotação `@UserDefinition` deve estar presente em uma única entidade e pode ser uma entidade Hibernate ORM comum ou uma entidade Hibernate ORM com Panache.

source: Indicates the field used for the username.
pt_br: Indica o campo usado para o nome de usuário.

source: Indicates the field used for the password. By default, it uses bcrypt-hashed passwords. You can configure it to use plain text or custom passwords.
pt_br: Indica o campo usado para a senha. Por padrão, ele usa senhas com hash bcrypt. Você pode configurá-lo para usar texto em claro ou senhas personalizadas.

source: Indicates the comma-separated list of roles added to the target principal representation attributes.
pt_br: Indica a lista separada por vírgulas de funções adicionadas aos atributos de representação do principal de destino.

source: Allows us to add users while hashing passwords with the proper bcrypt hash.
pt_br: Permite-nos adicionar usuários enquanto fazemos o hash das senhas com o hash bcrypt adequado.

source: Hibernate Reactive Panache uses `io.quarkus.hibernate.reactive.panache.PanacheEntity` instead of `io.quarkus.hibernate.orm.panache.PanacheEntity`. For more information, see link:{quickstarts-tree-url}/security-jpa-reactive-quickstart/src/main/java/org/acme/elytron/security/jpa/reactive/User.java[User file].
pt_br: O Hibernate Reactive Panache usa `io.quarkus.hibernate.reactive.panache.PanacheEntity` em vez de `io.quarkus.hibernate.orm.panache.PanacheEntity`. Para obter mais informações, consulte link:{quickstarts-tree-url}/security-jpa-reactive-quickstart/src/main/java/org/acme/elytron/security/jpa/reactive/User.java[Arquivo do usuário] .

source: Configure the application
pt_br: Configure a aplicação

source: Enable the built-in Quarkus xref:security-basic-authentication.adoc[Basic authentication] mechanism by setting the `quarkus.http.auth.basic` property to `true`:
pt_br: Ative o mecanismo xref:security-basic-authentication.adoc[de autenticação básico] do Quarkus integrado definindo a propriedade `quarkus.http.auth.basic` como `true` :

source: When secure access is required and no other authentication mechanisms are enabled, the built-in xref:security-basic-authentication.adoc[Basic authentication] of Quarkus is the fallback authentication mechanism. Therefore, in this tutorial, you do not need to set the property `quarkus.http.auth.basic` to `true`.
pt_br: Quando o acesso seguro é necessário e nenhum outro mecanismo de autenticação está ativado, a xref:security-basic-authentication.adoc[autenticação básica] integrada do Quarkus é o mecanismo de autenticação de reserva. Portanto, neste tutorial, você não precisa definir a propriedade `quarkus.http.auth.basic` como `true` .

source: Configure at least one data source in the `application.properties` file so the `security-jpa` extension can access your database. For example:
pt_br: Configure pelo menos uma fonte de dados no arquivo `application.properties` para que a extensão `security-jpa` possa acessar seu banco de dados. Por exemplo:

source: To initialize the database with users and roles, implement the `Startup` class, as outlined in the following code snippet:
pt_br: Para inicializar o banco de dados com usuários e funções, implemente a classe `Startup`, conforme descrito no trecho de código a seguir:

source: The URLs of Reactive datasources that are used by the `security-jpa-reactive` extension are set with the `quarkus.datasource.reactive.url` configuration property and not the `quarkus.datasource.jdbc.url` configuration property that is typically used by JDBC datasources.
pt_br: Os URLs dos recursos de dados reativos usados pela extensão `security-jpa-reactive` são definidos com a propriedade de configuração `quarkus.datasource.reactive.url` e não com a propriedade de configuração `quarkus.datasource.jdbc.url` , que normalmente é usada pelos recursos de dados JDBC.

source: In this tutorial, a PostgreSQL database is used for the identity store. link:https://hibernate.org/orm/[Hibernate ORM] automatically creates the database schema on startup. This approach is suitable for development but is not recommended for production. Therefore adjustments are needed in a production environment.
pt_br: Neste tutorial, um banco de dados PostgreSQL é usado para o armazenamento de identidade. link:https://hibernate.org/orm/[O Hibernate ORM] cria automaticamente o esquema do banco de dados na inicialização. Essa abordagem é adequada para o desenvolvimento, mas não é recomendada para a produção. Portanto, são necessários ajustes em um ambiente de produção.

source: The preceding example demonstrates how the application can be protected and identities provided by the specified database.
pt_br: O exemplo anterior demonstra como a aplicação pode ser protegida e as identidades fornecidas pelo banco de dados especificado.

source: In a production environment, do not store plain text passwords. As a result, the `security-jpa` defaults to using bcrypt-hashed passwords.
pt_br: Em um ambiente de produção, não armazene senhas em claro. Como resultado, o `security-jpa` tem como padrão o uso de senhas com hash bcrypt.

source: Test your application by using Dev Services for PostgreSQL
pt_br: Teste sua aplicação usando o Dev Services para PostgreSQL

source: Complete the integration testing of your application in JVM and native modes by using xref:dev-services.adoc#databases[Dev Services for PostgreSQL] before you run your application in production mode.
pt_br: Conclua o teste de integração da sua aplicação nos modos JVM e nativo usando o xref:dev-services.adoc#databases[Dev Services para PostgreSQL] antes de executar a aplicação no modo de produção.

source: To run your application in dev mode:
pt_br: Para executar sua aplicação no modo de desenvolvimento:

source: The following properties configuration demonstrates how you can enable PostgreSQL testing to run in production (`prod`) mode only. In this scenario, `Dev Services for PostgreSQL` launches and configures a `PostgreSQL` test container.
pt_br: A configuração de propriedades a seguir demonstra como você pode permitir que o teste do PostgreSQL seja executado somente no modo de produção ( `prod` ). Nesse cenário, o `Dev Services para PostgreSQL` inicia e configura um contêiner de teste `PostgreSQL` .

source: If you add the `%prod.` profile prefix, data source properties are not visible to `Dev Services for PostgreSQL` and are only observed by an application running in production mode.
pt_br: Se você adicionar o prefixo de perfil `%prod.` , as propriedades da fonte de dados não estarão visíveis em `Dev Services para PostgreSQL` e só serão observadas por uma aplicação em execução no modo de produção.

source: To write the integration test, use the following code sample:
pt_br: Para escrever o teste de integração, use o exemplo de código a seguir:

source: As you can see in this code sample, you do not need to start the test container from the test code.
pt_br: Como você pode ver neste exemplo de código, não é necessário iniciar o contêiner de teste a partir do código de teste.

source: Use Curl or a browser to test your application
pt_br: Use o Curl ou um navegador para testar sua aplicação

source: Use the following example to start the PostgreSQL server:
pt_br: Use o exemplo a seguir para iniciar o servidor PostgreSQL:

source: Compile and run the application
pt_br: Compile e execute a aplicação

source: Compile and run your Quarkus application by using one of the following methods:
pt_br: Compile e execute sua aplicação Quarkus usando um dos métodos a seguir:

source: JVM mode
pt_br: Modo JVM

source: Compile the application:
pt_br: Compile a aplicação:

source: Run the application:
pt_br: Execute a aplicação:

source: Native mode
pt_br: Modo nativo

source: Access and test the application security
pt_br: Acesse e teste a segurança da aplicação

source: When your application is running, you can access its endpoints by using one of the following Curl commands.
pt_br: Quando a aplicação está em execução, você pode acessar seus endpoints usando um dos seguintes comandos Curl.

source: Connect to a protected endpoint anonymously:
pt_br: Conecte-se a um endpoint protegido de forma anônima:

source: Connect to a protected endpoint as an authorized user:
pt_br: Conecte-se a um endpoint protegido como um usuário autorizado:

source: You can also access the same endpoint URLs by using a browser.
pt_br: Você também pode acessar os mesmos URLs de endpoint usando um navegador.

source: If you use a browser to anonymously connect to a protected resource, a Basic authentication form displays, prompting you to enter credentials.
pt_br: Se o usuário usar um navegador para se conectar anonimamente a um recurso protegido, será exibido um formulário de autenticação básica, solicitando que o usuário insira as credenciais.

source: Results
pt_br: Resultados

source: When you provide the credentials of an authorized user, for example, `admin:admin`, the Jakarta Persistence security extension authenticates and loads the roles of the user. The `admin` user is authorized to access the protected resources.
pt_br: Quando o usuário fornece as credenciais de um usuário autorizado, por exemplo, `admin:admin` , a extensão de segurança do Jakarta Persistence autentica e carrega as funções do usuário. O usuário `admin` está autorizado a acessar os recursos protegidos.

source: If a resource is protected with `@RolesAllowed("user")`, the user `admin` is not authorized to access the resource because it is not assigned to the "user" role, as shown in the following shell example:
pt_br: Se um recurso estiver protegido com `@RolesAllowed("user")`, o usuário `admin` não está autorizado a acessar o recurso porque não está atribuído à função "user", conforme mostrado no exemplo de shell a seguir:

source: Finally, the user named `user` is authorized and the security context contains the principal details, for example, the username.
pt_br: Por fim, o usuário chamado `user` é autorizado e o contexto de segurança contém os detalhes principais, por exemplo, o nome de usuário.

source: What's next
pt_br: O que vem a seguir

source: Congratulations! You have learned how to create and test a secure Quarkus application by combining the built-in xref:security-basic-authentication.adoc[Basic authentication] in Quarkus with the Jakarta Persistence identity provider.
pt_br: Parabéns! Você aprendeu a criar e testar uma aplicação Quarkus segura combinando a xref:security-basic-authentication.adoc[autenticação básica] integrada do Quarkus com o provedor de identidade Jakarta Persistence.

source: After completing this tutorial, you can explore more advanced security mechanisms in Quarkus. The following information shows you how to use `OpenID Connect` for secure single sign-on access to your Quarkus endpoints:
pt_br: Depois de concluir este tutorial, você pode explorar mecanismos de segurança mais avançados no Quarkus. As informações a seguir mostram como usar o `OpenID Connect` para obter acesso seguro de login único aos endpoints do Quarkus:

source: xref:security-oidc-bearer-token-authentication.adoc[OIDC Bearer token authentication]
pt_br: link:security-oidc-bearer-token-authentication.html[Autenticação de Token Bearer OIDC]

source: xref:security-oidc-code-flow-authentication.adoc[OIDC code flow mechanism for protecting web applications]
pt_br: xref:security-oidc-code-flow-authentication.adoc[Mecanismo de fluxo de código OIDC para proteger aplicações Web]

source: References
pt_br: Referências

source: xref:security-overview.adoc[Quarkus Security overview]
pt_br: xref:security-overview.adoc[Visão geral do Quarkus Security]

source: xref:security-architecture.adoc[Quarkus Security architecture]
pt_br: xref:security-architecture.adoc[Arquitetura do Quarkus Security]

source: xref:security-authentication-mechanisms.adoc#other-supported-authentication-mechanisms[Other supported authentication mechanisms]
pt_br: xref:security-authentication-mechanisms.adoc#other-supported-authentication-mechanisms[Outros mecanismos de autenticação suportados]

source: xref:security-identity-providers.adoc[Identity providers]
pt_br: xref:security-identity-providers.adoc[Provedores de identidade]

source: xref:hibernate-orm-panache.adoc[Simplified Hibernate ORM with Panache]
pt_br: xref:hibernate-orm-panache.adoc[ORM simplificado do Hibernate com Panache]

source: xref:hibernate-orm.adoc[Using Hibernate ORM and Jakarta Persistence]
pt_br: xref:hibernate-orm.adoc[Usando o Hibernate ORM e o Jakarta Persistence]
