Repository: quarkusio/pt.quarkus.io
Catalog: l10n/po/*/_guides/security-properties.adoc.po
Languages: es

source: Using Security with .properties File
es: Utilizando la seguridad con el archivo .properties

source: Quarkus provides support for properties file based authentication that is intended for development and testing purposes. It is not recommended that this be used in production as at present only plaintext and MD5 hashed passwords are used, and properties files are generally too limited to use in production.
es: Quarkus proporciona soporte para la autenticación basada en archivos de propiedades que está pensada para propósitos de desarrollo y prueba. No se recomienda su uso en producción, ya que en la actualidad sólo se utilizan contraseñas en texto plano y con hash MD5, y los archivos de propiedades suelen ser demasiado limitados para su uso en producción.

source: Add the following to your build file:
es: Añade lo siguiente a tu archivo de construcción:

source: Configuration
es: Configuración

source: The elytron-security-properties-file extension currently supports two different realms for the storage of authentication and authorization information. Both support storage of this information in properties files. The following sections detail the specific configuration properties.
es: La extensión elytron-security-properties-file admite actualmente dos ámbitos diferentes para el almacenamiento de información de autenticación y autorización. Ambos soportan el almacenamiento de esta información en archivos de propiedades. Las siguientes secciones detallan las propiedades de configuración específicas.

source: Properties Files Realm Configuration
es: Archivos de propiedades Configuración del dominio

source: The properties files realm supports mapping of users to password and users to roles with a combination of properties files. They are configured with properties starting with `quarkus.security.users.file`.
es: El ámbito de los archivos de propiedades admite la asignación de usuarios a contraseñas y de usuarios a roles con una combinación de archivos de propiedades. Se configuran con propiedades que comienzan con `quarkus.security.users.file`.

source: example application.properties file section for property files realm
es: ejemplo de la sección del archivo application.properties para los archivos de propiedades realm

source: Users.properties
es: Usuarios.propiedades

source: The `quarkus.security.users.file.users` configuration property specifies a classpath resource which is a properties file with a user to password mapping, one per line. The following <<test-users-example>> illustrates the format:
es: La propiedad de configuración `quarkus.security.users.file.users` especifica un recurso classpath que es un archivo de propiedades con un mapeo de usuario a contraseña, uno por línea. El siguiente <<test-users-example>> ilustra el formato:

source: example test-users.properties file
es: ejemplo de archivo test-users.properties

source: User `scott` has password defined as `jb0ss`
es: El usuario `scott` tiene una contraseña definida como `jb0ss`

source: User `jdoe` has password defined as `p4ssw0rd`
es: El usuario `jdoe` tiene una contraseña definida como `p4ssw0rd`

source: This file has the usernames and passwords stored in plain text, which is not recommended. If plain-text is set to false (or omitted) in the config then passwords must be stored in the form `MD5 ( username : realm : password )`. This can be generated for the first example above by running the command `echo -n scott:MyRealm:jb0ss | md5` from the command line.
es: Este archivo tiene los nombres de usuario y las contraseñas almacenados en texto plano, lo cual no es recomendable. Si el texto plano se establece como falso (u omitido) en la configuración, entonces las contraseñas deben ser almacenadas en la forma `MD5 ( username : realm : password )`. Esto se puede generar para el primer ejemplo anterior ejecutando el comando `echo -n scott:MyRealm:jb0ss | md5` desde la línea de comandos.

source: example test-roles.properties file
es: ejemplo de archivo test-roles.properties

source: User `scott` has been assigned the roles `Admin`, `admin`, `Tester` and `user`
es: El usuario `scott` tiene asignados los roles `Admin`, `admin`, `Tester` y `user`

source: User `jdoe` has been assigned the role `NoRolesUser`
es: Al usuario `jdoe` se le ha asignado el rol `NoRolesUser`

source: User `stuart` has been assigned the roles `admin` and `user`.
es: El usuario `stuart` tiene asignados los roles `admin` y `user`.

source: Embedded Realm Configuration
es: Configuración del reino integrado

source: The embedded realm also supports mapping of users to password and users to roles. It uses the main `application.properties` Quarkus configuration file to embed this information. They are configured with properties starting with `quarkus.security.users.embedded`.
es: El ámbito integrado también admite la asignación de usuarios a contraseñas y de usuarios a roles. Utiliza el archivo de configuración principal de `application.properties` Quarkus para incrustar esta información. Se configuran con propiedades que comienzan con `quarkus.security.users.embedded`.

source: The following is an example application.properties file section illustrating the embedded realm configuration:
es: A continuación se muestra una sección del archivo application.properties de ejemplo que ilustra la configuración del ámbito integrado:

source: example application.properties file section for embedded realm
es: ejemplo de sección del archivo application.properties para el ámbito integrado

source: As with the first example this file has the usernames and passwords stored in plain text, which is not recommended. If plain-text is set to false (or omitted) in the config then passwords must be stored in the form `MD5 ( username : realm : password )`. This can be generated for the first example above by running the command `echo -n scott:MyRealm:jb0ss | md5` from the command line.
es: Al igual que en el primer ejemplo, este archivo tiene los nombres de usuario y las contraseñas almacenados en texto plano, lo que no es recomendable. Si el texto plano se establece como falso (u omitido) en la configuración, entonces las contraseñas deben ser almacenadas en la forma `MD5 ( username : realm : password )`. Esto se puede generar para el primer ejemplo anterior ejecutando el comando `echo -n scott:MyRealm:jb0ss | md5` desde la línea de comandos.

source: Embedded Users
es: Usuarios integrados

source: The user to password mappings are specified in the `application.properties` file by properties keys of the form `quarkus.security.users.embedded.users.<user>=<password>`. The following <<password-example>> illustrates the syntax with 4 user to password mappings:
es: Las asignaciones de usuario a contraseña se especifican en el archivo `application.properties` mediante claves de propiedades de la forma `quarkus.security.users.embedded.users.<user>=<password>`. El siguiente <<password-example>> ilustra la sintaxis con 4 asignaciones de usuario a contraseña:

source: Example Passwords
es: Ejemplos de contraseñas

source: User `scott` has password `jb0ss`
es: El usuario `scott` tiene contraseña `jb0ss`

source: User `stuart` has password `test`
es: El usuario `stuart` tiene contraseña `test`

source: Embedded Roles
es: Funciones integradas

source: The user to role mappings are specified in the `application.properties` file by properties keys of the form `quarkus.security.users.embedded.roles.<user>=role1[,role2[,role3[,...]]]`. The following <<roles-example>> illustrates the syntax with 4 user to role mappings:
es: Las asignaciones de usuario a rol se especifican en el archivo `application.properties` mediante claves de propiedades de la forma `quarkus.security.users.embedded.roles.<user>=role1[,role2[,role3[,…​]]]`. El siguiente <<roles-example>> ilustra la sintaxis con 4 asignaciones de usuario a rol:

source: Example Roles
es: Ejemplo de funciones

source: User `scott` has roles `Admin`, `admin`, `Tester`, and `user`
es: El usuario `scott` tiene los roles `Admin`, `admin`, `Tester`, y `user`

source: User `stuart` has roles `admin` and `user`
es: El usuario `stuart` tiene los roles `admin` y `user`

source: References
es: Referencias
