Repository: quarkusio/pt.quarkus.io
Catalog: l10n/po/*/_guides/security-identity-providers-concept.adoc.po
Languages: es

source: Identity providers
es: Proveedores de identidad

source: In the Quarkus Security framework, identity providers play a key role in authentication and authorization, providing services for storing and verifying user identities. The Jakarta Persistence `IdentityProvider` creates a `SecurityIdentity` instance used during user authentication to verify and authorize access requests, making your Quarkus application secure.
es: En el marco de seguridad de Quarkus, los proveedores de identidad desempeñan un papel clave en la autenticación y autorización, proporcionando servicios para almacenar y verificar las identidades de los usuarios. Jakarta Persistence `IdentityProvider` crea una instancia `SecurityIdentity` que se utiliza durante la autenticación del usuario para verificar y autorizar las solicitudes de acceso, haciendo que su aplicación Quarkus sea segura.

source: `IdentityProvider` converts the authentication credentials provided by `HttpAuthenticationMechanism` to a `SecurityIdentity` instance.
es: `IdentityProvider` convierte las credenciales de autenticación proporcionadas por `HttpAuthenticationMechanism` en una instancia de `SecurityIdentity`.

source: Some extensions, for example, `OIDC`, `OAuth2`, and `SmallRye JWT` have inline `IdentityProvider` implementations specific to the supported authentication flow. For example, `quarkus-oidc` uses its own `IdentityProvider` to convert a token to a `SecurityIdentity` instance.
es: Algunas extensiones, por ejemplo, `OIDC`, `OAuth2`, y `SmallRye JWT` tienen implementaciones inline `IdentityProvider` específicas para el flujo de autenticación soportado. Por ejemplo, `quarkus-oidc` utiliza su propio `IdentityProvider` para convertir un token en una instancia de `SecurityIdentity`.

source: If you use Basic or form-based authentication, you must add an `IdentityProvider` instance that can convert a username and password to a `SecurityIdentity` instance.
es: Si utiliza autenticación básica o basada en formularios, debe añadir una instancia `IdentityProvider` que pueda convertir un nombre de usuario y una contraseña en una instancia `SecurityIdentity`.

source: To get started with security in Quarkus, we recommend you combine the Quarkus built-in Basic HTTP authentication with the Jakarta Persistence identity provider to enable role-based access control (RBAC).
es: Para comenzar con la seguridad en Quarkus, le recomendamos que combine la autenticación HTTP básica incorporada en Quarkus con el proveedor de identidad Jakarta Persistence para habilitar el control de acceso basado en roles (RBAC).

source: For more information about Basic authentication, its mechanisms, and related identity providers, see the following resources:
es: Para obtener más información sobre la autenticación básica, sus mecanismos y los proveedores de identidad relacionados, consulte los siguientes recursos:

source: xref:security-jpa-concept.adoc[Quarkus Security with Jakarta Persistence]
es: xref:security-jpa-concept.adoc[Seguridad Quarkus con Jakarta Persistence]

source: xref:security-basic-authentication-tutorial.adoc[Secure a Quarkus application with Basic authentication and Jakarta Persistence]
es: xref:security-basic-authentication-tutorial.adoc[Proteger una aplicación Quarkus con autenticación básica y Jakarta Persistence]

source: xref:security-authentication-mechanisms-concept.adoc#form-auth[Form-based authentication]
es: xref:security-authentication-mechanisms-concept.adoc#form-auth[Autenticación basada en formularios]

source: xref:security-jdbc.adoc[Using security with JDBC]
es: xref:security-jdbc.adoc[Uso de la seguridad con JDBC]

source: xref:security-ldap.adoc[Using security with an LDAP realm]
es: xref:security-ldap.adoc[Utilizar la seguridad con un dominio LDAP]

source: xref:security-overview-concept.adoc[Quarkus Security overview]
es: xref:security-overview-concept.adoc[Visión general de Quarkus Security]
