Repository: quarkusio/pt.quarkus.io
Catalog: l10n/po/*/_guides/security-overview.adoc.po
Languages: pt_br

source: Quarkus Security overview
pt_br: Visão geral do Quarkus Security

source: Quarkus Security is a framework that provides the architecture, multiple authentication and authorization mechanisms, and other tools to build secure and production-quality Java applications.
pt_br: O Quarkus Security é um framework que fornece a arquitetura, vários mecanismos de autenticação e autorização e outras ferramentas para desenvolver aplicativos Java seguros e com qualidade de produção.

source: Before building security into your Quarkus applications, learn about the xref:security-architecture.adoc[Quarkus Security architecture] and the different authentication mechanisms and features you can use.
pt_br: Antes de incorporar segurança às suas aplicações Quarkus, aprenda sobre a xref:security-architecture.adoc[arquitetura do Quarkus Security] e os diferentes mecanismos de autenticação e recursos que o você pode usar.

source: Key features of Quarkus Security
pt_br: Principais recursos do Quarkus Security

source: The Quarkus Security framework provides built-in security authentication mechanisms for Basic, Form-based, and mutual TLS (mTLS) authentication. You can also use other well-known xref:security-authentication-mechanisms.adoc#other-supported-authentication-mechanisms[authentication mechanisms], such as OpenID Connect (OIDC) and WebAuthn.
pt_br: O framework Quarkus Security fornece mecanismos de autenticação de segurança nativos para autenticação Básica, baseada em Formulário e TLS mútua (mTLS). Você também pode utilizar outros xref:security-authentication-mechanisms.adoc#other-supported-authentication-mechanisms[mecanismos de autenticação] conhecidos como: o OpenID Connect (OIDC) e o WebAuthn.

source: Authentication mechanisms depend on xref:security-identity-providers.adoc[Identity providers] to verify the authentication credentials and map them to a `SecurityIdentity` instance with the username, roles, original authentication credentials, and other attributes.
pt_br: Os mecanismos de autenticação dependem dos xref:security-identity-providers.adoc[Identity providers] para verificar as credenciais de autenticação e mapeá-las para uma instância `SecurityIdentity` com o nome de usuário, os papéis, as credenciais de autenticação originais e outros atributos.

source: {project-name} also includes built-in security to allow for role-based access control (RBAC) based on the common security annotations `@RolesAllowed`, `@DenyAll`, `@PermitAll` on REST endpoints, and Contexts and Dependency Injection (CDI) beans. For more information, see the Quarkus xref:security-authorize-web-endpoints-reference.adoc[Authorization of web endpoints] guide.
pt_br: {project-name} também inclui segurança nativa para permitir o Controle de Acesso Baseado em Papéis (RBAC) com base nas anotações de segurança comuns `@RolesAllowed` , `@DenyAll` , `@PermitAll` em endpoints REST e beans de Injeção de Dependência e Contextos (CDI). Para obter mais informações, consulte o guia Quarkus xref:security-authorize-web-endpoints-reference.adoc[Authorization of web endpoints] .

source: Quarkus Security also supports the following features:
pt_br: O Quarkus Security também oferece suporte aos seguintes recursos:

source: xref:security-vulnerability-detection.adoc[Security vulnerability detection and National Vulnerability Database (NVD) registration]
pt_br: xref:security-vulnerability-detection.adoc[Security vulnerability detection e registro US National Vulnerability Database (NVD)]

source: Quarkus Security is also highly customizable. For more information, see the Quarkus xref:security-customization.adoc[Security tips and tricks] guide.
pt_br: O Quarkus Security também é altamente personalizável. Para obter mais informações, consulte o guia de xref:security-customization.adoc[dicas e técnicas] do Quarkus xref:security-customization.adoc[Security] .

source: Getting started with Quarkus Security
pt_br: Primeiros passos com o Quarkus Security

source: To get started with security in Quarkus, consider securing your Quarkus application endpoints with the built-in Quarkus xref:security-basic-authentication.adoc[Basic authentication] and the Jakarta Persistence identity provider and enabling role-based access control.
pt_br: Para começar a usar a segurança no Quarkus, considere proteger os endpoints da sua aplicação Quarkus com a xref:security-basic-authentication.adoc[authentication] integrada do Quarkus xref:security-basic-authentication.adoc[Basic] e o Jakarta Persistence identity provider e habilitar o controle de acesso baseado em papéis.

source: Complete the steps in the xref:security-getting-started-tutorial.adoc[Getting started with Security by using Basic authentication and Jakarta Persistence] tutorial.
pt_br: Conclua as etapas do tutorial xref:security-getting-started-tutorial.adoc[Getting started with Security by using Basic authentication and Jakarta Persistence (Começando com Security usando Basic authentication e Jakarta Persistence] ).

source: After successfully securing your Quarkus application with Basic authentication, you can increase the security further by adding more advanced authentication mechanisms, for example, the Quarkus xref:security-oidc-code-flow-authentication.adoc[OpenID Connect (OIDC) authorization code flow mechanism] guide.
pt_br: Após garantir com sucesso a segurança da sua aplicação Quarkus com a Basic authentication, você pode aumentar ainda mais a segurança adicionando mecanismos de autenticação mais avançados, por exemplo, consulte o guia xref:security-oidc-code-flow-authentication.adoc[Mecanismo de fluxo de autorização] Quarkus xref:security-oidc-code-flow-authentication.adoc[OpenID Connect (OIDC)] .

source: Quarkus Security testing
pt_br: Teste com Quarkus Security

source: For guidance on testing Quarkus Security features and ensuring that your Quarkus applications are securely protected, see the xref:security-testing.adoc[Security testing] guide.
pt_br: Para obter orientação sobre testar recursos de segurança do Quarkus Security e garantir que suas aplicações Quarkus estejam protegidas de forma segura, consulte o guia de xref:security-testing.adoc[Security testing] .

source: More about security features in Quarkus
pt_br: Mais informações sobre os recursos de segurança do Quarkus

source: Cross-origin resource sharing
pt_br: Cross-Origin Resource Sharing (CORS)

source: To make your Quarkus application accessible to another application running on a different domain, you need to configure cross-origin resource sharing (CORS). For more information about the CORS filter Quarkus provides, see the xref:security-cors.adoc#cors-filter[CORS filter] section of the Quarkus "Cross-origin resource sharing" guide.
pt_br: Para tornar sua aplicação Quarkus acessível a partir de outra aplicação em execução em um domínio diferente, é necessário configurar o Cross-Origin Resource Sharing (CORS). Para obter mais informações sobre o filtro CORS que o Quarkus fornece, consulte a seção de xref:security-cors.adoc#cors-filter[CORS filter] do guia "Cross-Origin Resource Sharing" do Quarkus.

source: Cross-Site Request Forgery (CSRF) prevention
pt_br: Prevenção de Cross-Site Request Forgery (CSRF)

source: Quarkus Security provides a RESTEasy Reactive filter that can protect your applications against a https://owasp.org/www-community/attacks/csrf[Cross-Site Request Forgery] attack. For more information, see the Quarkus xref:security-csrf-prevention.adoc[Cross-Site Request Forgery Prevention] guide.
pt_br: O Quarkus Security fornece um filtro RESTEasy Reactive que pode proteger seus aplicativos contra um ataque link:https://owasp.org/www-community/attacks/csrf[Cross-Site Request Forgery]. Para obter mais informações, consulte o guia Quarkus xref:security-csrf-prevention.adoc[Prevenção contra Cross-Site Request Forgery] .

source: SameSite cookies
pt_br: Cookies do SameSite

source: You can add a link:https://developer.mozilla.org/en-US/docs/Web/HTTP/Headers/Set-Cookie/SameSite[SameSite] cookie property to any of the cookies set by a Quarkus endpoint. For more information, see the xref:http-reference.adoc#same-site-cookie[SameSite cookies] section of the Quarkus "HTTP reference" guide.
pt_br: Você pode adicionar a propriedade de cookie link:https://developer.mozilla.org/en-US/docs/Web/HTTP/Headers/Set-Cookie/SameSite[SameSite] a qualquer um dos cookies definidos por um Quarkus endpoint. Para obter mais informações, consulte a seção de xref:http-reference.adoc#same-site-cookie[cookies SameSite] do guia "Referência HTTP" do Quarkus.

source: Secrets engines
pt_br: Mecanismos de segredos

source: You can use secrets engines with Quarkus to store, generate, or encrypt data.
pt_br: Você pode usar mecanismos de segredos com o Quarkus para armazenar, gerar ou criptografar dados.

source: Quarkus provides additional extensions in Quarkiverse for securely storing credentials, for example, link:{vault-guide}[Quarkus and HashiCorp Vault].
pt_br: O Quarkus fornece extensões adicionais no Quarkiverse para armazenar credenciais de forma segura, por exemplo, link:{vault-guide}[Quarkus e HashiCorp Vault] .

source: Secrets in environment properties
pt_br: Segredos nas propriedades do ambiente

source: Quarkus provides support to store secrets in environment properties. For more information, see the Quarkus xref:config.adoc#secrets-in-environment-properties[store secrets in an environment properties file] guide.
pt_br: O Quarkus oferece suporte para armazenar segredos nas propriedades do ambiente. Para obter mais informações, consulte o guia Quarkus xref:config.adoc#secrets-in-environment-properties[armazenar segredos em um arquivo de propriedades de ambiente] .

source: Secure serialization
pt_br: Serialização segura

source: If your Quarkus Security architecture includes RESTEasy Reactive and Jackson, Quarkus can limit the fields included in JSON serialization based on the configured security. For more information, see the xref:resteasy-reactive.adoc#secure-serialization[JSON serialization] section of the Quarkus “Writing REST services with RESTEasy Reactive” guide.
pt_br: Se a arquitetura do seu Quarkus Security incluir o RESTEasy Reactive e o Jackson, o Quarkus pode limitar os campos incluídos na serialização JSON com base na segurança configurada. Para obter mais informações, consulte a seção xref:resteasy-reactive.adoc#secure-serialization[de JSON serialization] do guia Quarkus "Escrevendo REST services com RESTEasy Reactive".

source: Secure auto-generated resources by REST Data with Panache
pt_br: Proteja os recursos gerados automaticamente por REST Data com Panache

source: If you use the REST Data with Panache extension to auto-generate your resources, you can still use security annotations within the package `jakarta.annotation.security`. For more information, see the xref:rest-data-panache.adoc#securing-endpoints[Securing endpoints] section of the Quarkus "Generating Jakarta REST resources with Panache" guide.
pt_br: Se você utilizar a extensão REST Data com Panache para auto-gerar seus recursos, você ainda pode utilizar anotações de segurança dentro do pacote `jakarta.annotation.security` . Para mais informações, consulte a seção xref:rest-data-panache.adoc#securing-endpoints[Securing endpoints] do guia "Gerando recursos REST Jakarta com Panache" do Quarkus.

source: Most Quarkus tags get reported in the US link:https://nvd.nist.gov[National Vulnerability Database (NVD)]. For information about security vulnerabilities, see the xref:security-vulnerability-detection.adoc[Security vulnerability detection and reporting in Quarkus] guide.
pt_br: A maioria das tags do Quarkus são relatadas no link:https://nvd.nist.gov[de US National Vulnerability Database (NVD] ). Para obter informações sobre vulnerabilidades de segurança, consulte o guia xref:security-vulnerability-detection.adoc[Security vulnerability detection and reporting no Quarkus].

source: References
pt_br: Referências

source: xref:security-getting-started-tutorial.adoc[Getting started with Security by using Basic authentication and Jakarta Persistence]
pt_br: xref:security-getting-started-tutorial.adoc[Começando com Security usando a Basic authentication e o Jakarta Persistence]

source: xref:security-oidc-code-flow-authentication-tutorial.adoc[Protect a web application by using OIDC authorization code flow]
pt_br: xref:security-oidc-code-flow-authentication-tutorial.adoc[Proteger uma aplicação web utilizando o OIDC authorization code flow]

source: xref:security-oidc-bearer-token-authentication-tutorial.adoc[Protect a service application by using OIDC Bearer token authentication]
pt_br: xref:security-oidc-bearer-token-authentication-tutorial.adoc[Proteger uma aplicação de serviço utilizando a OIDC Bearer token authentication]
