Repository: quarkusio/pt.quarkus.io
Catalog: l10n/po/*/_guides/spring-cloud-config-client.adoc.po
Languages: es

source: Reading properties from Spring Cloud Config Server
es: Lectura de propiedades del servidor de configuración de Spring Cloud

source: This guide explains how your Quarkus application can read configuration properties at runtime from the https://cloud.spring.io/spring-cloud-config[Spring Cloud Config Server].
es: Esta guía explica cómo su aplicación Quarkus puede leer las propiedades de configuración en tiempo de ejecución desde el https://cloud.spring.io/spring-cloud-config[Servidor de Configuración de Spring Cloud].

source: Prerequisites
es: Requisitos previos

source: Solution
es: Solución

source: We recommend that you follow the instructions in the next sections and create the application step by step.
es: Le recomendamos que siga las instrucciones de las siguientes secciones y cree la aplicación paso a paso.

source: Stand up a Config Server
es: Poner en marcha un servidor de configuración

source: To stand up the Config Server required for this guide, please follow the instructions outlined https://github.com/spring-guides/gs-centralized-configuration#stand-up-a-config-server[here]. The end result of that process is a running Config Server that will provide the `Hello world` value for a configuration property named `message` when the application querying the server is named `a-bootiful-client`.
es: Para poner en marcha el Config Server necesario para esta guía, siga las instrucciones indicadas https://github.com/spring-guides/gs-centralized-configuration#stand-up-a-config-server[aquí]. El resultado final de ese proceso es un Config Server en funcionamiento que proporcionará el valor `Hello world` para una propiedad de configuración llamada `message` cuando la aplicación que consulta el servidor se llama `a-bootiful-client`.

source: Creating the Maven project
es: Creación del proyecto Maven

source: First, we need a new project. Create a new project with the following command:
es: En primer lugar, necesitamos un nuevo proyecto. Cree un nuevo proyecto con el siguiente comando:

source: This command generates a project which imports the `spring-cloud-config-client` extension.
es: Este comando genera un proyecto que importa la extensión `spring-cloud-config-client`.

source: If you already have your Quarkus project configured, you can add the `spring-cloud-config-client` extension to your project by running the following command in your project base directory:
es: Si ya tienes configurado tu proyecto Quarkus, puedes añadir la extensión `spring-cloud-config-client` a tu proyecto ejecutando el siguiente comando en el directorio base de tu proyecto:

source: This will add the following to your build file:
es: Esto añadirá lo siguiente a su archivo de construcción:

source: As we want to use configuration properties obtained from the Config Server, we will update the `GreetingResource` to inject the `message` property. The updated code will look like this:
es: Como queremos utilizar propiedades de configuración obtenidas del Servidor de Configuración, actualizaremos el `GreetingResource` para inyectar la propiedad `message`. El código actualizado tendrá el siguiente aspecto:

source: Configuring the application
es: Configuración de la aplicación

source: Quarkus provides various configuration knobs under the `quarkus.spring-cloud-config` root. For the purposes of this guide, our Quarkus application is going to be configured in `application.properties` as follows:
es: Quarkus proporciona varios controles de configuración bajo la raíz `quarkus.spring-cloud-config`. Para los propósitos de esta guía, nuestra aplicación Quarkus va a ser configurada en `application.properties` como sigue:

source: Package and run the application
es: Empaquetar y ejecutar la aplicación

source: Run the application with:
es: Ejecuta la aplicación con:

source: Open your browser to http://localhost:8080/greeting.
es: Abra su navegador en http://localhost:8080/greeting.

source: The result should be: `Hello world` as it is the value obtained from the Spring Cloud Config server.
es: El resultado debe ser: `Hello world` ya que es el valor obtenido del servidor Spring Cloud Config.

source: Run the application as a native executable
es: Ejecutar la aplicación como un ejecutable nativo

source: You can of course create a native image using the instructions of the xref:building-native-image.adoc[Building a native executable guide].
es: Por supuesto, puedes crear una imagen nativa siguiendo las instrucciones de la xref:building-native-image.html[guía Construir un ejecutable nativo].

source: More Spring guides
es: Más guías de Spring

source: Quarkus has more Spring compatibility features. See the following guides for more details:
es: Quarkus tiene más características de compatibilidad con Spring. Consulte las siguientes guías para obtener más detalles:

source: xref:spring-di.adoc[Quarkus - Extension for Spring DI]
es: xref:spring-di.html[Quarkus - Extensión para Spring DI]

source: xref:spring-web.adoc[Quarkus - Extension for Spring Web]
es: xref:spring-web.html[Quarkus - Extensión para Spring Web]

source: xref:spring-data-jpa.adoc[Quarkus - Extension for Spring Data JPA]
es: xref:spring-data-jpa.html[Quarkus - Extensión para Spring Data JPA]

source: xref:spring-data-rest.adoc[Quarkus - Extension for Spring Data REST]
es: xref:spring-data-rest.html[Quarkus - Extensión para Spring Data REST]

source: xref:spring-security.adoc[Quarkus - Extension for Spring Security]
es: xref:spring-security.html[Quarkus - Extensión para la seguridad de Spring]

source: xref:spring-boot-properties.adoc[Quarkus - Extension for Spring Boot properties]
es: xref:spring-boot-properties.html[Quarkus - Extensión para las propiedades de Spring Boot]

source: xref:spring-cache.adoc[Quarkus - Extension for Spring Cache]
es: xref:spring-cache.html[Quarkus - Extensión para Spring Cache]

source: xref:spring-scheduled.adoc[Quarkus - Extension for Spring Scheduled]
es: xref:spring-scheduled.html[Quarkus - Extensión para la primavera programada]

source: Spring Cloud Config Client Reference
es: Referencia del cliente Spring Cloud Config
