Repository: quarkusio/pt.quarkus.io
Catalog: l10n/po/*/_guides/tooling.adoc.po
Languages: es, pt

source: Using our Tooling
es: Utilización de nuestras herramientas
pt: Usando nossas ferramentas

source: Quarkus comes with a toolchain enabling developers from live reload all the way down to deploying a Kubernetes application. In addition, there are plugins and extensions to all major IDEs.
es: Quarkus viene con una cadena de herramientas que permite a los desarrolladores desde la recarga en vivo hasta el despliegue de una aplicación Kubernetes. Además, hay plugins y extensiones para los principales IDEs.
pt: O Quarkus vem com uma conjunto de ferramentas que auxilia os desenvolvedores desde o _live reload_ até a implantação de um aplicativo Kubernetes. Além disso, existem plug-ins e extensões para todos os principais IDEs.

source: In this guide, we will explore:
es: En esta guía, exploraremos:
pt: Neste guia, iremos explorar:

source: how to use xref:maven-tooling.adoc[Maven] as a build tool
es: cómo utilizar xref:maven-tooling.html[Maven] como herramienta de construcción
pt: como utilizar link:maven-tooling.html[o Maven] como ferramenta de construção

source: how to use xref:gradle-tooling.adoc[Gradle] as a build tool
es: cómo utilizar xref:gradle-tooling.html[Gradle] como herramienta de construcción
pt: como utilizar link:gradle-tooling.html[o Gradle] como uma ferramenta de construção

source: how to use the xref:cli-tooling.adoc[CLI] for your toolchain
es: cómo utilizar la xref:cli-tooling.html[CLI] para su cadena de herramientas
pt: como utilizar o link:cli-tooling.html[CLI] para o seu conjunto de ferramentas

source: how to create and scaffold a new project
es: cómo crear y estructurar un nuevo proyecto
pt: como criar e pré-definir um novo projeto

source: how to deal with extensions
es: cómo hacer frente a las extensiones
pt: como lidar com as extensões

source: how to enable live reload
es: cómo activar la recarga en vivo
pt: como ativar o _live reload_

source: how to develop your application in your IDE
es: cómo desarrollar su aplicación en su IDE
pt: como desenvolver a sua aplicação no seu IDE

source: how to compile your application natively
es: cómo compilar su aplicación de forma nativa
pt: como compilar a sua aplicação nativamente

source: how to set up Quarkus tools in xref:ide-tooling.adoc[Visual Studio Code, Eclipse IDE, Eclipse Che and IntelliJ IDEA]
es: cómo configurar las herramientas de Quarkus en xref:ide-tooling.adoc[Visual Studio Code, Eclipse IDE, Eclipse Che e IntelliJ]
pt: como configurar as ferramentas Quarkus no link:ide-tooling.html[Visual Studio Code, Eclipse IDE, Eclipse Che e IntelliJ IDEA]

source: Choosing your build tool
es: Elección de la herramienta de construcción
pt: Escolhendo sua ferramenta de construção

source: Quarkus comes with a toolchain to help you at all development stages. You can use Maven or Gradle as build tool. And we offer a CLI that is convenient to use (coming soon).
es: Quarkus viene con una cadena de herramientas para ayudarle en todas las etapas de desarrollo. Puedes usar Maven o Gradle como herramienta de construcción. Y ofrecemos una CLI que es conveniente de usar (próximamente).

source: xref:maven-tooling.adoc[Maven]
es: xref:maven-tooling.html[Maven]

source: xref:gradle-tooling.adoc[Gradle]
es: xref:gradle-tooling.html[Gradle]

source: xref:cli-tooling.adoc[CLI]
es: xref:cli-tooling.html[CLI]

source: xref:ide-tooling.adoc[IDE]
es: xref:ide-tooling.html[IDE]
