Repository: quarkusio/pt.quarkus.io
Catalog: l10n/po/*/_guides/transaction.adoc.po
Languages: pt

source: Using Transactions in Quarkus
pt: Usando transações no Quarkus

source: Quarkus comes with a Transaction Manager and uses it to coordinate and expose transactions to your applications. Each extension dealing with persistence will integrate with it for you. And you will explicitly interact with transactions via CDI. This guide will walk you through all that.
pt: O Quarkus vem com um Gerenciador de Transações e o usa para coordenar e expor transações para seus aplicativos. Cada extensão que lida com persistência irá se integrar com ele para você. E você interagirá explicitamente com as transações via CDI. Este guia irá guiá-lo através de tudo isso.

source: Setting it up
pt: Configuração

source: You don't need to worry about setting it up most of the time as extensions needing it will simply add it as a dependency. Hibernate ORM for example will include the transaction manager and set it up properly.
pt: Você não precisa se preocupar em configurá-lo na maioria das vezes, pois as extensões que precisam dele simplesmente o adicionarão como uma dependência. O Hibernate ORM, por exemplo, incluirá o gerenciador de transações e o configurará corretamente.

source: You might need to add it as a dependency explicitly if you are using transactions directly without Hibernate ORM for example. Add the following to your build file:
pt: Talvez seja necessário adicioná-lo como uma dependência explicitamente se estiver usando transações diretamente sem o Hibernate ORM, por exemplo. Adicione o seguinte ao seu arquivo de compilação:

source: Starting and stopping transactions: defining your boundaries
pt: Iniciando e interrompendo transações: definindo seus limites

source: You can define your transaction boundaries either declaratively with `@Transactional` or programmatically with `QuarkusTransaction`. You can also use the JTA `UserTransaction` API directly, however this is less user-friendly than `QuarkusTransaction`.
pt: Você pode definir seus limites de transação declarativamente com '@Transactional' ou programaticamente com 'QuarkusTransaction'. Você também pode usar a API JTA 'UserTransaction' diretamente, no entanto, isso é menos amigável do que 'QuarkusTransaction'.

source: Declarative approach
pt: Abordagem declarativa

source: The easiest way to define your transaction boundaries is to use the `@Transactional` annotation on your entry method (`jakarta.transaction.Transactional`).
pt: A forma mais fácil de definir os limites da sua transação é utilizar a anotação `@Transactional` no seu método de entrada ( `jakarta.transaction.Transactional`).

source: This annotation defines your transaction boundaries and will wrap this call within a transaction.
pt: Essa anotação define os limites da transação e encapsulará essa chamada em uma transação.

source: A `RuntimeException` crossing the transaction boundaries will roll back the transaction.
pt: Um 'RuntimeException' cruzando os limites da transação reverterá a transação.

source: `@Transactional` can be used to control transaction boundaries on any CDI bean at the method level or at the class level to ensure every method is transactional. That includes REST endpoints.
pt: '@Transactional' pode ser usado para controlar limites de transação em qualquer bean CDI no nível do método ou no nível da classe para garantir que cada método seja transacional. Isso inclui pontos de extremidade REST.

source: You can control whether and how the transaction is started with parameters on `@Transactional`:
pt: Você pode controlar se e como a transação é iniciada com parâmetros em '@Transactional':

source: `@Transactional(REQUIRED)` (default): starts a transaction if none was started, stays with the existing one otherwise.
pt: '@Transactional(REQUIRED)' (padrão): inicia uma transação se nenhuma foi iniciada, permanece com a existente caso contrário.

source: `@Transactional(REQUIRES_NEW)`: starts a transaction if none was started ; if an existing one was started, suspends it and starts a new one for the boundary of that method.
pt: «@Transactional(REQUIRES_NEW)»: inicia uma transação se não tiver sido iniciada nenhuma; se um existente foi iniciado, suspende-o e inicia um novo para o limite desse método.

source: `@Transactional(MANDATORY)`: fails if no transaction was started ; works within the existing transaction otherwise.
pt: `@Transactional(MANDATORY)`: falha se não tiver sido iniciada nenhuma transação; caso contrário, funciona dentro da transação existente.

source: `@Transactional(SUPPORTS)`: if a transaction was started, joins it ; otherwise works with no transaction.
pt: `@Transactional(SUPPORTS)`: se foi iniciada uma transação, junta-se a ela; caso contrário, não funciona com nenhuma transação.

source: `@Transactional(NOT_SUPPORTED)`: if a transaction was started, suspends it and works with no transaction for the boundary of the method ; otherwise works with no transaction.
pt: `@Transactional(NOT_SUPPORTED)`: Se uma transação foi iniciada, suspende-a e trabalha sem transação durante o limite do método; caso contrário, trabalha sem transação.

source: `@Transactional(NEVER)`: if a transaction was started, raises an exception ; otherwise works with no transaction.
pt: `@Transactional(NEVER)`: se foi iniciada uma transação, levanta uma exceção; caso contrário, funciona sem transação.

source: `REQUIRED` or `NOT_SUPPORTED` are probably the most useful ones. This is how you decide whether a method is to be running within or outside a transaction. Make sure to check the JavaDoc for the precise semantic.
pt: ‘REQUIRED’ ou 'NOT_SUPPORTED' são provavelmente os mais úteis. É assim que você decide se um método deve ser executado dentro ou fora de uma transação. Certifique-se de verificar o JavaDoc para a semântica precisa.

source: The transaction context is propagated to all calls nested in the `@Transactional` method as you would expect (in this example `childDAO.addToGiftList()` and `santaDAO.addToSantaTodoList()`). The transaction will commit unless a runtime exception crosses the method boundary. You can override whether an exception forces the rollback or not by using `@Transactional(dontRollbackOn=SomeException.class)` (or `rollbackOn`).
pt: O contexto da transação é propagado a todas as chamadas aninhadas no método `@Transactional` como seria de esperar (neste exemplo `childDAO.addToGiftList()` e `santaDAO.addToSantaTodoList()`). A transação será confirmada a menos que uma exceção de tempo de execução atravesse o limite do método. É possível substituir se uma exceção força ou não a reversão utilizando `@Transactional(dontRollbackOn=SomeException.class)` (ou `rollbackOn`).

source: You can also programmatically ask for a transaction to be marked for rollback. Inject a `TransactionManager` for this.
pt: Você também pode solicitar programaticamente que uma transação seja marcada para reversão. Injete um 'TransactionManager' para isso.

source: Inject the `TransactionManager` to be able to activate `setRollbackOnly` semantic.
pt: Injete o `TransactionManager` para poder ativar a semântica `setRollbackOnly`.

source: Programmatically decide to set the transaction for rollback.
pt: Decida programaticamente definir a transação para reversão.

source: Transaction Configuration
pt: Configuração de transações

source: Advanced configuration of the transaction is possible with the use of the `@TransactionConfiguration` annotation that is set in addition to the standard `@Transactional` annotation on your entry method or at the class level.
pt: A configuração avançada da transação é possível com a utilização da anotação `@TransactionConfiguration` que é definida para além da anotação `@Transactional` padrão no seu método de entrada ou ao nível da classe.

source: The `@TransactionConfiguration` annotation allows to set a timeout property, in seconds, that applies to transactions created within the annotated method.
pt: A anotação '@TransactionConfiguration' permite definir uma propriedade de tempo limite, em segundos, que se aplica a transações criadas dentro do método anotado.

source: This annotation may only be placed on the top level method delineating the transaction. Annotated nested methods once a transaction has started will throw an exception.
pt: Essa anotação só pode ser colocada no método de nível superior que delineia a transação. Os métodos aninhados anotados depois que uma transação for iniciada lançarão uma exceção.

source: If defined on a class, it is equivalent to defining it on all the methods of the class marked with `@Transactional`. The configuration defined on a method takes precedence over the configuration defined on a class.
pt: Se for definida numa classe, é equivalente a defini-la em todos os métodos da classe marcados com `@Transactional`. A configuração definida num método tem precedência sobre a configuração definida numa classe.

source: Reactive extensions
pt: Extensões reativas

source: If your `@Transactional`-annotated method returns a reactive value, such as:
pt: Se o método anotado '@Transactional' retornar um valor reativo, como:

source: `CompletionStage` (from the JDK)
pt: `CompletionStage` (do JDK)

source: `Publisher` (from Reactive-Streams)
pt: `Publisher` (de Reactive-Streams)

source: Any type which can be converted to one of the two previous types using Reactive Type Converters
pt: Qualquer tipo que possa ser convertido em um dos dois tipos anteriores usando conversores de tipo reativo

source: then the behaviour is a bit different, because the transaction will not be terminated until the returned reactive value is terminated. In effect, the returned reactive value will be listened to and if it terminates exceptionally the transaction will be marked for rollback, and will be committed or rolled-back only at termination of the reactive value.
pt: então o comportamento é um pouco diferente, porque a transação não será encerrada até que o valor reativo retornado seja encerrado. Na verdade, o valor reativo retornado será ouvido e, se for encerrado excepcionalmente, a transação será marcada para reversão e será confirmada ou revertida somente no término do valor reativo.

source: This allows your reactive methods to keep on working on the transaction asynchronously until their work is really done, and not just until the reactive method returns.
pt: Isso permite que seus métodos reativos continuem trabalhando na transação de forma assíncrona até que seu trabalho seja realmente concluído, e não apenas até que o método reativo retorne.

source: If you need to propagate your transaction context across your reactive pipeline, please see the xref:context-propagation.adoc[Context Propagation guide].
pt: Se você precisar propagar seu contexto de transação pelo pipeline reativo, consulte o xref:context-propagation.adoc[Guia de propagação de contexto].

source: Programmatic Approach
pt: Abordagem Programática

source: You can use static methods on `QuarkusTransaction` to define transaction boundaries. This provides two different options, a functional approach that allows you to run a lambda within the scope of a transaction, or by using explicit `begin`, `commit` and `rollback` methods.
pt: Você pode usar métodos estáticos em 'QuarkusTransaction' para definir limites de transação. Isso fornece duas opções diferentes, uma abordagem funcional que permite executar um lambda dentro do escopo de uma transação ou usando métodos explícitos 'begin', 'commit' e 'rollback'.

source: The above example shows a few different ways the API can be used.
pt: O exemplo acima mostra algumas maneiras diferentes de usar a API.

source: The first method simply calls begin, does some work and commits it. This created transaction is tied to the CDI request scope, so if it is still active when the request scope is destroyed then it will be automatically rolled back. This removes the need to explicitly catch exceptions and call `rollback`, and acts as a safety net against inadvertent transaction leaks, however it does mean that this can only be used when the request scope is active. The second example in the method calls begin with a timeout option, and then rolls back the transaction.
pt: O primeiro método simplesmente chama começar, faz algum trabalho e o compromete. Essa transação criada está vinculada ao escopo de requisição do CDI, portanto, se ainda estiver ativa quando o escopo for destruído, ela será revertida automaticamente. Isso elimina a necessidade de capturar explicitamente exceções e chamar `rollback` e atua como uma rede de segurança contra vazamentos inadvertidos de transações, no entanto, significa que isso só pode ser usado quando o escopo da solicitação estiver ativo. O segundo exemplo nas chamadas de método começa com uma opção de tempo limite e, em seguida, reverte a transação.

source: The second method shows the use of lambda scoped transactions with `QuarkusTransaction.runner(...)`; the first example just runs a `Runnable` within a new transaction, the second does the same but joining the existing transaction (if any), and the third calls a `Callable` with some specific options. In particular the `exceptionHandler` method can be used to control if the transaction is rolled back or not on exception.
pt: O segundo método mostra o uso de transações com escopo lambda com 'QuarkusTransaction.runner(...) `; o primeiro exemplo apenas executa um 'Runnable' dentro de uma nova transação, o segundo faz o mesmo, mas juntando-se à transação existente (se houver), e o terceiro chama um 'Callable' com algumas opções específicas. Em particular, o método 'exceptionHandler' pode ser usado para controlar se a transação é revertida ou não na exceção.

source: The following semantics are supported:
pt: A seguinte semântica é suportada:

source: If a transaction is already associated with the current thread a `QuarkusTransactionException` will be thrown, otherwise a new transaction is started, and follows all the normal lifecycle rules.
pt: Se uma transação já estiver associada à thread atual, será lançado um `QuarkusTransactionException`. Caso contrário, é iniciada uma nova transação, que segue todas as regras normais do ciclo de vida.

source: If no transaction is active then a new transaction will be started, and committed when the method ends. If an exception is thrown the exception handler registered by `#exceptionHandler(Function)` will be called to decide if the TX should be committed or rolled back. If an existing transaction is active then the method is run in the context of the existing transaction. If an exception is thrown the exception handler will be called, however a result of `ExceptionResult#ROLLBACK` will result in the TX marked as rollback only, while a result of `ExceptionResult#COMMIT` will result in no action being taken.
pt: Se nenhuma transação estiver ativa, será iniciada uma nova transação, que será confirmada quando o método terminar. Se for lançada uma exceção, o gestor de excepções registado em `#exceptionHandler(Function)` será chamado para decidir se a TX deve ser confirmada ou revertida. Se uma transação existente estiver ativa, o método é executado no contexto da transação existente. Se for lançada uma exceção, o gestor de excepções será chamado, mas um resultado de `ExceptionResult#ROLLBACK` fará com que o TX seja marcado apenas como reversão, enquanto um resultado de `ExceptionResult#COMMIT` fará com que não seja tomada qualquer ação.

source: If an existing transaction is already associated with the current thread then the transaction is suspended, then a new transaction is started which follows all the normal lifecycle rules, and when it's complete the original transaction is resumed. Otherwise, a new transaction is started, and follows all the normal lifecycle rules.
pt: Se uma transação existente já estiver associada ao thread atual, a transação é suspensa, é iniciada uma nova transação que segue todas as regras normais do ciclo de vida e, quando estiver concluída, a transação original é retomada. Caso contrário, é iniciada uma nova transação, que segue todas as regras normais do ciclo de vida.

source: If no transaction is active then these semantics are basically a no-op. If a transaction is active then it is suspended, and resumed after the task is run. The exception handler will never be consulted when these semantics are in use, specifying both an exception handler and these semantics are considered an error. These semantics allows for code to easily be run outside the scope of a transaction.
pt: Se nenhuma transação estiver ativa, estas semânticas são basicamente um no-op. Se estiver ativa uma transação, esta é suspensa e retomada após a execução da tarefa. O manipulador de exceção nunca será consultado quando estas semânticas estiverem a ser utilizadas, especificando um manipulador de exceção e estas semânticas são consideradas um erro. Esta semântica permite que o código seja facilmente executado fora do âmbito de uma transação.

source: Legacy API approach
pt: Abordagem API legada

source: The less easy way is to inject a `UserTransaction` and use the various transaction demarcation methods.
pt: A forma menos fácil é injetar um `UserTransaction` e utilizar os vários métodos de demarcação de transacções.

source: You cannot use `UserTransaction` in a method having a transaction started by a `@Transactional` call.
pt: Não é possível utilizar `UserTransaction` num método com uma transação iniciada por uma chamada `@Transactional`.

source: Configuring the transaction timeout
pt: Configurando o tempo limite da transação

source: You can configure the default transaction timeout, the timeout that applies to all transactions managed by the transaction manager, via the property `quarkus.transaction-manager.default-transaction-timeout`, specified as a duration.
pt: Pode configurar o tempo limite de transação predefinido, o tempo limite que se aplica a todas as transacções geridas pelo gestor de transacções, através da propriedade `quarkus.transaction-manager.default-transaction-timeout`, especificada como uma duração.

source: The default value is 60 seconds.
pt: O valor padrão é 60 segundos.

source: Configuring transaction node name identifier
pt: Configurando o identificador de nome do nó de transação

source: Narayana, as the underlying transaction manager, has a concept of a unique node identifier. This is important if you consider using XA transactions that involve multiple resources.
pt: Narayana, como o gerente de transações subjacente, tem um conceito de um identificador de nó exclusivo. Isso é importante se você considerar o uso de transações XA que envolvem vários recursos.

source: The node name identifier plays a crucial part in the identification of a transaction. The node name identifier is forged into the transaction id when the transaction is created. Based on the node name identifier, the transaction manager is capable of recognizing the XA transaction counterparts created in database or JMS broker. The identifier makes possible for the transaction manager to roll back the transaction counterparts during recovery.
pt: O identificador do nome do nó desempenha um papel crucial na identificação de uma transação. O identificador do nome do nó é forjado na identificação da transação quando esta é criada. Com base no identificador do nome do nó, o gestor de transacções é capaz de reconhecer as contrapartidas da transação XA criadas na base de dados ou no corretor JMS. O identificador permite que o gestor de transacções reverta as contrapartes da transação durante a recuperação.

source: The node name identifier needs to be unique per transaction manager deployment. And the node identifier needs to be stable over the transaction manager restarts.
pt: O identificador do nome do nó tem de ser único por cada implementação do gestor de transacções. E o identificador do nó tem de ser estável durante os reinícios do gestor de transacções.

source: The node name identifier may be configured via the property `quarkus.transaction-manager.node-name`.
pt: O identificador do nome do nó pode ser configurado através da propriedade `quarkus.transaction-manager.node-name`.

source: Using `@TransactionScoped` to bind CDI beans to the transaction lifecycle
pt: Utilizar `@TransactionScoped` para ligar beans CDI ao ciclo de vida da transação

source: You can define beans that live for as long as a transaction, and through CDI lifecycle events perform actions when a transaction starts and ends.
pt: É possível definir beans que duram tanto tempo quanto uma transação e, através de eventos de ciclo de vida CDI, executam acções quando uma transação começa e termina.

source: Just assign the transaction xref:cdi.adoc#bean-scope[scope] to such beans using the `@TransactionScoped` annotation:
pt: Basta atribuir o link:cdi.html#bean-scope[âmbito] da transação a esses beans utilizando a anotação `@TransactionScoped`:

source: Alternatively, if you don't necessarily need to hold state during the transaction, and just want to react to transaction start/end events, you can simply declare event listeners in a differently scoped bean:
pt: Em alternativa, se não precisar necessariamente de manter o estado durante a transação e quiser apenas reagir a eventos de início/fim de transação, pode simplesmente declarar ouvintes de eventos num bean com um âmbito diferente:

source: The `event` object represents the transaction ID, and defines `toString()`/`equals()`/`hashCode()` accordingly.
pt: O objeto `event` representa o ID da transação e define `toString()`/ `equals()`/ `hashCode()` em conformidade.

source: In listener methods, you can access more information about the transaction in progress by accessing the `TransactionManager`, which is a CDI bean and can be ``@Inject``ed.
pt: Nos métodos listener, é possível aceder a mais informações sobre a transação em curso, acedendo a `TransactionManager`, que é um bean CDI e pode ser `@Inject`ed.

source: Configure storing of Quarkus transaction logs in a database
pt: Configurar o armazenamento dos registos de transacções do Quarkus numa base de dados

source: In cloud environments where persistent storage is not available, such as when application containers are unable to use persistent volumes, you can configure the transaction management to store transaction logs in a database by using a JDBC datasource.
pt: Em ambientes de nuvem em que o armazenamento persistente não está disponível, como quando os contêineres de aplicativos não podem usar volumes persistentes, é possível configurar o gerenciamento de transações para armazenar logs de transações em um banco de dados usando uma fonte de dados JDBC.

source: While there are several benefits to using a database to store transaction logs, you might notice a reduction in performance compared with using the file system to store the logs.
pt: Embora existam vários benefícios na utilização de uma base de dados para armazenar registos de transacções, poderá notar uma redução no desempenho em comparação com a utilização do sistema de ficheiros para armazenar os registos.

source: Quarkus allows the following JDBC-specific configuration of the object store included in `quarkus.transaction-manager.object-store.<property>` properties, where <property> can be:
pt: O Quarkus permite a seguinte configuração específica de JDBC do armazenamento de objectos incluída em `quarkus.transacion-manager.object-store.&amp;lt;property&amp;gt;` propriedades, onde &lt;property&gt; pode ser:

source: `type` (_string_): Configure this property to `jdbc` to enable usage of a Quarkus JDBC datasource for transaction logging. The default value is `file-system`.
pt: `type` _(string_): Configure esta propriedade para `jdbc` para permitir a utilização de uma fonte de dados JDBC do Quarkus para registo de transacções. O valor predefinido é `file-system`.
