Repository: quarkusio/pt.quarkus.io
Catalog: l10n/po/*/_guides/transaction.adoc.po
Languages: pt

source: `datasource` (_string_): Specify the name of the datasource for the transaction log storage. If no value is provided for the `datasource` property, Quarkus uses the xref:datasource.adoc#configure-datasources[default datasource].
pt: `datasource` _(string_): Especifique o nome da fonte de dados para o armazenamento do registo de transacções. Se não for fornecido nenhum valor para a propriedade `datasource`, o Quarkus utiliza a link:datasource.html#configure-datasources[fonte de dados predefinida].

source: `create-table` (_boolean_): When set to `true`, the transaction log table gets automatically created if it does not already exist. The default value is `false`.
pt: `create-table` _(booleano_): Quando definido para `true`, a tabela do registo de transacções é criada automaticamente se ainda não existir. O valor predefinido é `false`.

source: `drop-table` (_boolean_): When set to `true`, the tables are dropped on startup if they already exist. The default value is `false`.
pt: `drop-table` _(booleano_): Quando definido para `true`, as tabelas são eliminadas no arranque se já existirem. O valor predefinido é `false`.

source: `table-prefix` (string): Specify the prefix for a related table name. The default value is `quarkus_`.
pt: `table-prefix` (string): Especifique o prefixo para um nome de tabela relacionado. O valor padrão é `quarkus_`.

source: Additional information:
pt: Informações adicionais:

source: You can manually create the transaction log table during the initial setup by setting the `create-table` property to `true`.
pt: É possível criar manualmente a tabela de registro de transações durante a configuração inicial, definindo a propriedade `create-table` como `true`.

source: JDBC datasources and ActiveMQ Artemis allow the enlistment and automatically register the `XAResourceRecovery`.
pt: Os recursos de dados JDBC e o ActiveMQ Artemis permitem a inscrição e registram automaticamente o `XAResourceRecovery`.

source: JDBC datasources is part of `quarkus-agroal`, and it needs to use `quarkus.datasource.jdbc.transactions=XA`.
pt: Os recursos de dados JDBC fazem parte de `quarkus-agroal` e precisam ser usados em `quarkus.datasource.jdbc.transactions=XA`.

source: ActiveMQ Artemis is part of `quarkus-pooled-jms`, and it needs to use `quarkus.pooled-jms.transaction=XA`.
pt: O ActiveMQ Artemis faz parte do `quarkus-pooled-jms` e precisa usar o `quarkus.pooled-jms.transaction=XA`.

source: For more information, see link:https://issues.redhat.com/browse/CEQ-4878[CEQ-4878].
pt: Para obter mais informações, consulte o link:https://issues.redhat.com/browse/CEQ-4878[CEQ-4878].

source: If your application employs eXtended Architecture (XA) transactions, enable the transaction crash recovery feature by using `quarkus.transaction-manager.enable-recovery=true`, to safeguard your data in the event of application crashes or failures. The default value for XA Recovery is `false`.
pt: Se seu aplicativo empregar transações XA (eXtended Architecture), habilite o recurso de recuperação de falhas de transação usando `quarkus.transaction-manager.enable-recovery=true`, para proteger seus dados em caso de falhas ou falhas do aplicativo. O valor padrão para XA Recovery é `false`.

source: To work around the current known issue of link:https://issues.redhat.com/browse/AG-209[Agroal having a different view on running transaction checks], set the datasource transaction type for the datasource responsible for writing the transaction logs to `disabled`:
pt: Para contornar o problema conhecido atual de link:https://issues.redhat.com/browse/AG-209[Agroal tendo uma exibição diferente sobre a execução de verificações de transação], defina o tipo de transação de fonte de dados para a fonte de dados responsável por gravar os logs de transação como 'disabled':

source: This example uses TX_LOG as the datasource name.
pt: Este exemplo utiliza TX_LOG como o nome da fonte de dados.

source: Why always having a transaction manager?
pt: Por que sempre ter um gerenciador de transações?

source: Does it work everywhere I want to?
pt: Funciona em todos os lugares que eu quiser?

source: Yep, it works in your Quarkus application, in your IDE, in your tests, because all of these are Quarkus applications. JTA has some bad press for some people. I don't know why. Let's just say that this is not your grandpa's JTA implementation. What we have is perfectly embeddable and lean.
pt: Sim, funciona na sua aplicação Quarkus, no seu IDE, nos seus testes, porque todas estas são aplicações Quarkus. O JTA tem má fama para algumas pessoas. Não sei porquê. Digamos apenas que esta não é a implementação JTA do seu avô. O que temos é perfeitamente incorporável e simples.

source: Does it do 2 Phase Commit and slow down my app?
pt: Fazer 2 Phase Commit e torna a minha aplicação mais lenta?

source: No, this is an old folk tale. Let's assume it essentially comes for free and let you scale to more complex cases involving several datasources as needed.
pt: Não, este é um velho conto popular. Vamos supor que ele essencialmente vem de graça e permite que você dimensione para casos mais complexos envolvendo várias fontes de dados, conforme necessário.

source: I don't need transaction when I do read only operations, it's faster.
pt: Não preciso de transação quando faço operações somente leitura, é mais rápido.

source: Wrong. + First off, just disable the transaction by marking your transaction boundary with `@Transactional(NOT_SUPPORTED)` (or `NEVER` or `SUPPORTS` depending on the semantic you want). + Second, it's again fairy tale that not using transaction is faster. The answer is, it depends on your DB and how many SQL SELECTs you are making. No transaction means the DB does have a single operation transaction context anyway. + Third, when you do several SELECTs, it's better to wrap them in a single transaction because they will all be consistent with one another. Say your DB represents your car dashboard, you can see the number of kilometers remaining and the fuel gauge level. By reading it in one transaction, they will be consistent. If you read one and the other from two different transactions, then they can be inconsistent. It can be more dramatic if you read data related to rights and access management for example.
pt: Errado. + Primeiro, basta desativar a transação marcando seu limite de transação com '@Transactional(NOT_SUPPORTED)' (ou ‘NEVER’ ou 'SUPPORTS', dependendo da semântica desejada). + Segundo, é novamente um conto de fadas que não usar transação é mais rápido. A resposta é, depende do seu banco de dados e quantos SQL SELECTs você está fazendo. Nenhuma transação significa que o banco de dados tem um único contexto de transação de operação de qualquer maneira. + Terceiro, quando você faz vários SELECTs, é melhor envolvê-los em uma única transação, porque todos eles serão consistentes uns com os outros. Digamos que seu DB representa o painel do seu carro, você pode ver o número de quilômetros restantes e o nível do medidor de combustível. Ao lê-lo em uma transação, eles serão consistentes. Se você ler uma e outra de duas transações diferentes, elas podem ser inconsistentes. Pode ser mais dramático se você ler dados relacionados a direitos e gerenciamento de acesso, por exemplo.

source: Why do you prefer JTA vs Hibernate's transaction management API
pt: Por que você prefere a API de gerenciamento de transações do JTA vs Hibernate

source: Managing the transactions manually via `entityManager.getTransaction().begin()` and friends lead to a butt ugly code with tons of try catch finally that people get wrong. Transactions are also about JMS and other database access, so one API makes more sense.
pt: Gerenciar as transações manualmente via 'entityManager.getTransaction().begin()' e os amigos levam a um código feio com toneladas de tentativa de pegar finalmente que as pessoas erram. As transações também são sobre JMS e outros acessos ao banco de dados, portanto, uma API faz mais sentido.

source: It's a mess because I don't know if my Jakarta Persistence persistence unit is using `JTA` or `Resource-level` Transaction
pt: É uma bagunça porque não sei se minha unidade de persistência Jakarta Persistence está usando a transação 'JTA' ou 'Resource-level'

source: It's not a mess in Quarkus :) Resource-level was introduced to support Jakarta Persistence in a non managed environment. But Quarkus is both lean and a managed environment, so we can safely always assume we are in JTA mode. The end result is that the difficulties of running Hibernate ORM + CDI + a transaction manager in Java SE mode are solved by Quarkus.
pt: Não é uma confusão no Quarkus :) O Resource-level foi introduzido para suportar a Jakarta Persistence num ambiente não gerido. Mas o Quarkus é um ambiente gerido e não gerido, pelo que podemos sempre assumir que estamos em modo JTA. O resultado final é que as dificuldades de executar o Hibernate ORM + CDI + um gestor de transacções no modo Java SE são resolvidas pelo Quarkus.
