Repository: quarkusio/pt.quarkus.io
Catalog: l10n/po/*/_guides/update-quarkus.adoc.po
Languages: pt

source: Update projects to the latest Quarkus version
pt: Atualizando projetos para a versão mais recente do Quarkus

source: You can update or upgrade your {project-name} projects to the latest version of {project-name} by using an update command.
pt: Você pode atualizar ou subir a versão dos seus projetos {project-name} para a versão mais recente de {project-name} utilizando um comando update.

source: The update command primarily employs OpenRewrite recipes to automate updates for most project dependencies, source code, and documentation. Although these recipes update many migration items, they do not cover all the items detailed in the {quarkus-migration-guide}.
pt: O comando update utiliza principalmente `receitas` OpenRewrite para automatizar atualizações para a maioria das dependências do projeto, código-fonte e documentação. Embora essas `receitas` atualizem muitos itens de migração, elas não cobrem todos os itens detalhados no {quarkus-migration-guide}.

source: Post-update, if expected updates are missing, consider the following reasons:
pt: Se as atualizações esperadas estiverem faltando, considere os seguintes motivos:

source: The recipe might not include a specific item in your project.
pt: A receita OpenRewrite pode não incluir um item específico do seu projeto.

source: Your project might use an extension that is incompatible with the latest {project-name} version.
pt: O seu projeto pode estar utilizando uma extensão que é incompatível com a versão mais recente do {project-name}.

source: For projects that use Hibernate ORM or Hibernate Reactive, review the link:https://github.com/quarkusio/quarkus/wiki/Migration-Guide-3.0:-Hibernate-ORM-5-to-6-migration[Hibernate ORM 5 to 6 migration] quick reference. The following update command covers only a subset of this guide.
pt: Para projetos que usam o Hibernate ORM ou o Hibernate Reactive, consulte a referência link:https://github.com/quarkusio/quarkus/wiki/Migration-Guide-3.0:-Hibernate-ORM-5-to-6-migration[migração do ORM Hibernate 5 para 6]. O comando de atualização a seguir abrange apenas um subconjunto deste guia.

source: Prerequisites
pt: Pré-requisitos

source: A project based on {project-name} version 2.13 or later.
pt: Um projeto baseado na versão 2.13 ou posterior de {project-name}.

source: Procedure
pt: Procedimento

source: Create a working branch for your project by using your version control system.
pt: Crie uma `branch` para o seu projeto utilizando o seu sistema de controle de versão.

source: To use the Quarkus CLI in the next step, xref:cli-tooling.adoc#installing-the-cli[install the latest version of the Quarkus CLI]. Confirm the version number using `quarkus -v`.
pt: Para utilizar o Quarkus CLI no passo seguinte, link:cli-tooling.html#installing-the-cli[instale a versão mais recente do Quarkus CLI]. Confirme o número da versão utilizando `quarkus -v`.

source: Go to the project directory and update the project to the latest stream:
pt: Vá para o diretório do projeto e atualize o projeto para a última versão disponível:

source: Using Quarkus CLI
pt: Utilizando o Quarkus CLI

source: Optional: To specify a particular stream, use the `stream` option; for example: `--stream=3.0`
pt: Opcional: Para especificar uma versão, utilize a opção `stream`; por exemplo: `--stream=3.0`

source: Using Maven
pt: Utilizando o Maven

source: Optional: To specify a particular stream, use the `Dstream` option; for example: `-Dstream=3.0`
pt: Opcional: Para especificar uma versão, utilize a opção `Dstream`; por exemplo: `-Dstream=3.0`

source: Analyze the update command output for potential instructions and perform the suggested tasks if necessary.
pt: Analise a saída do comando de atualização para obter possíveis instruções e execute as tarefas sugeridas, se necessário.

source: Use a diff tool to inspect all changes.
pt: Utilize uma ferramenta de comparação para inspecionar todas as alterações.

source: Review the {quarkus-migration-guide} for items that were not updated by the update command. If your project has such items, implement the additional steps advised in these topics.
pt: Revisite o {quarkus-migration-guide} para itens que não foram atualizados pelo comando `update`. Se o seu projeto tiver esses itens, implemente os passos adicionais aconselhados nestes tópicos.

source: Ensure the project builds without errors, all tests pass, and the application functions as required before deploying to production.
pt: Garanta que o projeto é construído sem erros, que todos os testes são aprovados e que a aplicação funciona conforme esperado antes de ser implantado em produção.
