Repository: quarkusio/pt.quarkus.io
Catalog: l10n/po/*/_guides/upx.adoc.po
Languages: es

source: Compressing native executables using UPX
es: Compresión de ejecutables nativos con UPX

source: https://upx.github.io/[Ultimate Packer for eXecutables (UPX)] is a compression tool reducing the size of executables. Quarkus can compress the produced native executable to reduce its size. Such compression is interesting when:
es: https://upx.github.io/[Ultimate Packer for eXecutables (UPX)] es una herramienta de compresión que reduce el tamaño de los ejecutables. Quarkus puede comprimir el ejecutable nativo producido para reducir su tamaño. Esta compresión es interesante cuando:

source: building CLI tools, and you want to reduce the disk footprint,
es: construir herramientas CLI, y quiere reducir la huella del disco,

source: building small container images.
es: construir imágenes de contenedores pequeños.

source: Note that UPX compression:
es: Tenga en cuenta que la compresión UPX:

source: increases your build time, mainly if you use high-compression levels
es: aumenta el tiempo de construcción, sobre todo si se utilizan niveles de compresión elevados

source: increases the startup RSS usage of the application
es: aumenta el uso de RSS de inicio de la aplicación

source: System vs. Container
es: Sistema vs. Contenedor

source: The UPX compression requires:
es: La compresión UPX requiere:

source: the `upx` command to be available in the system `PATH`;
es: el comando `upx` para que esté disponible en el sistema `PATH`;

source: or to have built the native executable using an in-container build.
es: o haber construido el ejecutable nativo utilizando una construcción en el contenedor.

source: If you have the `upx` command available on your path, Quarkus uses it. Otherwise, if you built the native image using an in-container build (using `quarkus.native.container-build=true`) and if the builder image provides the `upx` command, Quarkus compresses the executable from inside the container.
es: Si tiene el comando `upx` disponible en su ruta, Quarkus lo utiliza. De lo contrario, si construyó la imagen nativa usando una construcción dentro del contenedor (usando `quarkus.native.container-build=true`) y si la imagen del constructor proporciona el comando `upx`, Quarkus comprime el ejecutable desde dentro del contenedor.

source: If you are not in one of these cases, the compression fails.
es: Si no está en uno de estos casos, la compresión falla.

source: upx is cross-platform.
es: upx es multiplataforma.

source: `upx` can compress executables using a different architecture and OS than your host machine. For example, `upx` on a MacOS X machine can compress a Linux 64bits executables.
es: `upx` puede comprimir ejecutables que utilicen una arquitectura y un sistema operativo diferentes a los de su máquina anfitriona. Por ejemplo, `upx` en una máquina MacOS X puede comprimir los ejecutables de Linux 64bits.

source: Configuring the UPX compression
es: Configuración de la compresión UPX

source: Then, in your application configuration, enable the compression by configuring the _compression level_ you want:
es: A continuación, en la configuración de su aplicación, active la compresión configurando el _nivel de compresión_ que desee:

source: If the compression level is not set, the compression is disabled. The compression will happen once the native executable is built and will replace the executable.
es: Si el nivel de compresión no se establece, la compresión se desactiva. La compresión se producirá una vez que se construya el ejecutable nativo y sustituirá al ejecutable.

source: Compression level
es: Nivel de compresión

source: The compression level goes from 1 to 10:
es: El nivel de compresión va de 1 a 10:

source: `1`: faster compression
es: `1`: compresión más rápida

source: `9`: better compression
es: `9`: mejor compresión

source: `10`: best compression (can be slow for big files)
es: `10`Mejor compresión (puede ser lenta para archivos grandes)

source: Extra parameters
es: Parámetros adicionales

source: You can pass extra parameter to upx, such as `--brute` or `--ultra-brute` using the `quarkus.native.compression.additional-args` parameter. The value is a comma-separated list of arguments:
es: Puede pasar un parámetro extra a upx, como `--brute` o `--ultra-brute` utilizando el parámetro `quarkus.native.compression.additional-args`. El valor es una lista de argumentos separada por comas:

source: The exhaustive list of parameters can be found in https://github.com/upx/upx/blob/devel/doc/upx.pod[the UPX documentation].
es: La lista completa de parámetros se encuentra en https://github.com/upx/upx/blob/devel/doc/upx.pod[la documentación de UPX].
