Repository: quarkusio/pt.quarkus.io
Catalog: l10n/po/*/_guides/virtual-threads.adoc.po
Languages: pt_br

source: Virtual Thread support reference
pt_br: Referência de apoio para Threads Virtuais

source: What are virtual threads?
pt_br: O que são threads virtuais?

source: Terminology
pt_br: Terminologia

source: OS thread
pt_br: Thread do SO

source: A "thread-like" data structure managed by the Operating System.
pt_br: Uma estrutura de dados "semelhante à uma thread" gerenciada pelo sistema operacional.

source: Platform thread
pt_br: Thread de plataforma

source: Until Java 19, every instance of the link:{thread}[Thread] class was a platform thread, a wrapper around an OS thread. Creating a platform thread creates an OS thread, and blocking a platform thread blocks an OS thread.
pt_br: Até o Java 19, cada instância da classe link:{thread}[Thread] era uma thread de plataforma, um wrapper em torno de uma thread do sistema operacional. A criação de uma thread de plataforma cria uma thread de SO, e o bloqueio de uma thread de plataforma bloqueia uma thread de SO.

source: Virtual thread
pt_br: Thread virtual

source: Lightweight, JVM-managed threads. They extend the link:{thread}[Thread] class but are not tied to one specific OS thread. Thus, scheduling virtual threads is the responsibility of the JVM.
pt_br: Threads leves e gerenciadas pela JVM. Elas estendem a classe link:{thread}[Thread], mas não estão vinculadas a uma thread específica do sistema operacional. Portanto, o agendamento de threads virtuais é de responsabilidade da JVM.

source: A platform thread used to execute a virtual thread is called a **carrier** thread. It isn't a class distinct from link:{Thread}[Thread] or `VirtualThread` but rather a functional denomination.
pt_br: Uma thread de plataforma usada para executar uma thread virtual é chamada de **carrier** thread. Não se trata de uma classe distinta da link:{Thread}[Thread] ou `VirtualThread`, mas sim de uma denominação funcional.

source: Differences between virtual threads and platform threads
pt_br: Diferenças entre threads virtuais e threads de plataforma

source: We will give a brief overview of the topic here; please refer to the link:{vthreadjep}[JEP 425] for more information.
pt_br: Faremos aqui um breve resumo do tema; para mais informações, consulte o link:{vthreadjep}[JEP 425].

source: Until now, platform threads were the concurrency unit of the JVM. They are a wrapper over OS structures. Creating a Java platform thread creates a "thread-like" structure in your operating system.
pt_br: Até agora, as threads de plataforma eram a unidade de concorrência da JVM. Elas são um invólucro sobre as estruturas do sistema operacional. A criação de uma thread de plataforma Java cria uma estrutura "semelhante a uma thread" no seu sistema operacional.

source: Virtual threads, on the other hand, are managed by the JVM. To be executed, they need to be mounted on a platform thread (which acts as a carrier to that virtual thread). As such, they have been designed to offer the following characteristics:
pt_br: As threads virtuais, por outro lado, são gerenciadas pela JVM. Para serem executadas, elas têm de ser montadas numa thread de plataforma (que atua como um suporte para essa thread virtual). Como tal, elas foram concebidas para oferecer as seguintes características:

source: Lightweight
pt_br: Leve

source: Virtual threads occupy less space than platform threads in memory. Hence, it becomes possible to use more virtual threads than platform threads simultaneously without blowing up the memory. By default, platform threads are created with a stack of about 1 MB, whereas virtual threads stack is "pay-as-you-go." You can find these numbers and other motivations for virtual threads in this https://youtu.be/lIq-x_iI-kc?t=543[presentation] given by the lead developer of project Loom (the project that added the virtual thread support to the JVM).
pt_br: As threads virtuais ocupam menos espaço na memória do que as threads de plataforma. Por isso, torna-se possível usar mais threads virtuais do que threads de plataforma simultaneamente sem estourar a memória. Por definição, as threads de plataforma são criadas com uma pilha de cerca de 1 MB, ao passo que a pilha das threads virtuais é "paga à medida que se usa". Você pode encontrar estes números e outras motivações para as threads virtuais nesta link:https://youtu.be/lIq-x_iI-kc?t=543[apresentação] feita pelo programador principal do projeto Loom (o projeto que adicionou o suporte de threads virtuais à JVM).

source: Cheap to create
pt_br: Barato para criar

source: Creating a platform thread in Java takes time. Currently, techniques such as pooling, where threads are created once and then reused, are strongly encouraged to minimize the time lost in starting them (as well as limiting the maximum number of threads to keep memory consumption low). Virtual threads are supposed to be disposable entities that we create when we need them, it is discouraged to pool them or reuse them for different tasks.
pt_br: Criar uma thread de plataforma em Java leva tempo. Atualmente, técnicas como o pooling, em que as threads são criadas uma vez e depois reutilizadas, são fortemente encorajadas para minimizar o tempo perdido ao iniciá-las (bem como limitar o número máximo de threads para manter o consumo de memória baixo). As threads virtuais devem ser entidades descartáveis que criamos quando precisamos delas, não sendo aconselhável agrupá-las ou reutilizá-las para diferentes tarefas.

source: Cheap to block
pt_br: Barato para bloquear

source: When performing blocking I/O, the underlying OS thread wrapped by the Java platform thread is put in a wait queue, and a context switch occurs to load a new thread context onto the CPU core. This operation takes time. Since the JVM manages virtual threads, no underlying OS thread is blocked when they perform a blocking operation. Their state is stored in the heap, and another virtual thread is executed on the same Java platform (carrier) thread.
pt_br: Ao executar E/S bloqueante, a thread do SO relacionada à thread da plataforma Java é colocada numa fila de espera e ocorre uma troca de contexto para carregar um novo contexto de thread no núcleo da CPU. Essa operação leva tempo. Uma vez que a JVM gerencia threads virtuais, nenhuma thread do SO é bloqueada quando uma operação de bloqueio é realizada. O seu estado é armazenado na heap e outra thread virtual é executada na mesma thread (carrier) da plataforma Java.

source: The Continuation Dance
pt_br: O Processo de Continuação

source: As mentioned above, the JVM schedules the virtual threads. These virtual threads are mounted on carrier threads. The scheduling comes with a pinch of magic. When the virtual thread attempts to use blocking I/O, the JVM _transforms_ this call into a non-blocking one, unmounts the virtual thread, and mounts another virtual thread on the carrier thread. When the I/O completes, the _waiting_ virtual thread becomes eligible again and will be re-mounted on a carrier thread to continue its execution. For the user, all this dance is invisible. Your synchronous code is executed asynchronously.
pt_br: Como mencionado acima, a JVM agenda as threads virtuais. Essas threads virtuais são montadas em carrier threads. O agendamento vem com uma pitada de magia. Quando a thread virtual tenta utilizar E/S bloqueante, a JVM _transforma_ esta chamada numa chamada não bloqueante, desmonta a thread virtual e monta outra thread virtual na carrier thread. Quando a E/S é concluída, a thread virtual _em espera_ torna-se novamente elegível e será montada novamente numa carrier thread para continuar a sua execução. Para o usuário, todo esse processo é invisível. O seu código síncrono é executado de forma assíncrona.

source: Note that the virtual thread may not be re-mounted on the same carrier thread.
pt_br: Note-se que a thread virtual pode não ser montada novamente na mesma carrier thread.

source: Virtual threads are useful for I/O-bound workloads only
pt_br: As threads virtuais são úteis apenas para cargas de trabalho vinculadas a E/S

source: We now know we can create more virtual threads than platform threads. One could be tempted to use virtual threads to perform long computations (CPU-bound workload). It is useless and counterproductive. CPU-bound doesn't consist of quickly swapping threads while they need to wait for the completion of an I/O, but in leaving them attached to a CPU core to compute something. In this scenario, it is worse than useless to have thousands of threads if we have tens of CPU cores, virtual threads won't enhance the performance of CPU-bound workloads. Even worse, when running a CPU-bound workload on a virtual thread, the virtual thread monopolizes the carrier thread on which it is mounted. It will either reduce the chance for the other virtual thread to run or will start creating new carrier threads, leading to high memory usage.
pt_br: Agora sabemos que podemos criar mais threads virtuais do que threads de plataforma. Poderíamos sentir-nos tentados a utilizar threads virtuais para efetuar cálculos longos (carga de trabalho ligada à CPU). Isso é inútil e contraproducente. Trabalhos que exigem muita CPU não se beneficiam de alternar rapidamente entre threads enquanto esperam pela conclusão de uma operação de E/S, mas sim de manter as threads conectadas a um núcleo de CPU para realizar cálculos. Neste cenário, é péssimo ter milhares de threads se temos dezenas de núcleos de CPU, ou seja, threads virtuais não vão melhorar o desempenho de cargas de trabalho CPU-bound. Pior ainda, ao executar uma carga de trabalho CPU-bound em uma thread virtual, a thread virtual monopoliza a carrier thread na qual está montada. Isso quer dizer que ela reduzirá a chance de execução de outra thread virtual ou começará a criar novas carrier threads, levando a um alto uso de memória.

source: Run code on virtual threads using @RunOnVirtualThread
pt_br: Execute código em threads virtuais usando @RunOnVirtualThread

source: Why not run everything on virtual threads?
pt_br: Por que não executar tudo em threads virtuais?

source: As mentioned above, not everything can run safely on virtual threads. The risk of **monopolization** can lead to high-memory usage. Also, there are situations where the virtual thread cannot be unmounted from the carrier thread. This is called **pinning**. Finally, some libraries use `ThreadLocal` to store and reuse objects. Using virtual threads with these libraries will lead to massive allocation, as the intentionally pooled objects will be instantiated for every (disposable and generally short-lived) virtual thread.
pt_br: Como mencionado acima, nem tudo pode ser executado com segurança em threads virtuais. O risco de *monopolização* pode levar a um alto uso de memória. Além disso, há situações em que a thread virtual não pode ser desmontada da carrier thread. Isso é chamado de *pinning*. Finalmente, algumas bibliotecas utilizam `ThreadLocal` para armazenar e reutilizar objetos. O uso de threads virtuais com essas bibliotecas levará a uma alocação massiva, pois os objetos intencionalmente agrupados serão instanciados para cada thread virtual (descartável e geralmente de curta duração).

source: As of today, it is not possible to use virtual threads in a carefree manner. Following such a laissez-faire approach could quickly lead to memory and resource starvation issues. Thus, Quarkus uses an explicit model until the aforementioned issues disappear (as the Java ecosystem matures). It is also the reason why _reactive_ extensions have the virtual thread support, and rarely the _classic_ ones. We need to know when to dispatch on a virtual thread.
pt_br: Atualmente, não é possível utilizar threads virtuais de uma forma despreocupada. Seguir uma abordagem tão "descuidada" poderia rapidamente levar a problemas de falta de memória e de recursos. Dessa forma, o Quarkus utiliza um modelo explícito até que os problemas acima mencionados desapareçam (à medida que o ecossistema Java amadurece). É também a razão pela qual as extensões _reativas_ têm o suporte de threads virtuais e raramente as _clássicas_. Precisamos saber quando despachar em uma thread virtual.

source: It is essential to understand that these issues are not Quarkus limitations or bugs but are due to the current state of the Java ecosystem which needs to evolve to become virtual thread friendly.
pt_br: É essencial compreender que estes problemas não são limitações ou bugs do Quarkus, mas sim devidos ao estado atual do ecossistema Java, que precisa evoluir para se tornar compatível com as threads virtuais.

source: To learn more about the internal design and choices, check the https://dl.acm.org/doi/10.1145/3583678.3596895[Considerations for integrating virtual threads in a Java framework: a Quarkus example in a resource-constrained environment] paper.
pt_br: Para saber mais sobre o design interno e as escolhas, consulte o documento https://dl.acm.org/doi/10.1145/3583678.3596895[Considerações sobre a integração de threads virtuais numa estrutura Java: um exemplo Quarkus num ambiente com recursos limitados].

source: Monopolization cases
pt_br: Casos de monopolização

source: The monopolization has been explained in the xref:cpu-bound[Virtual threads are useful for I/O-bound workloads only] section. When running long computations, we do not allow the JVM to unmount and switch to another virtual thread until the virtual thread terminates. Indeed, the current scheduler does not support preempting tasks.
pt_br: A monopolização foi explicada na seção xref:#cpu-bound[Threads virtuais são úteis apenas para cargas de trabalho ligadas a E/S]. Ao executar cálculos longos, não permitimos que a JVM desmonte e mude para outra thread virtual até que a thread virtual atual termine. De fato, o agendador atual não suporta a interrupção de tarefas.

source: This monopolization can lead to the creation of new carrier threads to execute other virtual threads. Creating carrier threads results in creating platform threads. So, there is a memory cost associated with this creation.
pt_br: Esta monopolização pode levar à criação de novas carrier threads para executar outras threads virtuais. A criação de carrier threads resulta na criação de threads de plataforma. Portanto, há um custo de memória associado a essa criação.

source: Suppose you run in a constrained environment, such as containers. In that case, monopolization can quickly become a concern, as the high memory usage can lead to out-of-memory issues and container termination. The memory usage may be higher than with regular worker threads because of the inherent cost of the scheduling and virtual threads.
pt_br: Suponha que você execute em um ambiente restrito, como contêineres. Nesse caso, a monopolização pode rapidamente se tornar uma preocupação, pois o alto uso de memória pode levar a problemas de falta de memória e ao encerramento do contêiner. O uso de memória pode ser maior do que com worker threads regulares devido ao custo inerente do agendamento e das threads virtuais.

source: Pinning cases
pt_br: Casos de fixação (pinning)

source: The promise of "cheap blocking" might not always hold: a virtual thread might _pin_ its carrier on certain occasions. The platform thread is blocked in this situation, precisely as it would have been in a typical blocking scenario.
pt_br: A promessa de "bloqueio barato" pode nem sempre ser cumprida: uma thread virtual pode _fixar_ o seu portador (carrier) em determinadas ocasiões. A thread da plataforma fica bloqueada nesta situação, exatamente como teria sido num cenário de bloqueio típico.

source: According to link:{vthreadjep}[JEP 425] this can happen in two situations:
pt_br: Segundo o link:{vthreadjep}[JEP 425], isto pode acontecer em duas situações:

source: when a virtual thread performs a blocking operation inside a `synchronized` block or method
pt_br: quando uma thread virtual executa uma operação de bloqueio dentro de um bloco ou método `synchronized`

source: when it executes a blocking operation inside a native method or a foreign function
pt_br: quando executa uma operação bloqueante dentro de um método nativo ou de uma função externa

source: It can be reasonably easy to avoid these situations in your code, but verifying every dependency you use is hard. Typically, while experimenting with virtual threads, we realized that old versions of the link:{pgsql-driver}[postgresql-JDBC driver] results in frequent pinning. Most JDBC drivers still pin the carrier thread. Even worse, lots of widespread libraries are pinning and would require code changes.
pt_br: Pode ser razoavelmente fácil evitar essas situações no seu código, mas verificar cada dependência que você usa é difícil. Tipicamente, enquanto experimentávamos com threads virtuais, percebemos que as versões antigas do link:{pgsql-driver}[driver postgresql-JDBC] resultavam em pinagem frequente. A maioria dos drivers JDBC ainda fixam a carrier thread. Pior ainda, muitas bibliotecas comuns estão fixando e exigiriam alterações no código.

source: The pooling case
pt_br: O caso do agrupamento (pooling)

source: Some libraries are using `ThreadLocal` as an object pooling mechanism. Extremely popular libraries like https://github.com/FasterXML/jackson-core/issues/919[Jackson] and Netty assume that the application uses a limited number of threads, which are recycled (using a thread pool) to run multiple (unrelated but sequential) tasks.
pt_br: Algumas bibliotecas utilizam `ThreadLocal` como um mecanismo de pooling de objetos. Bibliotecas extremamente populares como link:https://github.com/FasterXML/jackson-core/issues/919[Jackson] e Netty assumem que a aplicação utiliza um número limitado de threads, que são reciclados (usando um pool de threads) para executar múltiplas tarefas (não relacionadas, mas sequenciais).

source: This pattern has multiple advantages, such as:
pt_br: Este padrão tem várias vantagens, tais como:

source: Allocation benefit: heavy objects are only allocated once per thread, but because the number of these threads was intended to be limited, it would not use too much memory.
pt_br: Vantagem da alocação: objetos pesados só são atribuídos uma vez por thread, mas como o número destas threads seria limitado, não consumiria memória excessivamente.

source: Thread safety: only one thread can access the object stored in the thread local - preventing concurrent accesses.
pt_br: Segurança da thread: apenas uma thread pode acessar o objeto armazenado na thread local - prevenindo acessos concorrentes.

source: However, this pattern is counter-productive when using virtual threads. Virtual threads are not pooled and generally short-lived. So, instead of a few of them, we now have many of them. For each of them, the object stored in the `ThreadLocal` is created (often large and expensive) and won't be reused, as the virtual thread is not pooled (and won't be used to run another task once the execution completes). This problem leads to high memory usage. Unfortunately, it requires sophisticated code changes in the libraries themselves.
pt_br: No entanto, esse padrão é contraproducente ao usar threads virtuais. Threads virtuais não são agrupadas e geralmente têm vida curta. Portanto, em vez de algumas threads virtuais, agora temos muitas. Para cada uma delas, o objeto armazenado no `ThreadLocal` é criado (geralmente grande e caro) e não será reutilizado, pois a thread virtual não é gerenciada em um pool (e não será utilizada para executar outra tarefa quando a execução for concluída). Esse problema leva a um alto uso de memória. Infelizmente, requer mudanças significativas no código dessas bibliotecas.

source: This section shows a brief example of using the link:{runonvthread}[@RunOnVirtualThread] annotation. It also explains the various development and execution models offered by Quarkus.
pt_br: Esta seção mostra um breve exemplo de utilização da anotação link:{runonvthread}[@RunOnVirtualThread]. Ela também explica os vários modelos de desenvolvimento e execução oferecidos pelo Quarkus.

source: The `@RunOnVirtualThread` annotation instructs Quarkus to invoke the annotated method on a **new** virtual thread instead of the current one. Quarkus handles the creation of the virtual thread and the offloading.
pt_br: A anotação `@RunOnVirtualThread` dá instruções ao Quarkus para invocar o método anotado numa **nova** thread virtual em vez da atual. O Quarkus trata da criação da thread virtual e do descarregamento.

source: Since virtual threads are disposable entities, the fundamental idea of `@RunOnVirtualThread` is to offload the execution of an endpoint handler on a new virtual thread instead of running it on an event-loop or worker thread (in the case of RESTEasy Reactive).
pt_br: Como as threads virtuais são entidades descartáveis, a ideia fundamental do `@RunOnVirtualThread` é descarregar a execução de uma requisição para um determinado endpoint em uma nova thread virtual em vez de executá-la em um loop de eventos ou em uma worker thread (no caso do RESTEasy Reactive).

source: In the case of RESTEasy Reactive, this annotation can only be used on endpoints annotated with link:{blockingannotation}[@Blocking] or considered blocking because of their signature. You can visit xref:resteasy-reactive.adoc#execution-model-blocking-non-blocking[Execution model, blocking, non-blocking] for more information.
pt_br: No caso do RESTEasy Reactive, essa anotação só pode ser usada em endpoints anotados com link:{blockingannotation}[@Blocking] ou considerados bloqueantes devido à sua assinatura. Para mais informações, visite xref:resteasy-reactive.adoc#execution-model-blocking-non-blocking[Modelo de execução, bloqueio, não-bloqueio].

source: Get started with virtual threads with RESTEasy Reactive
pt_br: Comece a usar threads virtuais com o RESTEasy Reactive

source: Add the following dependency to your build file:
pt_br: Adicione a seguinte dependência ao seu arquivo de build:

source: Three development and execution models
pt_br: Três modelos de desenvolvimento e execução

source: The example below shows the differences between three endpoints, all of them querying a _fortune_ in the database then returning it to the client.
pt_br: O exemplo abaixo mostra as diferenças entre três endpoints, todos eles consultando uma _fortune_ na base de dados e devolvendo-a ao cliente.

source: the first one uses the traditional blocking style, it is considered blocking due to its signature.
pt_br: o primeiro utiliza o estilo de bloqueio tradicional, que é considerado bloqueante devido à sua assinatura.

source: the second one uses Mutiny, it is considered non-blocking due to its signature.
pt_br: o segundo utiliza o Mutiny, que é considerado não bloqueante devido à sua assinatura.

source: the third one uses Mutiny but in a synchronous way, since it doesn't return a "reactive type" it is considered blocking and the link:{runonvthread}[@RunOnVirtualThread] annotation can be used.
pt_br: a terceira utiliza Mutiny, mas de forma síncrona, uma vez que não devolve um "tipo reativo", é considerada bloqueante e pode ser utilizada a anotação link:{runonvthread}[@RunOnVirtualThread].

source: The following table summarizes the options:
pt_br: A tabela seguinte resume as opções:

source: Model
pt_br: Modelo

source: Example of signature
pt_br: Exemplo de assinatura

source: Pros
pt_br: Prós

source: Cons
pt_br: Contras

source: Synchronous code on worker thread
pt_br: Código síncrono na worker thread

source: Simple code
pt_br: Código simples

source: Use worker thread (limit concurrency)
pt_br: Utiliza worker thread (limita a concorrência)

source: Reactive code on event loop
pt_br: Código reativo no event loop

source: High concurrency and low resource usage
pt_br: Alta concorrência e baixo uso de recursos

source: More complex code
pt_br: Código mais complexo
