Repository: quarkusio/pt.quarkus.io
Catalog: l10n/po/*/_guides/virtual-threads.adoc.po
Languages: pt_br

source: Synchronous code on virtual thread
pt_br: Código síncrono em thread virtual

source: Risk of pinning, monopolization and under-efficient object pooling
pt_br: Risco de fixação (pinning), monopolização e agrupamento de objetos pouco eficiente

source: Note that all three models can be used in a single application.
pt_br: Note-se que os três modelos podem ser utilizados numa única aplicação.

source: Use virtual thread friendly clients
pt_br: Utilize clientes compatíveis com threads virtuais

source: Fortunately, Quarkus provides a massive ecosystem that is ready to be used in virtual threads. Mutiny, the reactive programming library used in Quarkus, and the Vert.x Mutiny bindings provides the ability to write blocking code (so, no fear, no learning curve) which do not pin the carrier thread.
pt_br: Felizmente, o Quarkus oferece um ecossistema enorme que está pronto para ser usado em threads virtuais. O Mutiny, a biblioteca de programação reativa utilizada no Quarkus, e as ligações Mutiny do Vert.x permitem escrever código bloqueante (sem medo, sem curva de aprendizado) que não bloqueia a carrier thread.

source: As a result:
pt_br: Como resultado:

source: Quarkus extensions providing blocking APIs on top of reactive APIs can be used in virtual threads. This includes the reactive rest client, the redis client, the mailer...
pt_br: As extensões Quarkus que fornecem APIs bloqueantes em cima de APIs reativas podem ser utilizadas em threads virtuais. Isto inclui o cliente reativo rest, o cliente redis, o mailer...

source: API returning `Uni` can be used directly using `uni.await().atMost(...)`. It blocks the virtual thread, without blocking the carrier thread, and also improves the resilience of your application with an easy (non-blocking) timeout support.
pt_br: A API que retornar `Uni` pode ser utilizada diretamente através de `uni.await().atMost(…​)`. Bloqueia a thread virtual, sem bloquear a carrier thread, e também melhora a resiliência da sua aplicação com um suporte fácil de timeout (não bloqueante).

source: If you use a https://smallrye.io/smallrye-mutiny-vertx-bindings/latest/[Vert.x client using the Mutiny bindings], use the `andAwait()` methods which block until you get the result without pinning the carrier thread. It includes all the reactive SQL drivers.
pt_br: Se você estiver utilizando um link:https://smallrye.io/smallrye-mutiny-vertx-bindings/latest/[cliente Vert.x que utilize as ligações Mutiny], use os métodos `andAwait()` que bloqueiam até obter o resultado sem fixar a carrier thread. Isso inclui todos os drivers SQL reativos.

source: Detect pinned thread in tests
pt_br: Detectar thread fixada em testes

source: We recommend to use the following configuration when running tests in application using virtual threads. If would not fail the tests, but at least dump start traces if the code pins the carrier thread:
pt_br: Recomendamos a utilização da seguinte configuração ao executar testes em aplicações que utilizam threads virtuais. Isso não fará os testes falharem, mas, pelo menos, gerará os rastros (dumps) de início se o código fixar a carrier thread:

source: The `--enable-preview` flag is not necessary with Java 21.
pt_br: O parâmetro `--enable-preview` não é necessário a partir do Java 21.

source: Run application using virtual threads
pt_br: Executar a aplicação utilizando threads virtuais

source: Prior to Java 21, virtual threads are still an experimental feature, you need to start your application with the `--enable-preview` flag:
pt_br: Antes de Java 21, as threads virtuais ainda são uma funcionalidade experimental, portanto é necessário iniciar a aplicação com o parâmetro `--enable-preview`:

source: Build containers for application using virtual threads
pt_br: Construir contêineres para aplicação que utiliza threads virtuais

source: When running your application in JVM mode (so not compiled into native, for native check xref:native[the dedicated section]), you can follow the xref:./container-image.adoc[containerization guide] to build a container.
pt_br: Ao executar a sua aplicação em modo JVM (portanto, não compilada em modo nativo, para nativo consulte xref:native[a seção dedicada]), pode seguir o xref:./container-image.html[guia de conteinerização] para construir um contêiner.

source: In this section, we use JIB to build the container. Refer to the xref:./container-image.adoc[containerization guide] to learn more about the alternatives.
pt_br: Nesta seção, utilizamos o JIB para construir o contêiner. Consulte o xref:./container-image.html[guia de conteinerização] para saber mais sobre as alternativas.

source: To containerize your Quarkus application that use `@RunOnVirtualThread`, add the following properties in your `application.properties`:
pt_br: Para conteinerizar a sua aplicação Quarkus que utiliza `@RunOnVirtualThread`, adicione as seguintes propriedades ao seu `application.properties`:

source: Make sure you use a base image supporting virtual threads. Here we use an image providing Java 20.
pt_br: Certifique-se de que você utiliza uma imagem base que suporta threads virtuais. Aqui usamos uma imagem que fornece Java 20.

source: Select the target architecture. You can select more than one to build multi-archs images.
pt_br: Selecione a arquitetura de destino. Você pode selecionar mais do que uma para criar imagens multiarquitetura.

source: Don't forget to use the `--enable-preview` flag if you are not using Java 21+.
pt_br: Não se esqueça de utilizar o parâmetro `--enable-preview` se não estiver utilizando Java 21+.

source: Then, build your container as you would do usually. For example, if you are using Maven, run:
pt_br: Em seguida, construa o seu contêiner como faria normalmente. Por exemplo, se estiver a utilizar o Maven, execute:

source: Compiling Quarkus application using virtual threads into native executable
pt_br: Compilando a aplicação Quarkus utilizando threads virtuais num executável nativo

source: Using a local GraalVM installation
pt_br: Usando uma instalação local do GraalVM

source: Build the native executable as indicated on xref:./building-native-image.adoc[the native compilation guide]. For example, with Maven, run:
pt_br: Construa o executável nativo conforme indicado no xref:./building-native-image.html[guia de compilação nativa]. Por exemplo, com o Maven, execute:

source: Using an in-container build
pt_br: Usando uma compilação em contêiner

source: In-container build allows building Linux 64 executables by using a `native-image` compiler running in a container. It avoids having to install `native-image` on your machine, and also allows configuring the GraalVM version you need. Note that, to use in-container build, you must have Docker or Podman installed on your machine.
pt_br: A construção em contêiner permite construir executáveis Linux 64 utilizando um compilador `native-image` em execução num contêiner. Isso evita ter que instalar `native-image` na sua máquina e também permite configurar a versão do GraalVM que você precisa. Note que, para usar a construção em contêiner, você precisa ter o Docker ou o Podman instalado na sua máquina.

source: Then, add to your `application.properties` file:
pt_br: Em seguida, adicione ao seu arquivo `application.properties`:

source: Enables the in-container build
pt_br: Permite a compilação no contêiner

source: From ARM/64 to AMD/64
pt_br: De ARM/64 para AMD/64

source: If you are using a Mac M1 or M2 (using an ARM64 CPU), you need to be aware that the native executable you will get using an in-container build will be a Linux executable, but using your host (ARM 64) architecture. You can use emulation to force the architecture when using Docker with the following property:
pt_br: Se estiver utilizando um Mac M1 ou M2 (utilizando uma CPU ARM64), esteja ciente de que o executável nativo que obterá utilizando uma compilação dentro do contêiner será um executável Linux, mas utilizando a arquitetura do seu host (ARM 64). Você pode forçar a arquitetura usando emulação ao usar o Docker com a seguinte propriedade:

source: Be aware that it increases the compilation time... a lot (>10 minutes).
pt_br: Fique ciente de que isso aumenta significativamente o tempo de compilação... bastante (>10 minutos).

source: Containerize native applications using virtual threads
pt_br: Conteinerização de aplicações nativas usando threads virtuais

source: To build a container running a Quarkus application using virtual threads compiled into a native executable, you must make sure you have a Linux/AMD64 executable (or ARM64 if you are targeting ARM machines).
pt_br: Para construir um contêiner que executa uma aplicação Quarkus com threads virtuais compiladas em um executável nativo, primeiro certifique-se de ter um executável Linux/AMD64. Se o seu objetivo são máquinas ARM, você precisará de um executável ARM64.

source: Make sure your `application.properties` contains the configuration explained in xref:native[the native compilation section].
pt_br: Certifique-se de que o seu `application.properties` contém a configuração explicada na xref:native[seção de compilação nativa].

source: If you ever want to build a native container image and already have an existing native image you can set `-Dquarkus.native.reuse-existing=true` and the native image build will not be re-run.
pt_br: Se você quiser construir uma imagem de contêiner nativa e já tiver uma imagem nativa existente, você pode definir `-Dquarkus.native.reuse-existing=true`. Isso evitará que a imagem nativa seja construída novamente

source: Use the duplicated context in virtual threads
pt_br: Utilize o contexto duplicado em threads virtuais

source: Methods annotated with `@RunOnVirtualThread` inherit from the original duplicated context (See the xref:duplicated-context.adoc[duplicated context reference guide] for details). So, the data written in the duplicated context (and the request scope, as the request scoped is stored in the duplicated context) by filters and interceptors are available during the method execution (even if the filters and interceptors are not run on the virtual thread).
pt_br: Os métodos anotados com `@RunOnVirtualThread` herdam do contexto duplicado original (consulte o xref:duplicated-context.adoc[guia de referência do contexto duplicado] para mais detalhes). Portanto, os dados escritos no contexto duplicado (e o escopo da requisição, uma vez que o escopo da requisição é armazenado no contexto duplicado) por filtros e interceptadores estão disponíveis durante a execução do método (mesmo que os filtros e interceptadores não sejam executados na thread virtual).

source: However, thread locals are not propagated.
pt_br: No entanto, as thread locals não são propagadas.

source: Virtual thread names
pt_br: Nomes de threads virtuais

source: Virtual threads are created without a thread name by default, which is not practical to identify the execution for debugging and logging purposes. Quarkus managed virtual threads are named and prefixed with `quarkus-virtual-thread-`. You can customize this prefix, or disable the naming altogether configuring an empty value:
pt_br: As threads virtuais são criadas sem um nome, o que pode dificultar a identificação da execução para fins de depuração e registro. As threads virtuais gerenciadas pelo Quarkus são nomeadas e prefixadas com `quarkus-virtual-thread-`. É possível personalizar esse prefixo ou desativar a nomeação configurando um valor vazio:

source: Additional references
pt_br: Referências adicionais

source: https://dl.acm.org/doi/10.1145/3583678.3596895[Considerations for integrating virtual threads in a Java framework: a Quarkus example in a resource-constrained environment]
pt_br: https://dl.acm.org/doi/10.1145/3583678.3596895[Considerações sobre a integração de threads virtuais num framework Java: um exemplo do Quarkus num ambiente com recursos limitados]
