Repository: quarkusio/pt.quarkus.io
Catalog: l10n/po/*/_guides/writing-extensions.adoc.po
Languages: pt_br

source: Given a default non-application endpoint root of `/q`, this will create an endpoint at `/q/custom-endpoint/deep`.
pt_br: Dada uma raiz padrão de endpoint não relacionado a aplicação de `/q`, isto criará um endpoint em `/q/custom-endpoint/deep`.

source: Absolute paths also have an impact on nested endpoints. If the above called `nestedRoute("custom-endpoint", "/deep")`, the resulting endpoint will be found at `/deep`.
pt_br: Os caminhos absolutos também têm impacto sobre os endpoints aninhados. Se o usuário acima chamou `nestedRoute("custom-endpoint", "/deep")` , o endpoint resultante será encontrado em `/deep`.

source: Extension Health Check
pt_br: Verificação de Integridade da Extensão

source: Health checks are provided via the `quarkus-smallrye-health` extension. It provides both liveness and readiness checks capabilities.
pt_br: As verificações de integridade são fornecidas através da extensão `quarkus-smallrye-health`. Ela fornece capacidades de verificação de vivacidade e prontidão.

source: When writing an extension, it's beneficial to provide health checks for the extension, that can be automatically included without the developer needing to write their own.
pt_br: Ao escrever uma extensão, é vantajoso fornecer verificações de integridade para a extensão, que podem ser automaticamente incluídas sem que o programador tenha de escrever os seus próprios controles.

source: In order to provide a health check, you should do the following:
pt_br: Para prover uma verificação de integridade, você deve fazer o seguinte:

source: Import the `quarkus-smallrye-health` extension as an **optional** dependency in your runtime module so it will not impact the size of the application if health check is not included.
pt_br: Importe a extensão `quarkus-smallrye-health` como uma dependência **opcional** em seu módulo de tempo de execução para que ela não afete o tamanho da aplicação se a verificação de integridade não for incluída.

source: Create your health check following the xref:smallrye-health.adoc[SmallRye Health] guide. We advise providing only readiness check for an extension (liveness check is designed to express the fact that an application is up and needs to be lightweight).
pt_br: Crie sua verificação de integridade seguindo o guia xref:smallrye-health.adoc[SmallRye Health]. Recomendamos que você forneça apenas uma verificação de prontidão para uma extensão (a verificação de vivacidade foi criada para expressar o fato de que um aplicativo está ativo e precisa ser leve).

source: Import the `quarkus-smallrye-health-spi` library in your deployment module.
pt_br: Importe a biblioteca `quarkus-smallrye-health-spi` no seu módulo de implantação.

source: Add a build step in your deployment module that produces a `HealthBuildItem`.
pt_br: Adicione uma etapa de construção no seu módulo de implantação que produz um `HealthBuildItem`.

source: Add a way to disable the extension health check via a config item `quarkus.<extension>.health.enabled` that should be enabled by default.
pt_br: Adicione uma forma de desativar a verificação de integridade da extensão através de um item de configuração `quarkus.<extension>.health.enabled` que deve estar ativado por padrão.

source: Following is an example from the Agroal extension that provides a `DataSourceHealthCheck` to validate the readiness of a datasource.
pt_br: Segue um exemplo da extensão Agroal que fornece um `DataSourceHealthCheck` para validar a prontidão de uma fonte de dados.

source: Extension Metrics
pt_br: Métricas de Extensão

source: The compatibility layer for MP Metrics APIs will move to a different extension in the future.
pt_br: A camada de compatibilidade para as APIs de Métricas MP será transferida para uma extensão diferente no futuro.

source: There are two broad patterns that extensions can use to interact with an optional metrics extension to add their own metrics:
pt_br: Existem dois padrões gerais que as extensões podem utilizar para interagir com uma extensão de métricas opcional para adicionar as suas próprias métricas:

source: Consumer pattern: An extension declares a `MetricsFactoryConsumerBuildItem` and uses that to provide a bytecode recorder to the metrics extension. When the metrics extension has initialized, it will iterate over registered consumers to initialize them with a `MetricsFactory`. This factory can be used to declare API-agnostic metrics, which can be a good fit for extensions that provide an instrumentable object for gathering statistics (e.g. Hibernate's `Statistics` class).
pt_br: Padrão Consumidor: Uma extensão declara um `MetricsFactoryConsumerBuildItem` e usa-o para fornecer um gravador de bytecode para a extensão de métricas. Quando a extensão de métricas for inicializada, ela irá iterar sobre os consumidores registrados para inicializá-los com um `MetricsFactory`. Essa fábrica pode ser usada para declarar métricas agnósticas à API, o que pode ser uma boa opção para extensões que fornecem um objeto instrumentável para coletar estatísticas (por exemplo, a classe `Statistics` do Hibernate).

source: Remember that support for metrics is optional. Extensions can use an `Optional<MetricsCapabilityBuildItem> metricsCapability` parameter in their build step to test for the presence of an enabled metrics extension. Consider using additional configuration to control behavior of metrics. Datasource metrics can be expensive, for example, so additional configuration flags are used enable metrics collection on individual datasources.
pt_br: Lembre-se de que o suporte para métricas é opcional. As extensões podem usar um parâmetro `Optional<MetricsCapabilityBuildItem> metricsCapability` em sua etapa de construção para testar a presença de uma extensão de métricas habilitada. Considere o uso de configuração adicional para controlar o comportamento das métricas. As métricas de fontes de dados podem ser caras, por exemplo, portanto, sinalizadores de configuração adicionais são usados para habilitar a coleta de métricas em fontes de dados individuais.

source: When adding metrics for your extension, you may find yourself in one of the following situations:
pt_br: Ao adicionar métricas para a sua extensão, você pode se encontrar em uma das seguintes situações:

source: An underlying library used by the extension is using a specific Metrics API directly (either MP Metrics, Micrometer, or some other).
pt_br: Uma biblioteca subjacente utilizada pela extensão está usando diretamente uma API de métricas específica (MP Metrics, Micrometer ou outra).

source: An underlying library uses its own mechanism for collecting metrics and makes them available at runtime using its own API, e.g. Hibernate's `Statistics` class, or Vert.x `MetricsOptions`.
pt_br: Uma biblioteca subjacente usa o seu próprio mecanismo de coleta de métricas e as disponibiliza em tempo de execução utilizando a sua própria API, por exemplo, a classe `Statistics` do Hibernate ou a Vert.x `MetricsOptions`.

source: An underlying library does not provide metrics (or there is no library at all) and you want to add instrumentation.
pt_br: Uma biblioteca subjacente não fornece métricas (ou não existe qualquer biblioteca) e você pretende adicionar instrumentação.

source: Case 1: The library uses a metrics library directly
pt_br: Caso 1: A biblioteca utiliza diretamente uma biblioteca de métricas

source: If the library directly uses a metrics API, there are two options:
pt_br: Se a biblioteca utilizar diretamente uma API de métricas, existem duas opções:

source: Extensions may need to provide a fallback if there is no active metrics extension or the extension doesn't support the API required by the library.
pt_br: As extensões podem precisar fornecer uma alternativa se não existir uma extensão de métricas ativa ou se a extensão não suportar a API exigida pela biblioteca.

source: Case 2: The library provides its own metric API
pt_br: Caso 2: A biblioteca fornece a sua própria API métrica

source: There are two examples of a library providing its own metrics API:
pt_br: Existem dois exemplos de uma biblioteca que fornece a sua própria API de métricas:

source: The extension defines an instrumentable object as Agroal does with `io.agroal.api.AgroalDataSourceMetrics`, or
pt_br: A extensão define um objeto instrumentável como faz o Agroal com `io.agroal.api.AgroalDataSourceMetrics`, ou

source: The extension provides its own abstraction of metrics, as Jaeger does with `io.jaegertracing.spi.MetricsFactory`.
pt_br: A extensão fornece a sua própria abstração de métricas, tal como Jaeger faz com `io.jaegertracing.spi.MetricsFactory`.

source: Observing instrumentable objects
pt_br: Observação de objetos instrumentáveis

source: Let's take the instrumentable object (`io.agroal.api.AgroalDataSourceMetrics`) case first. In this case, you can do the following:
pt_br: Vejamos primeiro o caso do objeto instrumentável ( `io.agroal.api.AgroalDataSourceMetrics`). Neste caso, você pode fazer o seguinte:

source: Define a `BuildStep` that produces a `MetricsFactoryConsumerBuildItem` that uses a `RUNTIME_INIT` or `STATIC_INIT` Recorder to define a `MetricsFactory` consumer. For example, the following creates a `MetricsFactoryConsumerBuildItem` if and only if metrics are enabled both for Agroal generally, and for a datasource specifically:
pt_br: Defina um `BuildStep` que produz um `MetricsFactoryConsumerBuildItem` que usa um Gravador `RUNTIME_INIT` ou `STATIC_INIT` para definir um consumidor `MetricsFactory`. Por exemplo, o seguinte cria um `MetricsFactoryConsumerBuildItem` se e apenas se as métricas estiverem ativadas para o Agroal em geral e para uma fonte de dados especificamente:

source: The associated recorder should use the provided `MetricsFactory` to register metrics. For Agroal, this means using the `MetricFactory` API to observe `io.agroal.api.AgroalDataSourceMetrics` methods. For example:
pt_br: O gravador associado deve usar o `MetricsFactory` fornecido para registrar métricas. Para o Agroal, isto significa usar a API `MetricFactory` para observar os métodos `io.agroal.api.AgroalDataSourceMetrics`. Por exemplo:

source: The `MetricsFactory` provides a fluid builder for registration of metrics, with the final step constructing gauges or counters based on a `Supplier` or `ToDoubleFunction`. Timers can either wrap `Callable`, `Runnable`, or `Supplier` implementations, or can use a `TimeRecorder` to accumulate chunks of time. The underlying metrics extension will create appropriate artifacts to observe or measure the defined functions.
pt_br: O `MetricsFactory` fornece um construtor fluido para o registro de métricas, com o passo final para construir medidores ou contadores com base num `Supplier` ou `ToDoubleFunction`. Os temporizadores podem envolver implementações `Callable`, `Runnable` ou `Supplier`, ou podem utilizar um `TimeRecorder` para acumular pedaços de tempo. A extensão de métrica subjacente criará artefatos apropriados para observar ou medir as funções definidas.

source: Using a Metrics API-specific implementation
pt_br: Usando uma implementação específica da API de Métricas

source: Using metrics-API specific implementations may be preferred in some cases. Jaeger, for example, defines its own metrics interface, `io.jaegertracing.spi.MetricsFactory`, that it uses to define counters and gauges. A direct mapping from that interface to the metrics system will be the most efficient. In this case, it is important to isolate these specialized implementations and to avoid eager classloading to ensure the metrics API remains an optional, compile-time dependency.
pt_br: Usar implementações específicas da API de Métricas pode ser preferível em alguns casos. O Jaeger, por exemplo, define a sua própria interface de métricas, `io.jaegertracing.spi.MetricsFactory`, que usa para definir contadores e medidores. Um mapeamento direto dessa interface para o sistema de métricas será o mais eficiente. Nesse caso, é importante isolar essas implementações especializadas e evitar o carregamento antecipado de classes para garantir que a API de métricas permaneça uma dependência opcional em tempo de compilação.

source: `Optional<MetricsCapabilityBuildItem> metricsCapability` can be used in the build step to selectively control initialization of beans or the production of other build items. The Jaeger extension, for example, can use the following to control initialization of specialized Metrics API adapters:
pt_br: `Optional<MetricsCapabilityBuildItem> metricsCapability` podem ser usados na etapa de construção para controlar seletivamente a inicialização de beans ou a produção de outros itens de construção. A extensão Jaeger, por exemplo, pode usar o seguinte para controlar a inicialização de adaptadores especializados da API de Métricas:

source: A recorder consuming a `MetricsFactory` can use `MetricsFactory::metricsSystemSupported()` can be used to control initialization of metrics objects during bytecode recording in a similar way.
pt_br: Um gravador que consome um `MetricsFactory` pode usar `MetricsFactory::metricsSystemSupported()` pode ser usado para controlar a inicialização de objetos de métricas durante a gravação de bytecode de forma semelhante.

source: Case 3: It is necessary to collect metrics within the extension code
pt_br: Caso 3: É necessário coletar métricas no código da extensão

source: To define your own metrics from scratch, you have two basic options: Use the generic `MetricFactory` builders, or follow the binder pattern, and create instrumentation specific to the enabled metrics extension.
pt_br: Para definir suas próprias métricas do zero, você tem duas opções básicas: Usar os construtores genéricos do `MetricFactory` ou seguir o padrão binder e criar instrumentação específica para a extensão de métricas habilitada.

source: To use the extension-agnostic `MetricFactory` API, your processor can define a `BuildStep` that produces a `MetricsFactoryConsumerBuildItem` that uses a `RUNTIME_INIT` or `STATIC_INIT` Recorder to define a `MetricsFactory` consumer.
pt_br: Para utilizar a API `MetricFactory` agnóstica em termos de extensão, o seu processador pode definir um `BuildStep` que produz um `MetricsFactoryConsumerBuildItem` que usa um Gravador `RUNTIME_INIT` ou `STATIC_INIT` para definir um consumidor `MetricsFactory`.

source: + - The associated recorder should use the provided `MetricsFactory` to register metrics, for example
pt_br: + - O registrador associado deve usar o `MetricsFactory` fornecido para registrar métricas, por exemplo

source: Remember that metrics extensions are optional. Keep metrics-related initialization isolated from other setup for your extension, and structure your code to avoid eager imports of metrics APIs. Gathering metrics can also be expensive. Consider using additional extension-specific configuration to control behavior of metrics if the presence/absence of metrics support isn't sufficient.
pt_br: Lembre-se de que as extensões de métricas são opcionais. Mantenha a inicialização relacionada a métricas isolada de outras configurações para sua extensão e estruture seu código para evitar importações antecipadas de APIs de métricas. A coleta de métricas também pode ser cara. Considere o uso de configuração adicional específica da extensão para controlar o comportamento das métricas se a presença/ausência de suporte a métricas não for suficiente.

source: Customizing JSON handling from an extension
pt_br: Personalizando tratamento JSON a partir de uma extensão

source: Extensions often need to register serializers and/or deserializers for types the extension provides.
pt_br: As extensões necessitam frequentemente de registrar serializadores e/ou desserializadores para os tipos que a extensão fornece.

source: For this, both Jackson and JSON-B extensions provide a way to register serializer/deserializer from within an extension deployment module.
pt_br: Para isso, as extensões Jackson e JSON-B oferecem uma maneira de registrar o serializador/desserializador de dentro de um módulo de implantação de extensão.

source: Keep in mind that not everybody will need JSON, so you need to make it optional.
pt_br: Lembre-se que nem todo mundo vai precisar de JSON, por isso deve torná-lo opcional.

source: If an extension intends to provide JSON related customization, it is strongly advised to provide customization for both Jackson and JSON-B.
pt_br: Se uma extensão pretende fornecer personalização relacionada a JSON, é altamente recomendável fornecer personalização para Jackson e JSON-B.

source: Customizing Jackson
pt_br: Personalizando Jackson

source: First, add an *optional* dependency to `quarkus-jackson` on your extension's runtime module.
pt_br: Primeiro, adicione uma dependência *opcional* a `quarkus-jackson` no módulo de tempo de execução da sua extensão.

source: Then create a serializer or a deserializer (or both) for Jackson, an example of which can be seen in the `mongodb-panache` extension.
pt_br: Em seguida, crie um serializador ou um desserializador (ou ambos) para a Jackson, um exemplo do qual pode ser visto na extensão `mongodb-panache`.

source: Add a dependency to `quarkus-jackson-spi` on your extension's deployment module.
pt_br: Adicione uma dependência a `quarkus-jackson-spi` no módulo de implantação da sua extensão.

source: Add a build step to your processor to register a Jackson module via the `JacksonModuleBuildItem`. You need to name your module in a unique way across all Jackson modules.
pt_br: Adicione uma etapa de construção ao seu processador para registrar um módulo Jackson por meio do `JacksonModuleBuildItem`. Você precisa nomear o seu módulo de uma forma única em todos os módulos Jackson.

source: The Jackson extension will then use the produced build item to register a module within Jackson automatically.
pt_br: A extensão Jackson utilizará então o item de construção produzido para registrar automaticamente um módulo no Jackson.

source: If you need more customization capabilities than registering a module, you can produce a CDI bean that implements `io.quarkus.jackson.ObjectMapperCustomizer` via an `AdditionalBeanBuildItem`. More info about customizing Jackson can be found on the JSON guide xref:rest-json.adoc#json[Configuring JSON support]
pt_br: Se precisar de mais recursos de personalização do que o registro de um módulo, você pode produzir um bean CDI que implemente o `io.quarkus.jackson.ObjectMapperCustomizer` por meio de um `AdditionalBeanBuildItem`. Mais informações sobre a personalização da Jackson podem ser encontradas no guia JSON xref:rest-json.adoc#json[Configurando Suporte a JSON]

source: Customizing JSON-B
pt_br: Personalizando JSON-B

source: First, add an *optional* dependency to `quarkus-jsonb` on your extension's runtime module.
pt_br: Primeiro, adicione uma dependência *opcional* a `quarkus-jsonb` no módulo de tempo de execução da sua extensão.

source: Then create a serializer and/or a deserializer for JSON-B, an example of which can be seen in the `mongodb-panache` extension.
pt_br: Em seguida, crie um serializador e/ou desserializador para JSON-B, um exemplo do qual pode ser visto na extensão `mongodb-panache`.

source: Add a dependency to `quarkus-jsonb-spi` on your extension's deployment module.
pt_br: Adicione uma dependência a `quarkus-jsonb-spi` no módulo de implantação da sua extensão.

source: Add a build step to your processor to register the serializer via the `JsonbSerializerBuildItem`.
pt_br: Adicione um passo de construção ao seu processador para registrar o serializador através do `JsonbSerializerBuildItem`.

source: The JSON-B extension will then use the produced build item to register your serializer/deserializer automatically.
pt_br: A extensão JSON-B utilizará então o item de construção produzido para registrar automaticamente o seu serializador/desserializador.

source: Integrating with Development Mode
pt_br: Integração com o Modo de Desenvolvimento

source: There are various APIS that you can use to integrate with development mode, and to get information about the current state.
pt_br: Existem várias APIS que você pode usar para integrar com o modo de desenvolvimento e para obter informações sobre o estado atual.

source: Handling restarts
pt_br: Lidando com reinicializações

source: When Quarkus is starting the `io.quarkus.deployment.builditem.LiveReloadBuildItem` is guaranteed to be present that gives information about this start, in particular:
pt_br: Quando o Quarkus está iniciando, é garantido que o site `io.quarkus.deployment.builditem.LiveReloadBuildItem` esteja presente e forneça informações sobre esse início, em particular:

source: Is this a clean start or a live reload
pt_br: É uma inicialização limpa ou um recarregamento ao vivo

source: If this is a live reload which changed files / classes triggered the reload
pt_br: Se se tratar de um recarregamento ao vivo onde arquivos/classes alterados ativaram o recarregamento

source: It also provides a global context map you can use to store information between restarts, without needing to resort to static fields.
pt_br: Ele também fornece um mapa de contexto global que pode ser usado para armazenar informações entre reinicializações, sem a necessidade de recorrer a campos estáticos.

source: Triggering Live Reload
pt_br: Ativando o Recarregamento ao Vivo

source: Live reload is generally triggered by an HTTP request, however not all applications are HTTP applications and some extensions may want to trigger live reload based on other events. To do this you need to implement `io.quarkus.dev.spi.HotReplacementSetup` in your runtime module, and add a `META-INF/services/io.quarkus.dev.spi.HotReplacementSetup` that lists your implementation.
pt_br: O recarregamento ao vivo geralmente é acionado por uma requisição HTTP, mas nem todas as aplicações são aplicações HTTP e algumas extensões podem querer acionar o recarregamento ao vivo com base em outros eventos. Para isso, você precisa implementar o `io.quarkus.dev.spi.HotReplacementSetup` no seu módulo de tempo de execução e adicionar um `META-INF/services/io.quarkus.dev.spi.HotReplacementSetup` que liste a sua implementação.

source: On startup the `setupHotDeployment` method will be called, and you can use the provided `io.quarkus.dev.spi.HotReplacementContext` to initiate a scan for changed files.
pt_br: Na inicialização, o método `setupHotDeployment` será chamado, e você pode usar o `io.quarkus.dev.spi.HotReplacementContext` fornecido para iniciar uma varredura de arquivos alterados.

source: Dev Services
pt_br: Serviços de Desenvolvimento

source: Testing Extensions
pt_br: Testando Extensões

source: These tests should be placed in the deployment module, if additional Quarkus modules are required for testing their deployment modules should also be added as test scoped dependencies.
pt_br: Esses testes devem ser colocados no módulo de implantação; se módulos adicionais do Quarkus forem necessários para o teste, seus módulos de implantação também deverão ser adicionados como dependências com escopo de teste.

source: An example test class may look like:
pt_br: Um exemplo de classe de teste pode ter o seguinte aspecto:

source: The `QuarkusUnitTest` extension must be used with a static field. If used with a non-static field, the test application is not started.
pt_br: A extensão `QuarkusUnitTest` deve ser usada com um campo estático. Se for utilizada com um campo não estático, a aplicação de teste não é iniciada.

source: This producer is used to build the application to be tested. It uses Shrinkwrap to create a JavaArchive to test
pt_br: Este produtor é usado para construir a aplicação a ser testada. Ele usa o Shrinkwrap para criar um JavaArchive para testar
