Repository: quarkusio/pt.quarkus.io
Catalog: l10n/po/*/_guides/writing-extensions.adoc.po
Languages: pt_br

source: Empty build items are final (usually empty) classes which extend `io.quarkus.builder.item.EmptyBuildItem`. They represent build items that don't actually carry any data, and allow such items to be produced and consumed without having to instantiate empty classes. They cannot themselves be instantiated.
pt_br: Os itens de construção vazios são classes finais (geralmente vazias) que estendem `io.quarkus.builder.item.EmptyBuildItem`. Eles representam itens de construção que, na verdade, não contêm dados e permitem que esses itens sejam produzidos e consumidos sem a necessidade de instanciar classes vazias. Eles não podem ser instanciados.

source: As they cannot be instantiated, they cannot be injected by any means, nor be returned by a build step (or via a `BuildProducer`). To produce an empty build item you must annotate the build step with `@Produce(MyEmptyBuildItem.class)` and to consume it by `@Consume(MyEmptyBuildItem.class)`.
pt_br: Como não podem ser instanciados, não podem ser injetados por nenhum meio nem retornados por uma etapa de construção (ou por meio de um `BuildProducer` ). Para produzir um item de construção vazio, você deve anotar a etapa de construção com `@Produce(MyEmptyBuildItem.class)` e consumi-la com `@Consume(MyEmptyBuildItem.class)` .

source: Example of an empty build item
pt_br: Exemplo de um item de construção vazio

source: Empty build items can represent "barriers" which can impose ordering between steps. They can also be used in the same way that popular build systems use "pseudo-targets", which is to say that the build item can represent a conceptual goal that does not have a concrete representation.
pt_br: Os itens de construção vazios podem representar "barreiras" que podem impor a ordem entre as etapas. Eles também podem ser usados da mesma forma que os sistemas de construção populares usam "pseudo-alvos", ou seja, o item de construção pode representar um objetivo conceitual que não tem uma representação concreta.

source: Example of usage of an empty build item in a "pseudo-target" style
pt_br: Exemplo de utilização de um item de construção vazio num estilo "pseudo-alvo"

source: Example of usage of an empty build item in a "barrier" style
pt_br: Exemplo de utilização de um item de construção vazio num estilo "barreira"

source: Validation Error build items
pt_br: Itens de construção de Erro de Validação

source: They represent build items with validation errors that make the build fail. These build items are consumed during the initialization of the CDI container.
pt_br: Eles representam itens de construção com erros de validação que fazem a construção falhar. Estes itens de construção são consumidos durante a inicialização do contêiner CDI.

source: Example of usage of an validation error build item in a "pseudo-target" style
pt_br: Exemplo de utilização de um item de construção de erro de validação num estilo "pseudo-alvo"

source: Artifact Result build items
pt_br: Itens de construção de Resultado de Artefato

source: They represent build items containing the runnable artifact generated by the build, such as an uberjar or thin jar. These build items can also be used to always execute a build step without needing to produce anything.
pt_br: Eles representam itens de construção que contêm o artefato executável gerado pela construção, como um uberjar ou thin jar. Esses itens de construção também podem ser usados para sempre executar uma etapa de construção sem a necessidade de produzir nada.

source: Example of build step that is always executed in a "pseudo-target" style
pt_br: Exemplo de passo de construção que é sempre executado num estilo "pseudo-alvo"

source: Injection
pt_br: Injeção

source: Classes which contain build steps support the following types of injection:
pt_br: As classes que contêm etapas de construção suportam os seguintes tipos de injeção:

source: Constructor parameter injection
pt_br: Injeção de parâmetros do construtor

source: Field injection
pt_br: Injeção de campo

source: Method parameter injection (for build step methods only)
pt_br: Injeção de parâmetros de métodos (apenas para métodos de etapas de construção)

source: Build step classes are instantiated and injected for each build step invocation, and are discarded afterwards. State should only be communicated between build steps by way of build items, even if the steps are on the same class.
pt_br: As classes de etapa de construção são instanciadas e injetadas para cada invocação de etapa de construção e são descartadas posteriormente. O estado só deve ser comunicado entre as etapas de construção por meio de itens de construção, mesmo que as etapas estejam na mesma classe.

source: Final fields are not considered for injection, but can be populated by way of constructor parameter injection if desired. Static fields are never considered for injection.
pt_br: Os campos finais não são considerados para injeção, mas podem ser preenchidos por meio da injeção de parâmetros do construtor, se desejado. Os campos estáticos nunca são considerados para injeção.

source: The types of values that can be injected include:
pt_br: Os tipos de valores que podem ser injetados incluem:

source: Objects which are injected into a build step method or its class _must not_ be used outside that method's execution.
pt_br: Os objetos que são injetados em um método de etapa de construção ou em sua classe _não devem_ ser usados fora da execução desse método.

source: Injection is resolved at compile time via an annotation processor, and the resulting code does not have permission to inject private fields or invoke private methods.
pt_br: A injeção é resolvida no momento da compilação por meio de um processador de anotações, e o código resultante não tem permissão para injetar campos privados ou invocar métodos privados.

source: Producing values
pt_br: Produzindo valores

source: A build step may produce values for subsequent steps in several possible ways:
pt_br: Uma etapa de construção pode produzir valores para as etapas subsequentes de várias maneiras possíveis:

source: By returning a `List` of a multi build item class
pt_br: Ao devolver um `List` de uma classe de item de construção múltipla

source: By injecting a `BuildProducer` of a simple or multi build item class
pt_br: Ao injetar um `BuildProducer` de uma classe de item simples ou de construção múltipla

source: If a simple build item is declared on a build step, it _must_ be produced during that build step, otherwise an error will result. Build producers, which are injected into steps, _must not_ be used outside that step.
pt_br: Se um item de construção simples for declarado em uma etapa de construção, ele _deverá_ ser produzido durante essa etapa de construção, caso contrário, ocorrerá um erro. Os produtores de construção, que são injetados nas etapas, _não devem_ ser usados fora dessa etapa.

source: Note that a `@BuildStep` method will only be called if it produces something that another consumer or the final output requires. If there is no consumer for a particular item then it will not be produced. What is required will depend on the final target that is being produced. For example, when running in developer mode the final output will not ask for GraalVM-specific build items such as `ReflectiveClassBuildItem`, so methods that only produce these items will not be invoked.
pt_br: Observe que um método `@BuildStep` só será chamado se produzir algo que outro consumidor ou o resultado final exija. Se não houver um consumidor para um determinado item, ele não será produzido. O que é necessário dependerá do destino final que está sendo produzido. Por exemplo, ao executar no modo de desenvolvedor, a saída final não solicitará itens de construção específicos do GraalVM, como `ReflectiveClassBuildItem`, portanto, os métodos que produzem apenas esses itens não serão chamados.

source: Consuming values
pt_br: Consumindo valores

source: A build step may consume values from previous steps in the following ways:
pt_br: Um passo de construção pode consumir valores de passos anteriores das seguintes formas:

source: By injecting an `Optional` of a simple build item class
pt_br: Ao injetar um `Optional` de uma classe de item de construção simples

source: Normally it is an error for a step which is included to consume a simple build item that is not produced by any other step. In this way, it is guaranteed that all the declared values will be present and non-`null` when a step is run.
pt_br: Normalmente, é um erro uma etapa incluída consumir um item de construção simples que não é produzido por nenhuma outra etapa. Dessa forma, é garantido que todos os valores declarados estarão presentes e não `null` quando uma etapa for executada.

source: Sometimes a value isn't necessary for the build to complete, but might inform some behavior of the build step if it is present. In this case, the value can be optionally injected.
pt_br: Às vezes, um valor não é necessário para que a construção seja concluída, mas pode informar algum comportamento da etapa de construção se estiver presente. Nesse caso, o valor pode ser injetado opcionalmente.

source: Multi build values are always considered _optional_. If not present, an empty list will be injected.
pt_br: Os valores de construção múltipla são sempre considerados _opcionais_. Se não estiverem presentes, será injetada uma lista vazia.

source: Weak value production
pt_br: Produção de valor fraco

source: Normally a build step is included whenever it produces any build item which is in turn consumed by any other build step. In this way, only the steps necessary to produce the final artifact(s) are included, and steps which pertain to extensions which are not installed or which only produce build items which are not relevant for the given artifact type are excluded.
pt_br: Normalmente, uma etapa de construção é incluída sempre que produz qualquer item de construção que, por sua vez, é consumido por qualquer outra etapa de construção. Dessa forma, apenas as etapas necessárias para produzir o(s) artefato(s) final(is) são incluídas, e as etapas relacionadas a extensões que não estão instaladas ou que produzem apenas itens de construção que não são relevantes para o tipo de artefato em questão são excluídas.

source: For cases where this is not desired behavior, the `@io.quarkus.deployment.annotations.Weak` annotation may be used. This annotation indicates that the build step should not automatically be included solely on the basis of producing the annotated value.
pt_br: Nos casos em que esse não é o comportamento desejado, a anotação `@io.quarkus.deployment.annotations.Weak` pode ser usada. Essa anotação indica que a etapa de construção não deve ser incluída automaticamente apenas com base na produção do valor anotado.

source: Example of producing a build item weakly
pt_br: Exemplo de produção de um item de construção de forma fraca

source: This method (not provided in this example) would generate the class using the ASM API.
pt_br: Este método (não fornecido neste exemplo) geraria a classe utilizando a API ASM.

source: Certain types of build items are generally always consumed, such as generated classes or resources. An extension might produce a build item along with a generated class to facilitate the usage of that build item. Such a build step would use the `@Weak` annotation on the generated class build item, while normally producing the other build item. If the other build item is ultimately consumed by something, then the step would run and the class would be generated. If nothing consumes the other build item, the step would not be included in the build process.
pt_br: Certos tipos de itens de construção geralmente são sempre consumidos, como classes ou recursos gerados. Uma extensão pode produzir um item de construção junto com uma classe gerada para facilitar o uso desse item de construção. Essa etapa de construção usaria a anotação `@Weak` no item de construção da classe gerada, enquanto produziria normalmente o outro item de construção. Se o outro item de construção for consumido por algo, a etapa será executada e a classe será gerada. Se nada consumir o outro item de construção, a etapa não será incluída no processo de construção.

source: In the example above, `GeneratedClassBuildItem` would only be produced if `ExecutorClassBuildItem` is consumed by some other build step.
pt_br: No exemplo acima, `GeneratedClassBuildItem` só seria produzido se `ExecutorClassBuildItem` fosse consumido por alguma outra etapa de construção.

source: Example of using a bytecode recorder where the generated class is weakly produced
pt_br: Exemplo de utilização de um gravador de bytecode em que a classe gerada é fracamente produzida

source: Note the `optional` attribute.
pt_br: Note o atributo `optional`.

source: Application Archives
pt_br: Arquivos de Aplicações

source: The `@BuildStep` annotation can also register marker files that determine which archives on the class path are considered to be 'Application Archives', and will therefore get indexed. This is done via the `applicationArchiveMarkers`. For example the ArC extension registers `META-INF/beans.xml`, which means that all archives on the class path with a `beans.xml` file will be indexed.
pt_br: A anotação `@BuildStep` também pode registrar arquivos de marcadores que determinam quais arquivos no caminho da classe são considerados "Arquivos de Aplicações" e, portanto, serão indexados. Isso é feito por meio do `applicationArchiveMarkers` . Por exemplo, a extensão ArC registra `META-INF/beans.xml` , o que significa que todos os arquivos no caminho da classe com um arquivo `beans.xml` serão indexados.

source: Using Thread's Context Class Loader
pt_br: Usando o Carregador de Classe de Contexto da Thread

source: The build step will be run with a TCCL that can load user classes from the deployment in a transformer-safe way. This class loader only lasts for the life of the augmentation, and is discarded afterwards. The classes will be loaded again in a different class loader at runtime. This means that loading a class during augmentation does not stop it from being transformed when running in the development/test mode.
pt_br: A etapa de construção será executada com um TCCL que pode carregar classes de usuário da implantação de forma segura para o transformador. Esse carregador de classes dura apenas a vida útil da ampliação e é descartado depois. As classes serão carregadas novamente em um carregador de classes diferente no tempo de execução. Isso significa que carregar uma classe durante a ampliação não impede que ela seja transformada ao ser executada no modo de desenvolvimento/teste.

source: Adding external JARs to the indexer with IndexDependencyBuildItem
pt_br: Adicionar JARs externos ao indexador com IndexDependencyBuildItem

source: The index of scanned classes will not automatically include your external class dependencies. To add dependencies, create a `@BuildStep` that produces `IndexDependencyBuildItem` objects, for a `groupId` and `artifactId`.
pt_br: O índice de classes verificadas não incluirá automaticamente suas dependências de classe externas. Para adicionar dependências, crie um `@BuildStep` que produza objetos `IndexDependencyBuildItem` , para um `groupId` e `artifactId` .

source: It is important to specify all the required artifacts to be added to the indexer. No artifacts are implicitly added transitively.
pt_br: É importante especificar todos os artefatos necessários a serem adicionados ao indexador. Nenhum artefato é adicionado implicitamente de forma transitória.

source: The `Amazon Alexa` extension adds dependent libraries from the Alexa SDK that are used in Jackson JSON transformations, in order for the reflective classes to identified and included at `BUILD_TIME`.
pt_br: A extensão `Amazon Alexa` adiciona bibliotecas dependentes do Alexa SDK que são utilizadas nas transformações Jackson JSON, para que as classes reflexivas sejam identificadas e incluídas em `BUILD_TIME`.

source: With the artifacts added to the `Jandex` indexer, you can now search the index to identify classes implementing an interface, subclasses of a specific class, or classes with a target annotation.
pt_br: Com os artefatos adicionados ao indexador `Jandex`, você pode agora pesquisar o índice para identificar classes que implementam uma interface, subclasses de uma classe específica ou classes com uma anotação de alvo.

source: For example, the `Jackson` extension uses code like below to search for annotations used in JSON deserialization, and add them to the reflective hierarchy for `BUILD_TIME` analysis.
pt_br: Por exemplo, a extensão `Jackson` usa um código como o abaixo para pesquisar anotações usadas na desserialização de JSON e adicioná-las à hierarquia reflexiva para análise `BUILD_TIME` .

source: Visualizing build step dependencies
pt_br: Visualizando dependências de etapas de construção

source: It can occasionally be useful to see a visual representation of the interactions between the various build steps. For such cases, adding `-Dquarkus.builder.graph-output=build.dot` when building an application will result in the creation of the `build.dot` file in the project's root directory. See link:https://graphviz.org/resources/[this] for a list of software that can open the file and show the actual visual representation.
pt_br: Ocasionalmente, pode ser útil ver uma representação visual das interações entre as várias etapas de construção. Nesses casos, adicionar `-Dquarkus.builder.graph-output=build.dot` ao compilar um aplicativo resultará na criação do arquivo `build.dot` no diretório raiz do projeto. Consulte link:https://graphviz.org/resources/[isto] para obter uma lista de softwares que podem abrir o arquivo e mostrar a representação visual real.

source: Configuration
pt_br: Configuração

source: Configuration in Quarkus is based on https://smallrye.io/smallrye-config/Main/[SmallRye Config]. All features provided by https://smallrye.io/smallrye-config/Main/[SmallRye Config] are also available in Quarkus.
pt_br: A configuração no Quarkus é baseada no https://smallrye.io/smallrye-config/Main/[SmallRye Config]. Todos os recursos fornecidos pelo https://smallrye.io/smallrye-config/Main/[SmallRye Config] também estão disponíveis no Quarkus.

source: Extensions must use https://smallrye.io/smallrye-config/Main/config/mappings/[SmallRye Config @ConfigMapping] to map the configuration required by the Extension. This will allow Quarkus to automatically expose an instance of the mapping to each configuration phase and generate the configuration documentation.
pt_br: As extensões devem usar o https://smallrye.io/smallrye-config/Main/config/mappings/[@ConfigMapping do SmallRye Config] para mapear a configuração exigida pela extensão. Isso permitirá que o Quarkus exponha automaticamente uma instância do mapeamento para cada fase de configuração e gere a documentação da configuração.

source: Config Phases
pt_br: Fases de Configuração

source: Configuration mappings are strictly bound by configuration phase, and attempting to access a configuration mapping from outside its corresponding phase will result in an error. They dictate when its contained keys are read from the configuration, and when they are available to applications. The phases defined by `io.quarkus.runtime.annotations.ConfigPhase` are as follows:
pt_br: Os mapeamentos de configuração são estritamente vinculados à fase de configuração, e a tentativa de acessar um mapeamento de configuração fora da fase correspondente resultará em um erro. Eles determinam quando as chaves contidas são lidas da configuração e quando estão disponíveis para as aplicações. As fases definidas pelo `io.quarkus.runtime.annotations.ConfigPhase` são as seguintes:

source: Phase name
pt_br: Nome da fase

source: Read & avail. at build time
pt_br: Lido e disponível em tempo de construção

source: Avail. at run time
pt_br: Disponível em tempo de execução

source: Read during static init
pt_br: Lido durante a inicialização estática

source: Re-read during startup (native executable)
pt_br: Relido durante a inicialização (executável nativo)

source: Notes
pt_br: Notas

source: Appropriate for things which affect build.
pt_br: Adequado para coisas que afetam a construção.

source: Appropriate for things which affect build and must be visible for run time code. Not read from config at run time.
pt_br: Apropriado para coisas que afetam a construção e devem ser visíveis para o código em tempo de execução. Não lido da configuração em tempo de execução.

source: Not available at build, read at start in all modes.
pt_br: Não disponível na construção, lido no início em todos os modos.

source: For all cases other than the `BUILD_TIME` case, the configuration mapping interface and all the configuration groups and types contained therein must be located in, or reachable from, the extension's run time artifact. Configuration mappings of phase `BUILD_TIME` may be located in or reachable from either of the extension's run time or deployment artifacts.
pt_br: Para todos os casos, com exceção do caso `BUILD_TIME`, a interface de mapeamento da configuração e todos os grupos e tipos de configuração nela contidos devem estar localizados ou ser acessíveis a partir do artefato de tempo de execução da extensão. Os mapeamentos de configuração da fase `BUILD_TIME` podem estar localizados ou acessíveis a partir de qualquer um dos artefatos de tempo de execução ou de implantação da extensão.

source: Configuration Example
pt_br: Exemplo de Configuração

source: `quarkus` - a namespace claimed by Quarkus which is a prefix for `@ConfigMapping` interfaces,
pt_br: `quarkus` - um namespace reivindicado pelo Quarkus que é um prefixo para as interfaces `@ConfigMapping`,

source: `log` - a name segment which corresponds to the prefix set in the interface annotated with `@ConfigMapping`,
pt_br: `log` - um segmento de nome que corresponde ao prefixo definido na interface anotada com `@ConfigMapping`,

source: `file` - a name segment which corresponds to the `file` field in this class,
pt_br: `file` - um segmento de nome que corresponde ao campo `file` desta classe,

source: The `@ConfigMapping` annotation indicates that the interface is a configuration mapping, in this case one which corresponds to a `quarkus.log` segment.
pt_br: A anotação `@ConfigMapping` indica que a interface é um mapeamento de configuração, nesse caso, um que corresponde a um segmento `quarkus.log` .

source: The `@ConfigRoot` annotation indicated to which Config phase, the configuration applies to.
pt_br: A anotação `@ConfigRoot` indica qual fase de configuração a configuração se aplica.

source: Here the `LoggingProcessor` injects a `LogConfiguration` instance automatically by detecting the `@ConfigRoot` annotation.
pt_br: Aqui, o `LoggingProcessor` injeta uma instância `LogConfiguration` automaticamente ao detectar a anotação `@ConfigRoot` .

source: A corresponding `application.properties` for the above example could be:
pt_br: Um `application.properties` correspondente para o exemplo acima poderia ser:

source: Since `format` is not defined in these properties, the default value from `@WithDefault` will be used instead.
pt_br: Uma vez que `format` não está definido nestas propriedades, será utilizado o valor padrão de `@WithDefault`.

source: Configuration Reference Documentation
pt_br: Documentação de Referência de Configuração

source: The configuration is an important part of each extension and therefore needs to be properly documented. Each configuration property should have a proper Javadoc comment.
pt_br: A configuração é uma parte importante de cada extensão e, portanto, precisa ser documentada adequadamente. Cada propriedade de configuração deve ter um comentário Javadoc adequado.
