Repository: quarkusio/pt.quarkus.io
Catalog: l10n/po/*/_guides/writing-extensions.adoc.po
Languages: pt_br

source: If bytecode is recorded with `@Record(STATIC_INIT)` then it will be executed from a static init method on the main class. For a native executable build, this code is executed in a normal JVM as part of the native build process, and any retained objects that are produced in this stage will be directly serialized into the native executable via an image mapped file. This means that if a framework can boot in this phase then it will have its booted state directly written to the image, and so the boot code does not need to be executed when the image is started.
pt_br: Se o bytecode for gravado com `@Record(STATIC_INIT)` , ele será executado a partir de um método de inicialização estático na classe principal. Para uma construção executável nativa, esse código é executado em uma JVM normal como parte do processo de construção nativa, e quaisquer objetos retidos que forem produzidos nesse estágio serão serializados diretamente no executável nativo por meio de um arquivo mapeado de imagem. Isso significa que, se um framework puder inicializar nessa fase, ela terá seu estado inicializado gravado diretamente na imagem e, portanto, o código de inicialização não precisará ser executado quando a imagem for iniciada.

source: There are some restrictions on what can be done in this stage as the Substrate VM disallows some objects in the native executable. For example you should not attempt to listen on a port or start threads in this phase. In addition, it is disallowed to read run time configuration during static initialization.
pt_br: Existem algumas restrições sobre o que pode ser feito nesta fase, uma vez que a Substrate VM não permite alguns objetos no executável nativo. Por exemplo, não se deve tentar escutar numa porta ou iniciar threads nesta fase. Além disso, não é permitido ler a configuração em tempo de execução durante a inicialização estática.

source: In non-native pure JVM mode, there is no real difference between Static and Runtime Init, except that Static Init is always executed first. This mode benefits from the same build phase augmentation as native mode as the descriptor parsing and annotation scanning are done at build time and any associated class/framework dependencies can be removed from the build output jar. In servers like WildFly, deployment related classes such as XML parsers hang around for the life of the application, using up valuable memory. Quarkus aims to eliminate this, so that the only classes loaded at runtime are actually used at runtime.
pt_br: No modo JVM puro não nativo, não há diferença real entre Inicialização Estática e Inicialização Em Tempo de Execução, exceto pelo fato de que a inicialização estática é sempre executada primeiro. Esse modo se beneficia da mesma ampliação da fase de construção que o modo nativo, pois a análise do descritor e a varredura de anotações são feitas no momento da construção e quaisquer dependências de classe/framework associadas podem ser removidas do jar de saída da construção. Em servidores como o WildFly, as classes relacionadas à implantação, como os analisadores XML, permanecem durante todo o tempo de vida da aplicação, utilizando uma memória valiosa. O objetivo do Quarkus é eliminar isso, de modo que as únicas classes carregadas em tempo de execução sejam realmente usadas em tempo de execução.

source: As an example, the only reason that a Quarkus application should load an XML parser is if the user is using XML in their application. Any XML parsing of configuration should be done in the Augmentation phase.
pt_br: Por exemplo, o único motivo pelo qual uma aplicação Quarkus deve carregar um analisador XML é se o usuário estiver usando XML em sua aplicação. Qualquer análise de XML da configuração deve ser feita na fase de ampliação.

source: Runtime Init
pt_br: Inicialização em Tempo de Execução

source: If bytecode is recorded with `@Record(RUNTIME_INIT)` then it is executed from the application's main method. This code will be run on native executable boot. In general as little code as possible should be executed in this phase, and should be restricted to code that needs to open ports etc.
pt_br: Se o bytecode for gravado com `@Record(RUNTIME_INIT)`, ele será executado a partir do método principal do aplicativo. Esse código será executado na inicialização do executável nativo. Em geral, o mínimo possível de código deve ser executado nessa fase e deve ser restrito ao código que precisa abrir portas etc.

source: Pushing as much as possible into the `@Record(STATIC_INIT)` phase allows for two different optimizations:
pt_br: Empurrar o máximo possível para a fase `@Record(STATIC_INIT)` permite duas otimizações diferentes:

source: In both native executable and pure JVM mode this allows the app to start as fast as possible since processing was done during build time. This also minimizes the classes/native code needed in the application to pure runtime related behaviors.
pt_br: Tanto no modo executável nativo quanto no modo JVM puro, isso permite que a aplicação seja iniciada o mais rápido possível, pois o processamento foi feito durante o tempo de construção. Isto também minimiza as classes/código nativo necessário na aplicação para comportamentos puramente relacionados com o tempo de execução.

source: Another benefit with native executable mode is that Substrate can more easily eliminate features that are not used. If features are directly initialized via bytecode, Substrate can detect that a method is never called and eliminate that method. If config is read at runtime, Substrate cannot reason about the contents of the config and so needs to keep all features in case they are required.
pt_br: Outra vantagem do modo executável nativo é que o Substrate pode eliminar mais facilmente os recursos que não são usados. Se os recursos forem inicializados diretamente via bytecode, o Substrate pode detectar que um método nunca é chamado e eliminar esse método. Se a configuração for lida em tempo de execução, o Substrate não pode raciocinar sobre o conteúdo da configuração e, portanto, precisa manter todos os recursos, caso sejam necessários.

source: Project setup
pt_br: Configuração do projeto

source: Your extension project should be setup as a multi-module project with two submodules:
pt_br: O seu projeto de extensão deve ser configurado como um projeto multi-módulo com dois submódulos:

source: A deployment time submodule that handles the build time processing and bytecode recording.
pt_br: Um submódulo de tempo de implantação que trata do processamento do tempo de construção e da gravação de bytecode.

source: A runtime submodule that contains the runtime behavior that will provide the extension behavior in the native executable or runtime JVM.
pt_br: Um submódulo de tempo de execução que contém o comportamento de tempo de execução que fornecerá o comportamento de extensão no executável nativo ou na JVM de tempo de execução.

source: Under no circumstances can the runtime module depend on a deployment artifact. This would result in pulling all the deployment time code into runtime scope, which defeats the purpose of having the split.
pt_br: Em nenhuma circunstância o módulo de tempo de execução pode depender de um artefato de implantação. Isso resultaria em puxar todo o código de tempo de implantação para o escopo de tempo de execução, o que anula o objetivo de ter a divisão.

source: Using Maven
pt_br: Utilizando o Maven

source: You will need to include the `io.quarkus:quarkus-extension-maven-plugin` and configure the `maven-compiler-plugin` to detect the `quarkus-extension-processor` annotation processor to collect and generate the necessary xref:extension-metadata.adoc[Quarkus extension metadata] for the extension artifacts, if you are using the Quarkus parent pom it will automatically inherit the correct configuration.
pt_br: Você precisa incluir o `io.quarkus:quarkus-extension-maven-plugin` e configurar o `maven-compiler-plugin` para detectar o processador de anotações `quarkus-extension-processor` para recolher e gerar os xref:extension-metadata.html[metadados de extensão Quarkus] necessários para os artefatos de extensão. Se estiver utilizando o pom principal do Quarkus, este herdará automaticamente a configuração correta.

source: You may want to use the `create-extension` mojo of `{quarkus-platform-groupid}:quarkus-maven-plugin` to create these Maven modules - see the next section.
pt_br: Você pode querer utilizar o mojo `create-extension` de `{quarkus-platform-groupid}:quarkus-maven-plugin` para criar estes módulos Maven - ver a próxima seção.

source: By convention the deployment time artifact has the `-deployment` suffix, and the runtime artifact has no suffix (and is what the end user adds to their project).
pt_br: Por convenção, o artefato de tempo de implantação tem o sufixo `-deployment` e o artefato de tempo de execução não tem sufixo (e é o que o usuário final adiciona ao seu projeto).

source: The above `maven-compiler-plugin` configuration requires version 3.5+.
pt_br: A configuração `maven-compiler-plugin` acima requer a versão 3.5+.

source: You will also need to configure the `maven-compiler-plugin` of the deployment module to detect the `quarkus-extension-processor` annotation processor.
pt_br: Também será necessário configurar o `maven-compiler-plugin` do módulo de implantação para detectar o processador de anotações `quarkus-extension-processor`.

source: Create new Quarkus Core extension modules using Maven
pt_br: Criar novos módulos de extensão do Quarkus Core utilizando o Maven

source: Quarkus provides `create-extension` Maven Mojo to initialize your extension project.
pt_br: O Quarkus fornece o Mojo `create-extension` do Maven para inicializar o seu projeto de extensão.

source: It will try to auto-detect its options:
pt_br: Ele tentará detectar automaticamente as suas opções:

source: from `quarkus` (Quarkus Core) or `quarkus/extensions` directory, it will use the 'Quarkus Core' extension layout and defaults.
pt_br: a partir do diretório `quarkus` (Quarkus Core) ou `quarkus/extensions`, ele utilizará a layout de extensão 'Quarkus Core' e os padrões.

source: with `-DgroupId=io.quarkiverse.[extensionId]`, it will use the 'Quarkiverse' extension layout and defaults.
pt_br: com `-DgroupId=io.quarkiverse.[extensionId]`, ele utilizará o esquema e as predefinições da extensão 'Quarkiverse'.

source: in other cases it will use the 'Standalone' extension layout and defaults.
pt_br: em outros casos, utilizará o layout e os padrões da extensão "Standalone".

source: we may introduce other layout types in the future.
pt_br: podemos introduzir outros tipos de layout no futuro.

source: You may not specify any parameter to use the interactive mode: `mvn {quarkus-platform-groupid}:quarkus-maven-plugin:{quarkus-version}:create-extension -N`
pt_br: Você não pode especificar qualquer parâmetro para utilizar o modo interativo: `mvn {quarkus-platform-groupid}:quarkus-maven-plugin:{quarkus-version}:create-extension -N`

source: As and example, let's add a new extension called `my-ext` to the Quarkus source tree:
pt_br: Como exemplo, vamos adicionar uma nova extensão chamada `my-ext` à árvore de origem do Quarkus:

source: By default, the `groupId`, `version`, `quarkusVersion`, `namespaceId`, and `namespaceName` will be consistent with other Quarkus core extensions.
pt_br: Por padrão, `groupId`, `version`, `quarkusVersion`, `namespaceId`, e `namespaceName` serão consistentes com outras extensões do núcleo do Quarkus.

source: The extension description is important as it is displayed on https://code.quarkus.io/, when listing extensions with the Quarkus CLI, etc.
pt_br: A descrição da extensão é importante, uma vez que é apresentada em https://code.quarkus.io/, ao listar extensões com o Quarkus CLI, etc.

source: The above sequence of commands does the following:
pt_br: A sequência de comandos acima faz o seguinte:

source: Creates four new Maven modules:
pt_br: Cria quatro novos módulos Maven:

source: `quarkus-my-ext-parent` in the `extensions/my-ext` directory
pt_br: `quarkus-my-ext-parent` no diretório `extensions/my-ext`

source: `quarkus-my-ext` in the `extensions/my-ext/runtime` directory
pt_br: `quarkus-my-ext` no diretório `extensions/my-ext/runtime`

source: `quarkus-my-ext-deployment` in the `extensions/my-ext/deployment` directory; a basic `MyExtProcessor` class is generated in this module.
pt_br: `quarkus-my-ext-deployment` no diretório `extensions/my-ext/deployment`; neste módulo é gerada uma classe básica `MyExtProcessor`.

source: `quarkus-my-ext-integration-test` in the `integration-tests/my-ext/deployment` directory; an empty Jakarta REST Resource class and two test classes (for JVM mode and native mode) are generated in this module.
pt_br: `quarkus-my-ext-integration-test` no diretório `integration-tests/my-ext/deployment`; uma classe de recurso Jakarta REST vazia e duas classes de teste (para o modo JVM e o modo nativo) são geradas neste módulo.

source: Links these three modules where necessary:
pt_br: Liga estes três módulos onde necessário:

source: `quarkus-my-ext-parent` is added to the `<modules>` of `quarkus-extensions-parent`
pt_br: `quarkus-my-ext-parent` é adicionado ao `<modules>` do `quarkus-extensions-parent`

source: `quarkus-my-ext` is added to the `<dependencyManagement>` of the Quarkus BOM (Bill of Materials) `bom/application/pom.xml`
pt_br: `quarkus-my-ext` é adicionado ao `<dependencyManagement>` do BOM (Bill of Materials) do Quarkus `bom/application/pom.xml`

source: `quarkus-my-ext-deployment` is added to the `<dependencyManagement>` of the Quarkus BOM (Bill of Materials) `bom/application/pom.xml`
pt_br: `quarkus-my-ext-deployment` é adicionado ao `<dependencyManagement>` do BOM (Bill of Materials) do Quarkus `bom/application/pom.xml`

source: `quarkus-my-ext-integration-test` is added to the `<modules>` of `quarkus-integration-tests-parent`
pt_br: `quarkus-my-ext-integration-test` é adicionado ao sítio `<modules>` de `quarkus-integration-tests-parent`

source: You also have to fill the xref:extension-metadata.adoc#quarkus-extension-yaml[quarkus-extension.yaml] template file that describe your extension inside the runtime module `src/main/resources/META-INF` folder.
pt_br: Você também precisa preencher o arquivo de modelo xref:extension-metadata.adoc#quarkus-extension-yaml[quarkus-extension.yaml] que descreve a sua extensão dentro da pasta `src/main/resources/META-INF` do módulo de tempo de execução.

source: This is the `quarkus-extension.yaml` template of the `quarkus-agroal` extension, you can use it as an example:
pt_br: Este é o modelo `quarkus-extension.yaml` da extensão `quarkus-agroal`. Pode utilizá-lo como exemplo:

source: the name of the extension that will be displayed to users
pt_br: o nome da extensão que será apresentada aos usuários

source: keywords that can be used to find the extension in the extension catalog
pt_br: palavras-chave que podem ser usadas para encontrar a extensão no catálogo de extensões

source: link to the extension's guide or documentation
pt_br: link para o guia ou documentação da extensão

source: categories under which the extension should appear on https://code.quarkus.io[code.quarkus.io], could be omitted, in which case the extension will still be listed but not under any specific category
pt_br: as categorias em que a extensão deve aparecer em https://code.quarkus.io[code.quarkus.io], podem ser omitidas, caso em que a extensão continuará a ser listada mas não numa categoria específica

source: maturity status, which could be `stable`, `preview` or `experimental`, evaluated by extension maintainers
pt_br: estado de maturidade, que pode ser `stable`, `preview` ou `experimental`, avaliado pelos responsáveis pela extensão

source: The `name` parameter of the mojo is optional. If you do not specify it on the command line, the plugin will derive it from `extensionId` by replacing dashes with spaces and uppercasing each token. So you may consider omitting explicit `name` in some cases.
pt_br: O parâmetro `name` do mojo é opcional. Se você não o especificar na linha de comando, o plug-in o derivará de `extensionId` substituindo os traços por espaços e colocando cada token em caixa alta. Portanto, você pode considerar omitir explicitamente `name` em alguns casos.

source: Please refer to https://github.com/quarkusio/quarkus/blob/{quarkus-version}/devtools/maven/src/main/java/io/quarkus/maven/CreateExtensionMojo.java[CreateExtensionMojo JavaDoc] for all the available options of the mojo.
pt_br: Consulte o https://github.com/quarkusio/quarkus/blob/{quarkus-version}/devtools/maven/src/main/java/io/quarkus/maven/CreateExtensionMojo.java[JavaDoc do CreateExtensionMojo] para conhecer todas as opções disponíveis do mojo.

source: Using Gradle
pt_br: Usando Gradle

source: You will need to apply the `io.quarkus.extension` plugin in the `runtime` module of your extension project. The plugin includes the `extensionDescriptor` task that will generate `META-INF/quarkus-extension.properties` and `META-INF/quarkus-extension.yml` files. The plugin also enables the `io.quarkus:quarkus-extension-processor` annotation processor in both `deployment` and `runtime` modules to collect and generate the rest of the xref:extension-metadata.adoc[Quarkus extension metadata]. The name of the deployment module can be configured in the plugin by setting the `deploymentModule` property. The property is set to `deployment` by default:
pt_br: Você precisará aplicar o plug-in `io.quarkus.extension` no módulo `runtime` do seu projeto de extensão. O plug-in inclui a tarefa `extensionDescriptor` que gerará os arquivos `META-INF/quarkus-extension.properties` e `META-INF/quarkus-extension.yml`. O plug-in também habilita o processador de anotações `io.quarkus:quarkus-extension-processor` nos módulos `deployment` e `runtime` para coletar e gerar o restante dos xref:extension-metadata.adoc[metadados da extensão Quarkus]. O nome do módulo de implantação pode ser configurado no plug-in, definindo a propriedade `deploymentModule`. A propriedade é definida como `deployment` por padrão:

source: Build Step Processors
pt_br: Processadores de Etapas de Construção

source: Work is done at augmentation time by _build steps_ which produce and consume _build items_. The build steps found in the deployment modules that correspond to the extensions in the project build are automatically wired together and executed to produce the final build artifact(s).
pt_br: O trabalho é feito no momento da ampliação por _etapas de construção_ que produzem e consomem _itens de construção_. As etapas de construção encontradas nos módulos de implantação que correspondem às extensões na construção do projeto são automaticamente conectadas e executadas para produzir o(s) artefato(s) de construção final.

source: Build steps
pt_br: Etapas de Construção

source: Build items
pt_br: Itens de Construção

source: Think of build items as a way for different extensions to communicate with one another. For example, a build item can:
pt_br: Pense nos itens de construção como uma forma das diferentes extensões comunicarem umas com as outras. Por exemplo, um item de construção pode:

source: expose the fact that a database configuration exists
pt_br: expor o fato de existir uma configuração da base de dados

source: consume that database configuration (e.g. a connection pool extension or an ORM extension)
pt_br: consumir essa configuração de base de dados (por exemplo, uma extensão de pool de conexões ou uma extensão ORM)

source: ask an extension to do work for another extension: e.g. an extension wanting to define a new CDI bean and asking the ArC extension to do so
pt_br: solicitar que uma extensão faça o trabalho para outra extensão: por exemplo, uma extensão que deseja definir um novo bean CDI e solicita que a extensão ArC o faça

source: This is a very flexible mechanism.
pt_br: Trata-se de um mecanismo muito flexível.

source: `BuildItem` instances should be immutable, as the producer/consumer model does not allow for mutation to be correctly ordered. This is not enforced but failure to adhere to this rule can result in race conditions.
pt_br: `BuildItem` devem ser imutáveis, pois o modelo produtor/consumidor não permite que a mutação seja ordenada corretamente. Isso não é imposto, mas a não observância dessa regra pode resultar em condições de corrida.

source: Build steps are executed if and only if they produce build items that are (transitively) needed by other build steps. Make sure your build step produces a build item, otherwise you should probably produce either `ValidationErrorBuildItem` for build validations, or `ArtifactResultBuildItem` for generated artifacts.
pt_br: Os passos de construção são executados se e somente se eles produzem itens de construção que são (transitivamente) necessários para outros passos de construção. Certifique-se de que sua etapa de construção produz um item de construção, caso contrário, você provavelmente deve produzir `ValidationErrorBuildItem` para validações de construção, ou `ArtifactResultBuildItem` para artefatos gerados.

source: Simple build items
pt_br: Itens de construção simples

source: Simple build items are final classes which extend `io.quarkus.builder.item.SimpleBuildItem`. Simple build items may only be produced by one step in a given build; if multiple steps in a build declare that they produce the same simple build item, an error is raised. Any number of build steps may consume a simple build item. A build step which consumes a simple build item will always run _after_ the build step which produced that item.
pt_br: Os itens de construção simples são classes finais que estendem `io.quarkus.builder.item.SimpleBuildItem`. Os itens de construção simples só podem ser produzidos por uma etapa em uma determinada construção; se várias etapas em uma construção declararem que produzem o mesmo item de construção simples, será gerado um erro. Qualquer número de etapas de construção pode consumir um item de construção simples. Uma etapa de construção que consome um item de construção simples sempre será executada _após_ a etapa de construção que produziu esse item.

source: Example of a single build item
pt_br: Exemplo de um item de construção individual

source: Multi build items
pt_br: Itens de construção múltipla

source: Multiple or "multi" build items are final classes which extend `io.quarkus.builder.item.MultiBuildItem`. Any number of multi build items of a given class may be produced by any number of steps, but any steps which consume multi build items will only run _after_ every step which can produce them has run.
pt_br: Itens de construção múltipla ou "multi" são classes finais que estendem `io.quarkus.builder.item.MultiBuildItem`. Qualquer número de itens de construção múltipla de uma determinada classe pode ser produzido por qualquer número de etapas, mas qualquer etapa que consuma itens de construção múltipla só será executada _após a_ execução de todas as etapas que podem produzi-los.

source: Example of a multiple build item
pt_br: Exemplo de um item de construção múltipla

source: Example of multiple build item usage
pt_br: Exemplo de utilização de vários itens de construção

source: Empty build items
pt_br: Itens de construção vazios
