Repository: quarkusio/pt.quarkus.io
Catalog: l10n/po/*/_guides/writing-extensions.adoc.po
Languages: pt_br

source: Writing Your Own Extension
pt_br: Escrevendo Sua Própria Extensão

source: Quarkus extensions add a new developer focused behavior to the core offering, and consist of two distinct parts, buildtime augmentation and runtime container. The augmentation part is responsible for all metadata processing, such as reading annotations, XML descriptors etc. The output of this augmentation phase is recorded bytecode which is responsible for directly instantiating the relevant runtime services.
pt_br: As extensões Quarkus acrescentam um novo comportamento focado no programador na oferta principal e consistem em duas partes distintas, o aumento do tempo de construção e o contêiner de tempo de execução. A parte de aumento é responsável por todo o processamento de metadados, como a leitura de anotações, descritores XML, etc. O resultado desta fase de aumento é um bytecode registrado que é responsável por instanciar diretamente os serviços de tempo de execução relevantes.

source: This means that metadata is only processed once at build time, which both saves on startup time, and also on memory usage as the classes etc that are used for processing are not loaded (or even present) in the runtime JVM.
pt_br: Isso significa que os metadados são processados apenas uma vez no momento da construção, o que economiza no tempo de inicialização e também no uso da memória, pois as classes etc usadas para o processamento não são carregadas (ou mesmo presentes) na JVM em tempo de execução.

source: Extension philosophy
pt_br: Filosofia da extensão

source: This section is a work in progress and gathers the philosophy under which extensions should be designed and written.
pt_br: Esta seção é um trabalho em curso e reúne a filosofia segundo a qual as extensões devem ser concebidas e escritas.

source: Why an extension framework
pt_br: Por que um framework de extensão

source: Quarkus’s mission is to transform your entire application including the libraries it uses, into an artifact that uses significantly less resources than traditional approaches. These can then be used to build native applications using GraalVM. To do this you need to analyze and understand the full "closed world" of the application. Without the full and complete context, the best that can be achieved is partial and limited generic support. By using the Quarkus extension approach, we can bring Java applications in line with memory footprint constrained environments like Kubernetes or cloud platforms.
pt_br: A missão do Quarkus é transformar toda a sua aplicação, inclusive as bibliotecas que ele usa, em um artefato que utiliza significativamente menos recursos do que as abordagens tradicionais. Esses recursos podem então ser usados para criar aplicações nativos usando GraalVM. Para fazer isso, você precisa analisar e entender o "mundo fechado" completo da aplicação. Sem o contexto total e completo, o melhor que se pode conseguir é um suporte genérico parcial e limitado. Ao usar a abordagem de extensão Quarkus, podemos alinhar as aplicações Java com ambientes com restrições de espaço de memória, como Kubernetes ou plataformas de nuvem.

source: The Quarkus extension framework results in significantly improved resource utilization even when GraalVM is not used (e.g. in HotSpot). Let’s list the actions an extension performs:
pt_br: O framework de extensão do Quarkus resulta em uma utilização de recursos significativamente melhor, mesmo quando o GraalVM não é usado (por exemplo, no HotSpot). Vamos listar as ações que uma extensão executa:

source: Gather build time metadata and generate code
pt_br: Recolher metadados de tempo de construção e gerar código

source: This part has nothing to do with GraalVM, it is how Quarkus starts frameworks “at build time”
pt_br: Esta parte não tem nada a ver com o GraalVM, é a forma como o Quarkus inicia os frameworks "no momento da construção"

source: The extension framework facilitates reading metadata, scanning classes as well as generating classes as needed
pt_br: O framework de extensão facilita a leitura de metadados, a pesquisa de classes e a geração de classes conforme necessário

source: A small part of the extension work is executed at runtime via the generated classes, while the bulk of the work is done at build time (called deployment time)
pt_br: Uma pequena parte do trabalho de extensão é executada em tempo de execução através das classes geradas, enquanto a maior parte do trabalho é feita em tempo de construção (chamado tempo de implantação)

source: Enforce opinionated and sensible defaults based on the close world view of the application (e.g. an application with no `@Entity` does not need to start Hibernate ORM)
pt_br: Aplicar padrões sensatos e opinativos com base na visão global próxima da aplicação (por exemplo, uma aplicação sem `@Entity` não precisa iniciar o Hibernate ORM)

source: An extension hosts Substrate VM code substitution so that libraries can run on GraalVM
pt_br: Uma extensão hospeda a substituição de código da Substrate VM para que as bibliotecas possam ser executadas no GraalVM

source: Most changes are pushed upstream to help the underlying library run on GraalVM
pt_br: A maioria das alterações são encaminhadas para a versão original do código para ajudar a biblioteca subjacente a rodar no GraalVM

source: Not all changes can be pushed upstream, extensions host Substrate VM substitutions - which is a form of code patching - so that libraries can run
pt_br: Nem todas as alterações podem ser encaminhadas para a versão original do código, as extensões hospedam substituições da Substrate VM - que é uma forma de correção de código - para que as bibliotecas possam ser executadas

source: Host Substrate VM code substitution to help dead code elimination based on the application needs
pt_br: Hospedar a substituição de código da Substrate VM para ajudar a eliminar o código morto com base nas necessidades da aplicação

source: This is application dependent and cannot really be shared in the library itself
pt_br: Isto depende da aplicação e não pode ser realmente compartilhado na própria biblioteca

source: For example, Quarkus optimizes the Hibernate code because it knows it only needs a specific connection pool and cache provider
pt_br: Por exemplo, o Quarkus otimiza o código do Hibernate porque sabe que só precisa de um conjunto de conexões e de um fornecedor de cache específicos

source: Send metadata to GraalVM for example classes in need of reflection
pt_br: Enviar metadados ao GraalVM para classes de exemplo que precisam de reflexão

source: This information is not static per library (e.g. Hibernate) but the framework has the semantic knowledge and knows which classes need to have reflection (for example @Entity classes)
pt_br: Esta informação não é estática por biblioteca (por exemplo, Hibernate), mas o framework tem o conhecimento semântico e sabe quais as classes que precisam ter reflexão (por exemplo, classes @Entity)

source: Favor build time work over runtime work
pt_br: Favorecer o trabalho em tempo de construção em detrimento do trabalho em tempo de execução

source: As much as possible favor doing work at build time (deployment part of the extension) as opposed to let the framework do work at startup time (runtime). The more is done there, the smaller Quarkus applications using that extension will be and the faster they will load.
pt_br: Na medida do possível, prefira fazer o trabalho no momento da construção(parte de implantação da extensão) em vez de deixar que o framework faça o trabalho no momento da inicialização (tempo de execução). Quanto mais trabalho for feito ali, menores serão as aplicações Quarkus que usam essa extensão e mais rápido elas serão carregadas.

source: How to expose configuration
pt_br: Como expor a configuração

source: Quarkus simplifies the most common usages. This means that its defaults might be different from the library it integrates.
pt_br: O Quarkus simplifica os usos mais comuns. Isso significa que seus padrões podem ser diferentes da biblioteca que ele integra.

source: To make the simple experience easiest, unify the configuration in `application.properties` via SmallRye Config. Avoid library specific configuration files, or at least make them optional: e.g. `persistence.xml` for Hibernate ORM is optional.
pt_br: Para tornar a experiência simples mais fácil, unifique a configuração em `application.properties` por meio do SmallRye Config. Evite arquivos de configuração específicos de bibliotecas ou, pelo menos, torne-os opcionais: por exemplo, `persistence.xml` para Hibernate ORM é opcional.

source: Extensions should see the configuration holistically as a Quarkus application instead of focusing on the library experience. For example `quarkus.database.url` and friends are shared between extensions as defining a database access is a shared task (instead of a `hibernate.` property for example). The most useful configuration options should be exposed as `quarkus.[extension].` instead of the natural namespace of the library. Less common properties can live in the library namespace.
pt_br: As extensões devem ver a configuração de forma holística como uma aplicação Quarkus em vez de se concentrarem na experiência da biblioteca. Por exemplo, `quarkus.database.url` e amigos são compartilhados entre as extensões, pois a definição de um acesso ao banco de dados é uma tarefa compartilhada (em vez de uma propriedade `hibernate.` , por exemplo). As opções de configuração mais úteis devem ser expostas como `quarkus.[extension].` em vez do namespace natural da biblioteca. As propriedades menos comuns podem residir no namespace da biblioteca.

source: To fully enable the close world assumptions that Quarkus can optimize best, it is better to consider configuration options as build time settled vs overridable at runtime. Of course properties like host, port, password should be overridable at runtime. But many properties like enable caching or setting the JDBC driver can safely require a rebuild of the application.
pt_br: Para habilitar totalmente as suposições de mundo fechado que o Quarkus pode otimizar melhor, é melhor considerar as opções de configuração como estabelecidas no tempo de construção em vez de substituíveis no tempo de execução. É claro que propriedades como host, porta e senha devem ser substituíveis em tempo de execução. Mas muitas propriedades, como ativar o armazenamento em cache ou definir o driver JDBC, podem exigir com segurança uma reconstrução do aplicativo.

source: Static Init Config
pt_br: Configuração de Inicialização Estática

source: If the extension provides additional Config Sources and if these are required during Static Init, these must be registered with `StaticInitConfigBuilderBuildItem`. Configuration in Static Init does not scan for additional sources to avoid double initialization at application startup time.
pt_br: Se a extensão fornecer Fontes de Configuração adicionais e se estas forem necessárias durante a Inicialização Estática, devem ser registradas em `StaticInitConfigBuilderBuildItem`. A configuração na Inicialização Estática não procura fontes adicionais para evitar a dupla inicialização no momento da inicialização da aplicação.

source: Expose your components via CDI
pt_br: Exponha os seus componentes através de CDI

source: Since CDI is the central programming model when it comes to component composition, frameworks and extensions should expose their components as beans that are easily consumable by user applications. For example, Hibernate ORM exposes `EntityManagerFactory` and `EntityManager` beans, the connection pool exposes `DataSource` beans etc. Extensions must register these bean definitions at build time.
pt_br: Como a CDI é o modelo de programação central no que se refere à composição de componentes, os frameworks e as extensões devem expor seus componentes como beans facilmente consumíveis pelas aplicações do usuário. Por exemplo, o Hibernate ORM expõe os beans `EntityManagerFactory` e `EntityManager` , o pool de conexões expõe os beans `DataSource` etc. As extensões devem registrar essas definições de beans no momento da construção.

source: Beans backed by classes
pt_br: Beans apoiados por classes

source: An extension can produce an xref:cdi-integration.adoc#additional_bean_build_item[`AdditionalBeanBuildItem`] to instruct the container to read a bean definition from a class as if it was part of the original application:
pt_br: Uma extensão pode produzir um xref:cdi-integration.adoc#additional_bean_build_item[`AdditionalBeanBuildItem`] para instruir o contêiner a ler uma definição de bean de uma classe como se esta fizesse parte da aplicação original:

source: Bean Class Registered by `AdditionalBeanBuildItem`
pt_br: Classe de Bean Registrada por `AdditionalBeanBuildItem`

source: If a bean registered by an `AdditionalBeanBuildItem` does not specify a scope then `@Dependent` is assumed.
pt_br: Se um bean registrado por um `AdditionalBeanBuildItem` não especificar um escopo, assume-se `@Dependent`.

source: All other beans can inject such a bean:
pt_br: Todos os outros beans podem injetar esse bean:

source: Bean Injecting a Bean Produced by an `AdditionalBeanBuildItem`
pt_br: Bean Injetando um Bean Produzido por um `AdditionalBeanBuildItem`

source: And vice versa - the extension bean can inject application beans and beans provided by other extensions:
pt_br: E vice-versa - o bean de extensão pode injetar beans de aplicação e beans fornecidos por outras extensões:

source: Extension Bean Injection Example
pt_br: Exemplo de Injeção de Bean de Extensão

source: Inject a bean provided by other extension.
pt_br: Injetar um bean fornecido por outra extensão.

source: Inject all beans matching the type `List<String>`.
pt_br: Injetar todos os beans que correspondam ao tipo `List<String>`.

source: Bean initialization
pt_br: Inicialização do bean

source: `BUILD_AND_RUN_TIME_FIXED` and `RUN_TIME` config roots can be injected in any bean. `RUN_TIME` config roots should only be injected after the bootstrap though.
pt_br: As raízes de configuração `BUILD_AND_RUN_TIME_FIXED` e `RUN_TIME` podem ser injetadas em qualquer bean. No entanto, raízes de configuração `RUN_TIME` só devem ser injetadas após o bootstrap.

source: Don't forget to make sure the bean state guarantees the visibility, e.g. via the `volatile` keyword.
pt_br: Não se esqueça de se certificar de que o estado do bean garante a visibilidade, por exemplo, através da palavra-chave `volatile`.

source: Default beans
pt_br: Beans padrões

source: A very useful pattern of creating such beans but also giving application code the ability to easily override some beans with custom implementations, is to use the `@DefaultBean` that Quarkus provides. This is best explained with an example.
pt_br: Um padrão muito útil para criar esses beans, mas que também dá ao código do aplicativo a capacidade de substituir facilmente alguns beans com implementações personalizadas, é usar o `@DefaultBean` que o Quarkus fornece. É melhor explicar isso com um exemplo.

source: Let us assume that the Quarkus extension needs to provide a `Tracer` bean which application code is meant to inject into its own beans.
pt_br: Suponhamos que a extensão Quarkus precisa fornecer um `Tracer` bean que o código da aplicação deve injetar nos seus próprios beans.

source: If for example application code wants to use `Tracer`, but also needs to use a custom `Reporter` bean, such a requirement could easily be done using something like:
pt_br: Se, por exemplo, o código da aplicação quiser utilizar `Tracer`, mas também precisar utilizar um bean `Reporter` personalizado, esse requisito pode ser facilmente cumprido utilizando algo do gênero:

source: How to Override a Bean Defined by a Library/Quarkus Extension that doesn't use @DefaultBean
pt_br: Como Substituir um Bean Definido por uma Biblioteca/Extensão Quarkus que não utiliza @DefaultBean

source: Although `@DefaultBean` is the recommended approach, it is also possible for application code to override beans provided by an extension by marking beans as a CDI `@Alternative` and including `@Priority` annotation. Let's show a simple example. Suppose we work on an imaginary "quarkus-parser" extension and we have a default bean implementation:
pt_br: Embora `@DefaultBean` seja a abordagem recomendada, também é possível que o código da aplicação substitua os beans fornecidos por uma extensão marcando-os como um CDI `@Alternative` e incluindo a anotação `@Priority` . Vamos mostrar um exemplo simples. Suponha que trabalhamos em uma extensão imaginária "quarkus-parser" e que temos uma implementação de bean padrão:

source: And our extension also consumes this parser:
pt_br: E a nossa extensão também consome este parser:

source: Now, if a user or even some other extension needs to override the default implementation of the `Parser` the simplest solution is to use CDI `@Alternative` + `@Priority`:
pt_br: Agora, se um usuário ou mesmo outra extensão precisa substituir a implementação padrão do `Parser`, a solução mais simples é utilizar CDI `@Alternative` + `@Priority`:

source: `MyParser` is an alternative bean.
pt_br: `MyParser` é um bean alternativo.

source: Enables the alternative. The priority could be any number to override the default bean but if there are multiple alternatives the highest priority wins.
pt_br: Habilita a alternativa. A prioridade pode ser qualquer número para substituir o bean padrão, mas se existirem várias alternativas, a prioridade mais elevada ganha.

source: CDI alternatives are only considered during injection and type-safe resolution. For example the default implementation would still receive observer notifications.
pt_br: As alternativas CDI só são consideradas durante a injeção e a resolução da tipagem segura. Por exemplo, a implementação padrão continuaria a receber notificações do observador.

source: Synthetic beans
pt_br: Beans sintéticos

source: Sometimes it is very useful to be able to register a synthetic bean. Bean attributes of a synthetic bean are not derived from a java class, method or field. Instead, the attributes are specified by an extension.
pt_br: Às vezes, é muito útil poder registrar um bean sintético. Os atributos de bean de um bean sintético não são derivados de uma classe, método ou campo Java. Em vez disso, os atributos são especificados por uma extensão.

source: Since the CDI container does not control the instantiation of a synthetic bean the dependency injection and other services (such as interceptors) are not supported. In other words, it's up to the extension to provide all required services to a synthetic bean instance.
pt_br: Como o contêiner CDI não controla a instanciação de um bean sintético, não há suporte para injeção de dependência e outros serviços (como interceptadores). Em outras palavras, cabe à extensão fornecer todos os serviços necessários a uma instância de bean sintético.

source: The `SyntheticBeanBuildItem` can be used to register a synthetic bean:
pt_br: O `SyntheticBeanBuildItem` pode ser utilizado para registrar um bean sintético:

source: to provide a "context" bean that holds all the information collected during augmentation so that the real components do not need any "late initialization" because they can inject the context bean directly.
pt_br: para fornecer um bean de "contexto" que contém todas as informações recolhidas durante a ampliação, de modo a que os componentes reais não necessitem de qualquer "inicialização tardia" porque podem injetar diretamente o bean de contexto.

source: Instance Produced Through Recorder
pt_br: Instância Produzida Através do Gravador

source: The string value is recorded in the bytecode and used to initialize the instance of `Foo`.
pt_br: O valor da string é gravado no bytecode e utilizado para inicializar a instância de `Foo`.

source: "Context" Holder
pt_br: Portador do "Contexto"

source: The "real" components can inject the `TestContext` directly.
pt_br: Os componentes "reais" podem injetar diretamente o `TestContext`.

source: Some types of extensions
pt_br: Alguns tipos de extensões

source: There exist multiple stereotypes of extension, let's list a few.
pt_br: Existem vários estereótipos de extensão, vamos enumerar alguns.

source: Bare library running
pt_br: Biblioteca nua em funcionamento

source: This is the less sophisticated extension. It consists of a set of patches to make sure a library runs on GraalVM. If possible, contribute these patches upstream, not in extensions. Second best is to write Substrate VM substitutions, which are patches applied during native image compilation.
pt_br: Essa é a extensão menos sofisticada. Ela consiste em um conjunto de patches para garantir que uma biblioteca seja executada no GraalVM. Se possível, contribua com esses patches na fonte original, não em extensões. A segunda melhor opção é escrever substituições de Substrate VM, que são patches aplicados durante a compilação da imagem nativa.

source: Get a framework running
pt_br: Colocar um framework em funcionamento

source: A framework at runtime typically reads configuration, scan the classpath and classes for metadata (annotations, getters etc.), build a metamodel on top of which it runs, find options via the service loader pattern, prepare invocation calls (reflection), proxy interfaces, etc. + These operations should be done at build time and the metamodel be passed to the recorder DSL that will generate classes that will be executed at runtime and boot the framework.
pt_br: Um framework em tempo de execução normalmente lê a configuração, examina o classpath e as classes em busca de metadados (anotações, getters etc.), constrói um metamodelo sobre o qual é executado, encontra opções por meio do padrão do carregador de serviços, prepara chamadas de invocação (reflexão), interfaces de proxy etc. Essas operações devem ser feitas no momento da construção e o metamodelo deve ser passado para a DSL do gravador, que gerará classes que serão executadas no tempo de execução e inicializarão o framework.

source: Get a CDI portable extension running
pt_br: Colocar uma extensão portátil CDI em funcionamento

source: The CDI portable extension model is very flexible. Too flexible to benefit from the build time boot promoted by Quarkus. Most extension we have seen do not make use of these extreme flexibility capabilities. The way to port a CDI extension to Quarkus is to rewrite it as a Quarkus extension which will define the various beans at build time (deployment time in extension parlance).
pt_br: O modelo de extensão portátil do CDI é muito flexível. Flexível demais para se beneficiar da inicialização do tempo de construção promovida pelo Quarkus. A maioria das extensões que vimos não faz uso desses recursos de extrema flexibilidade. A maneira de portar uma extensão CDI para o Quarkus é reescrevê-la como uma extensão Quarkus que definirá os vários beans no momento da construção (tempo de implantação no jargão da extensão).

source: Technical aspect
pt_br: Aspecto técnico

source: Three Phases of Bootstrap and Quarkus Philosophy
pt_br: Três Fases do Bootstrap e Filosofia do Quarkus

source: There are three distinct bootstrap phases of a Quarkus app:
pt_br: Há três fases distintas de bootstrap de uma aplicação Quarkus:

source: Augmentation
pt_br: Ampliação

source: Static Init
pt_br: Inicialização Estática
