Repository: quarkusio/pt.quarkus.io
Catalog: l10n/po/*/_guides/writing-extensions.adoc.po
Languages: pt_br

source: Using the parsed `XmlConfig` instance, create an instance of `RuntimeXmlConfigService` and wrap it in a `RuntimeValue`. Use a `RuntimeValue` wrapper for non-interface objects that are non-proxiable.
pt_br: Usando a instância analisada de `XmlConfig`, crie uma instância de `RuntimeXmlConfigService` e envolva-a numa `RuntimeValue`. Use um invólucro `RuntimeValue` para objetos que não sejam de interface e que são não-proxyable.

source: Wrap the return service value in a `RuntimeServiceBuildItem` for use in a RUNTIME_INIT build step that will start the service.
pt_br: Envolva o valor do serviço de retorno num `RuntimeServiceBuildItem` para utilização num passo de construção RUNTIME_INIT que iniciará o serviço.

source: Starting a Service
pt_br: Iniciando um Serviço

source: Now that you have recorded the creation of a service during the build phase, you need to record how to start the service at runtime during booting. You do this with a RUNTIME_INIT build step as shown in the `TestProcessor#startRuntimeService` method.
pt_br: Agora que você gravou a criação de um serviço durante a fase de construção, precisa gravar como iniciar o serviço em tempo de execução durante a inicialização. Você faz isso com uma etapa de construção RUNTIME_INIT, conforme mostrado no método `TestProcessor#startRuntimeService` .

source: Starting/Stopping a Non-CDI Service
pt_br: Iniciando/Parando um Serviço Não CDI

source: We consume a ShutdownContextBuildItem to register the service shutdown.
pt_br: Consumimos um ShutdownContextBuildItem para registrar o encerramento do serviço.

source: We consume the previously initialized service captured in `RuntimeServiceBuildItem`.
pt_br: Consumimos o serviço previamente inicializado capturado em `RuntimeServiceBuildItem`.

source: Call the runtime recorder to record the service start invocation.
pt_br: Chame o gravador de tempo de execução para gravar a invocação do início do serviço.

source: Runtime recorder retrieves the service instance reference and calls its `startService` method.
pt_br: O gravador de tempo de execução recupera a referência da instância do serviço e chama o seu método `startService`.

source: Runtime recorder registers an invocation of the service instance `stopService` method with the Quarkus `ShutdownContext`.
pt_br: O registrador de tempo de execução registra uma invocação do método `stopService` da instância do serviço com o Quarkus `ShutdownContext`.

source: The code for the `RuntimeXmlConfigService` can be viewed here: {quarkus-blob-url}/integration-tests/test-extension/extension/runtime/src/main/java/io/quarkus/extest/runtime/RuntimeXmlConfigService.java[RuntimeXmlConfigService.java]
pt_br: O código para o `RuntimeXmlConfigService` pode ser visualizado aqui: {quarkus-blob-url}/integration-tests/test-extension/extension/runtime/src/main/java/io/quarkus/extest/runtime/RuntimeXmlConfigService.java[RuntimeXmlConfigService.java]

source: The testcase for validating that the `RuntimeXmlConfigService` has started can be found in the `testRuntimeXmlConfigService` test of `ConfiguredBeanTest` and `NativeImageIT`.
pt_br: O caso de teste para validar que o `RuntimeXmlConfigService` foi iniciado pode ser encontrado no teste `testRuntimeXmlConfigService` de `ConfiguredBeanTest` e `NativeImageIT`.

source: Startup and Shutdown Events
pt_br: Eventos de Inicialização e Encerramento

source: The Quarkus container supports startup and shutdown lifecycle events to notify components of the container startup and shutdown. There are CDI events fired that components can observe are illustrated in this example:
pt_br: O contêiner Quarkus suporta eventos de ciclo de vida de inicialização e encerramento para notificar os componentes sobre a inicialização e o encerramento do contêiner. Há eventos CDI disparados que os componentes podem observar, conforme ilustrado neste exemplo:

source: Observing Container Startup
pt_br: Observando a Inicialização do Contêiner

source: Observe a `StartupEvent` to be notified the runtime has started.
pt_br: Observe um `StartupEvent` para ser notificado de que o tempo de execução foi iniciado.

source: Observe a `ShutdownEvent` to be notified when the runtime is going to shut down.
pt_br: Observe um `ShutdownEvent` para ser notificado quando o tempo de execução for encerrado.

source: A `StartupEvent` is fired after all `io.quarkus.deployment.builditem.ServiceStartBuildItem` producers have been consumed. The implication of this is that if an extension has services that application components would expect to have been started when they observe a `StartupEvent`, the build steps that invoke the runtime code to start those services needs to produce a `ServiceStartBuildItem` to ensure that the runtime code is run before the `StartupEvent` is sent. Recall that we saw the production of a `ServiceStartBuildItem` in the previous section, and it is repeated here for clarity:
pt_br: Um `StartupEvent` é disparado após todos os produtores de `io.quarkus.deployment.builditem.ServiceStartBuildItem` terem sido consumidos. A implicação disso é que, se uma extensão tiver serviços que os componentes da aplicação esperam que tenham sido iniciados quando observam um `StartupEvent` , as etapas de construção que invocam o código de tempo de execução para iniciar esses serviços precisam produzir um `ServiceStartBuildItem` para garantir que o código de tempo de execução seja executado antes que o `StartupEvent` seja enviado. Lembre-se de que vimos a produção de um `ServiceStartBuildItem` na seção anterior, e ela é repetida aqui para maior clareza:

source: Example of Producing a ServiceStartBuildItem
pt_br: Exemplo de Produção de um ServiceStartBuildItem

source: Produce a `ServiceStartBuildItem` to indicate that this is a service starting step that needs to run before the `StartupEvent` is sent.
pt_br: Produza um `ServiceStartBuildItem` para indicar que se trata de uma etapa de inicialização do serviço que tem de ser executada antes de o `StartupEvent` ser enviado.

source: Register Resources for Use in Native Image
pt_br: Registre Recursos para Uso na Imagem Nativa

source: Not all configuration or resources can be consumed at build time. If you have classpath resources that the runtime needs to access, you need to inform the build phase that these resources need to be copied into the native image. This is done by producing one or more `NativeImageResourceBuildItem` or `NativeImageResourceBundleBuildItem` in the case of resource bundles. Examples of this are shown in this sample `registerNativeImageResources` build step:
pt_br: Nem todas as configurações ou recursos podem ser consumidos no momento da construção. Se você tiver recursos do classpath que o tempo de execução precisa acessar, é necessário informar à fase de construção que esses recursos precisam ser copiados para a imagem nativa. Isso é feito produzindo um ou mais `NativeImageResourceBuildItem` ou `NativeImageResourceBundleBuildItem` no caso de pacotes de recursos. Exemplos disso são mostrados neste exemplo de etapa de construção `registerNativeImageResources`:

source: Registering Resources and ResourceBundles
pt_br: Registrando Recursos e Pacotes de Recursos

source: Indicate that the /security/runtime.keys classpath resource should be copied into native image.
pt_br: Indica que o recurso de classpath /security/runtime.keys deve ser copiado para a imagem nativa.

source: Indicate that the `META-INF/my-descriptor.xml` resource should be copied into native image
pt_br: Indica que o recurso `META-INF/my-descriptor.xml` deve ser copiado para a imagem nativa

source: Indicate that the "jakarta.xml.bind.Messages" resource bundle should be copied into native image.
pt_br: Indica que o pacote de recursos "jakarta.xml.bind.Messages" deve ser copiado para a imagem nativa.

source: Service files
pt_br: Arquivos de serviço

source: If you are using `META-INF/services` files you need to register the files as resources so that your native image can find them, but you also need to register each listed class for reflection so they can be instantiated or inspected at run-time:
pt_br: Se você estiver usando arquivos `META-INF/services` , será necessário registrar os arquivos como recursos para que a imagem nativa possa encontrá-los, mas também será necessário registrar cada classe listada para reflexão, para que possam ser instanciadas ou inspecionadas em tempo de execução:

source: `ServiceProviderBuildItem` takes a list of service implementation classes as parameters: if you are not reading them from the service file, make sure that they correspond to the service file contents because the service file will still be read and used at run-time. This is not a substitute for writing a service file.
pt_br: `ServiceProviderBuildItem` recebe uma lista de classes de implementação de serviço como parâmetros: se você não as estiver lendo do arquivo de serviço, certifique-se de que elas correspondam ao conteúdo do arquivo de serviço, pois o arquivo de serviço ainda será lido e usado em tempo de execução. Isso não substitui a gravação de um arquivo de serviço.

source: This only registers the implementation classes for instantiation via reflection (you will not be able to inspect its fields and methods). If you need to do that, you can do it this way:
pt_br: Isso apenas registra as classes de implementação para instanciação por meio de reflexão (você não poderá inspecionar seus campos e métodos). Se você precisar fazer isso, pode fazê-lo dessa forma:

source: While this is the easiest way to get your services running natively, it's less efficient than scanning the implementation classes at build time and generating code that registers them at static-init time instead of relying on reflection.
pt_br: Embora essa seja a maneira mais fácil de fazer com que seus serviços sejam executados nativamente, é menos eficiente do que verificar as classes de implementação em tempo de construção e gerar código que as registre no momento da inicialização estática, em vez de depender da reflexão.

source: You can achieve that by adapting the previous build step to use a static-init recorder instead of registering classes for reflection:
pt_br: Você pode conseguir isso adaptando a etapa de construção anterior para usar um gravador de inicialização estática em vez de registrar classes para reflexão:

source: Object Substitution
pt_br: Substituição de Objetos

source: Objects created during the build phase that are passed into the runtime need to have a default constructor in order for them to be created and configured at startup of the runtime from the build time state. If an object does not have a default constructor you will see an error similar to the following during generation of the augmented artifacts:
pt_br: Os objetos criados durante a fase de construção que são passados para o tempo de execução têm de ter um construtor padrão para que sejam criados e configurados na inicialização do tempo de execução a partir do estado do tempo de construção. Se um objeto não tiver um construtor padrão, verá um erro semelhante ao seguinte durante a geração dos artefatos ampliados:

source: DSAPublicKey Serialization Error
pt_br: Erro de Serialização de DSAPublicKey

source: There is a `io.quarkus.runtime.ObjectSubstitution` interface that can be implemented to tell Quarkus how to handle such classes. An example implementation for the `DSAPublicKey` is shown here:
pt_br: Existe uma interface `io.quarkus.runtime.ObjectSubstitution` que pode ser implementada para dizer ao Quarkus como lidar com essas classes. Um exemplo de implementação para a interface `DSAPublicKey` é mostrado aqui:

source: DSAPublicKeyObjectSubstitution Example
pt_br: Exemplo de DSAPublicKeyObjectSubstitution

source: The serialize method takes the object without a default constructor and creates a `KeyProxy` that contains the information necessary to recreate the `DSAPublicKey`.
pt_br: O método serialize pega o objeto sem um construtor padrão e cria um `KeyProxy` que contém as informações necessárias para recriar o `DSAPublicKey`.

source: The deserialize method uses the `KeyProxy` to recreate the `DSAPublicKey` from its encoded form using the key factory.
pt_br: O método deserialize utiliza o `KeyProxy` para recriar o `DSAPublicKey` a partir da sua forma codificada, utilizando a fábrica de chaves.

source: An extension registers this substitution by producing an `ObjectSubstitutionBuildItem` as shown in this `TestProcessor#loadDSAPublicKey` fragment:
pt_br: Uma extensão registra esta substituição produzindo um `ObjectSubstitutionBuildItem`, como mostra este fragmento de `TestProcessor#loadDSAPublicKey`:

source: Registering an Object Substitution
pt_br: Registrando uma Substituição de Objeto

source: Replacing Classes in the Native Image
pt_br: Substituindo Classes na Imagem Nativa

source: The Graal SDK supports substitutions of classes in the native image. An example of how one could replace the `XmlConfig/XmlData` classes with versions that have no JAXB annotation dependencies is shown in these example classes:
pt_br: O Graal SDK oferece suporte a substituições de classes na imagem nativa. Um exemplo de como é possível substituir as classes `XmlConfig/XmlData` por versões que não têm dependências de anotação JAXB é mostrado nestas classes de exemplo:

source: Substitution of XmlConfig/XmlData Classes Example
pt_br: Exemplo de Substituição das Classes XmlConfig/XmlData

source: Ecosystem integration
pt_br: Integração do ecossistema

source: Alternatively, continuous testing and publication can be handled manually.
pt_br: Alternativamente, os testes contínuos e a publicação podem ser efetuados manualmente.

source: Continuous testing of your extension
pt_br: Testes contínuos da sua extensão

source: In order to make it easy for extension authors to test their extensions daily against the latest snapshot of Quarkus, Quarkus has introduced the notion of Ecosystem CI. The Ecosystem CI link:https://github.com/quarkusio/quarkus-ecosystem-ci/blob/main/README.adoc[README] has all the details on how to set up a GitHub Actions job to take advantage of this capability, while this link:https://www.youtube.com/watch?v=VpbRA1n0hHQ[video] provides an overview of what the process looks like.
pt_br: Para facilitar que os autores de extensões testem suas extensões diariamente em relação ao último snapshot do Quarkus, o Quarkus introduziu a noção de Ecosystem CI. O link:https://github.com/quarkusio/quarkus-ecosystem-ci/blob/main/README.adoc[README] do Ecosystem CI tem todos os detalhes sobre como configurar um job do GitHub Actions para aproveitar esse recurso, enquanto este link:https://www.youtube.com/watch?v=VpbRA1n0hHQ[vídeo] fornece uma visão geral de como é o processo.

source: Publish your extension in registry.quarkus.io
pt_br: Publique a sua extensão em registry.quarkus.io

source: Before publishing your extension to the xref:tooling.adoc[Quarkus tooling], make sure that the following requirements are met:
pt_br: Antes de publicar a sua extensão nas xref:tooling.html[ferramentas Quarkus], certifique-se de que os seguintes requisitos são cumpridos:

source: The xref:extension-metadata.adoc#quarkus-extension-yaml[quarkus-extension.yaml] file (in the extension's `runtime/` module) has the minimum metadata set:
pt_br: O arquivo xref:extension-metadata.adoc#quarkus-extension-yaml[quarkus-extension.yaml] (no módulo `runtime/` da extensão) tem o conjunto mínimo de metadados:

source: `description` (unless you have it already set in the ``runtime/pom.xml``'s `<description>` element, which is the recommended approach)
pt_br: `description` (a menos que já esteja definido no elemento `<description>` do `runtime/pom.xml`, que é a abordagem recomendada)

source: Your extension is published in Maven Central
pt_br: A sua extensão é publicada no Maven Central

source: Then you must create a pull request adding a `your-extension.yaml` file in the `extensions/` directory in the link:https://github.com/quarkusio/quarkus-extension-catalog[Quarkus Extension Catalog]. The YAML must have the following structure:
pt_br: Em seguida, deve criar um pull request adicionando um arquivo `your-extension.yaml` no diretório `extensions/` no link:https://github.com/quarkusio/quarkus-extension-catalog[Catálogo de Extensões do Quarkus]. O YAML deve ter a seguinte estrutura:

source: When your repository contains multiple extensions, you need to create a separate file for each individual extension, not just one file for the entire repository.
pt_br: Quando o repositório contém várias extensões, você precisa criar um arquivo separado para cada extensão individual, e não apenas um arquivo para todo o repositório.

source: That's all. Once the pull request is merged, a scheduled job will check Maven Central for new versions and update the xref:extension-registry-user.adoc[Quarkus Extension Registry].
pt_br: Isso é tudo. Assim que o pull request for integrado, um job agendado irá verificar o Maven Central para novas versões e atualizar o xref:extension-registry-user.adoc[Registro de Extensões Quarkus].
