Repository: quarkusio/pt.quarkus.io
Catalog: l10n/po/*/_guides/writing-extensions.adoc.po
Languages: pt_br

source: It is possible to inject beans from our test deployment directly into the test case
pt_br: É possível injetar beans da nossa implantação de teste diretamente no caso de teste

source: This method directly invokes the health check Servlet and verifies the response
pt_br: Este método invoca diretamente o Servlet de verificação de integridade e verifica a resposta

source: This method uses the injected health check bean to verify it is returning the expected result
pt_br: Este método usa o bean de verificação de integridade injetado para verificar se está devolvendo o resultado esperado

source: If you want to test that an extension properly fails at build time, use the `setExpectedException` method:
pt_br: Se você pretende testar se uma extensão falha corretamente em tempo de construção, use o método `setExpectedException`:

source: This tells JUnit that the Quarkus deployment should fail with a specific exception
pt_br: Isto diz ao JUnit que a implantação do Quarkus deve falhar com uma exceção específica

source: Testing hot reload
pt_br: Testando recarga em tempo real

source: It is also possible to write tests that verify an extension works correctly in development mode and can correctly handle updates.
pt_br: Também é possível escrever testes que verifiquem se uma extensão funciona corretamente no modo de desenvolvimento e se consegue lidar corretamente com as atualizações.

source: For most extensions this will just work 'out of the box', however it is still a good idea to have a smoke test to verify that this functionality is working as expected. To test this we use `QuarkusDevModeTest`:
pt_br: Para a maioria das extensões, isso funcionará sem ajustes, mas ainda assim é uma boa ideia fazer um teste de fumaça para verificar se essa funcionalidade está funcionando conforme o esperado. Para testar isso, usamos o site `QuarkusDevModeTest` :

source: This starts the deployment, your test can modify it as part of the test suite. Quarkus will be restarted between each test method so every method starts with a clean deployment.
pt_br: Isso inicia a implantação, e seu teste pode modificá-la como parte do conjunto de testes. O Quarkus será reiniciado entre cada método de teste para que cada método comece com uma implantação limpa.

source: This method allows you to modify the source of a class file. The old source is passed into the function, and the updated source is returned.
pt_br: Esse método permite que você modifique o código-fonte de um arquivo de classe. O código-fonte antigo é passado para a função e o código-fonte atualizado é retornado.

source: This method adds a new class file to the deployment. The source that is used will be the original source that is part of the current project.
pt_br: Esse método adiciona um novo arquivo de classe à implantação. A fonte usada será a fonte original que faz parte do projeto atual.

source: This method modifies a static resource
pt_br: Este método modifica um recurso estático

source: This method adds a new static resource
pt_br: Este método adiciona um novo recurso estático

source: Native Executable Support
pt_br: Suporte a Executáveis Nativos

source: There Quarkus provides a lot of build items that control aspects of the native executable build. This allows for extensions to programmatically perform tasks such as registering classes for reflection or adding static resources to the native executable. Some of these build items are listed below:
pt_br: O Quarkus fornece vários itens de construção que controlam aspectos da construção do executável nativo. Isso permite que as extensões executem tarefas de forma programática, como o registro de classes para reflexão ou a adição de recursos estáticos ao executável nativo. Alguns desses itens de construção estão listados abaixo:

source: Includes static resources into the native executable.
pt_br: Inclui recursos estáticos no executável nativo.

source: Includes directory's static resources into the native executable.
pt_br: Inclui os recursos estáticos do diretório no executável nativo.

source: A class that will be reinitialized at runtime by Substrate. This will result in the static initializer running twice.
pt_br: Uma classe que será reinicializada em tempo de execução pelo Substrate. Isso fará com que o inicializador estático seja executado duas vezes.

source: A system property that will be set at native executable build time.
pt_br: Uma propriedade do sistema que será definida em tempo de construção do executável nativo.

source: Includes a resource bundle in the native executable.
pt_br: Inclui um pacote de recursos no executável nativo.

source: Registers a class for reflection in Substrate. Constructors are always registered, while methods and fields are optional.
pt_br: Registra uma classe para reflexão no Substrate. Os construtores são sempre registrados, enquanto os métodos e campos são opcionais.

source: A class that will be initialized at runtime rather than build time. This will cause the build to fail if the class is initialized as part of the native executable build process, so care must be taken.
pt_br: Uma classe que será inicializada em tempo de execução e não em tempo de construção. Isso fará com que a construção falhe se a classe for inicializada como parte do processo de construção do executável nativo, portanto, é preciso ter cuidado.

source: A convenience feature that allows you to control most of the above features from a single build item.
pt_br: Uma funcionalidade de conveniência que permite controlar a maioria das funcionalidades acima referidas a partir de um único item de construção.

source: Indicates that all charsets should be enabled in native image.
pt_br: Indica que todos os conjuntos de caracteres devem ser ativados na imagem nativa.

source: A convenient way to tell Quarkus that the extension requires SSL, and it should be enabled during native image build. When using this feature, remember to add your extension to the list of extensions that offer SSL support automatically on the https://github.com/quarkusio/quarkus/blob/main/docs/src/main/asciidoc/native-and-ssl.adoc[native and ssl guide].
pt_br: Uma maneira conveniente de informar ao Quarkus que a extensão requer SSL e deve ser ativada durante a criação da imagem nativa. Ao usar esse recurso, lembre-se de adicionar sua extensão à lista de extensões que oferecem suporte a SSL automaticamente na https://github.com/quarkusio/quarkus/blob/main/docs/src/main/asciidoc/native-and-ssl.adoc[guia nativo e ssl].

source: IDE support tips
pt_br: Sugestões de suporte à IDE

source: Writing Quarkus extensions in Eclipse
pt_br: Escrevendo extensões Quarkus no Eclipse

source: The only particular aspect of writing Quarkus extensions in Eclipse is that APT (Annotation Processing Tool) is required as part of extension builds, which means you need to:
pt_br: O único aspecto particular da escrita de extensões Quarkus no Eclipse é o fato de a APT (Annotation Processing Tool - Ferramenta de Processamento de Anotação) ser necessária como parte das compilações de extensões, o que significa que é necessário:

source: Install `m2e-apt` from https://marketplace.eclipse.org/content/m2e-apt
pt_br: Instalar `m2e-apt` a partir de https://marketplace.eclipse.org/content/m2e-apt

source: Define this property in your `pom.xml`: `<m2e.apt.activation>jdt_apt</m2e.apt.activation>`, although if you rely on `io.quarkus:quarkus-build-parent` you will get it for free.
pt_br: Defina esta propriedade em `pom.xml`: `<m2e.apt.activation>jdt_apt</m2e.apt.activation>`, no entando se você recorrer a `io.quarkus:quarkus-build-parent` a obterá gratuitamente.

source: If you have the `io.quarkus:quarkus-extension-processor` project open at the same time in your IDE (for example, if you have the Quarkus sources checked out and open in your IDE) you will need to close that project. Otherwise, Eclipse will not invoke the APT plugin that it contains.
pt_br: Se tiver o projeto `io.quarkus:quarkus-extension-processor` aberto ao mesmo tempo no seu IDE (por exemplo, se tiver as fontes Quarkus verificadas e abertas no seu IDE), terá de fechar esse projeto. Caso contrário, o Eclipse não invocará o plug-in APT que ele contém.

source: If you just closed the extension processor project, be sure to do `Maven > Update Project` on the other projects in order for Eclipse to pick up the extension processor from the Maven repository.
pt_br: Se acabou de fechar o projeto do processador de extensões, certifique-se de fazer `Maven > Update Project` nos outros projetos para que o Eclipse vá buscar o processador de extensões no repositório Maven.

source: Troubleshooting / Debugging Tips
pt_br: Dicas de Resolução de Problemas / Depuração

source: Inspecting the Generated/Transformed Classes
pt_br: Inspecionando as Classes Geradas/Transformadas

source: Quarkus generates a lot of classes during the build phase and in many cases also transforms existing classes. It is often extremely useful to see the generated bytecode and transformed classes during the development of an extension.
pt_br: O Quarkus gera muitas classes durante a fase de construção e, em muitos casos, também transforma as classes existentes. Muitas vezes, é extremamente útil ver o bytecode gerado e as classes transformadas durante o desenvolvimento de uma extensão.

source: This property only works during a normal production build (i.e. not for dev mode/tests) and when `fast-jar` packaging type is used (the default behavior).
pt_br: Esta propriedade só funciona durante uma construção de produção normal (ou seja, não para o modo de desenvolvimento/testes) e quando o tipo de empacotamento `fast-jar` é usado (o comportamento padrão).

source: There are also three system properties that allow you to dump the generated/transformed classes to the filesystem and inspect them later, for example via a decompiler in your IDE.
pt_br: Existem também três propriedades do sistema que lhe permitem despejar as classes geradas/transformadas para o sistema de arquivos e inspecioná-las mais tarde, por exemplo, através de um descompilador no seu IDE.

source: `quarkus.debug.generated-classes-dir` - to dump the generated classes, such as bean metadata
pt_br: `quarkus.debug.generated-classes-dir` - para despejar as classes geradas, tais como metadados de beans

source: `quarkus.debug.transformed-classes-dir` - to dump the transformed classes, e.g. Panache entities
pt_br: `quarkus.debug.transformed-classes-dir` - para despejar as classes transformadas, por exemplo, entidades Panache

source: `quarkus.debug.generated-sources-dir` - to dump the ZIG files; ZIG file is a textual representation of the generated code that is referenced in the stack traces
pt_br: `quarkus.debug.generated-sources-dir` - para despejar os arquivos ZIG; o arquivo ZIG é uma representação textual do código gerado que é referenciado nos rastreamentos de pilha

source: These properties are especially useful in the development mode or when running the tests where the generated/transformed classes are only held in memory in a class loader.
pt_br: Estas propriedades são especialmente úteis no modo de desenvolvimento ou durante a execução dos testes em que as classes geradas/transformadas são apenas mantidas em memória num carregador de classes.

source: For example, you can specify the `quarkus.debug.generated-classes-dir` system property to have these classes written out to disk for inspection in the development mode:
pt_br: Por exemplo, você pode especificar a propriedade de sistema `quarkus.debug.generated-classes-dir` para que estas classes sejam gravadas no disco para inspeção no modo de desenvolvimento:

source: The property value could be either an absolute path, such as `/home/foo/dump` on a Linux machine, or a path relative to the user working directory, i.e. `dump` corresponds to the `{user.dir}/target/dump` in the dev mode and `{user.dir}/dump` when running the tests.
pt_br: O valor da propriedade pode ser um caminho absoluto, como `/home/foo/dump` numa máquina Linux, ou um caminho relativo ao diretório de trabalho do usuário, ou seja, `dump` corresponde a `{user.dir}/target/dump` no modo de desenvolvimento e `{user.dir}/dump` quando se executam os testes.

source: You should see a line in the log for each class written to the directory:
pt_br: Você deve ver uma linha no registro para cada classe escrita no diretório:

source: The property is also honored when running tests:
pt_br: A propriedade também é honrada durante a execução de testes:

source: Analogously, you can use the `quarkus.debug.transformed-classes-dir` and `quarkus.debug.generated-sources-dir` properties to dump the relevant output.
pt_br: De forma análoga, você pode usar as propriedades `quarkus.debug.transformed-classes-dir` e `quarkus.debug.generated-sources-dir` para despejar a saída relevante.

source: Multi-module Maven Projects and the Development Mode
pt_br: Projetos Maven de Múltiplos Módulos e o Modo de Desenvolvimento

source: Indexer does not include your external dependency
pt_br: O indexador não inclui a sua dependência externa

source: Remember to add `IndexDependencyBuildItem` artifacts to your `@BuildStep`.
pt_br: Não se esqueça de adicionar os artefatos `IndexDependencyBuildItem` ao seu `@BuildStep`.

source: Sample Test Extension
pt_br: Exemplo de Extensão de Teste

source: We have an extension that is used to test for regressions in the extension processing. It is located in {quarkus-tree-url}/integration-tests/test-extension/extension directory. In this section we touch on some tasks an extension author will typically need to perform using the test-extension code to illustrate how the task could be done.
pt_br: Temos uma extensão que é usada para testar regressões no processamento da extensão. Ela está localizada no diretório {quarkus-tree-url}/integration-tests/test-extension/extension. Nesta seção, abordaremos algumas tarefas que um autor de extensão normalmente precisará executar usando o código test-extension para ilustrar como a tarefa pode ser realizada.

source: Features and Capabilities
pt_br: Funcionalidades e Capacidades

source: Features
pt_br: Características

source: A _feature_ represents a functionality provided by an extension. The name of the feature gets displayed in the log during application bootstrap.
pt_br: Uma _funcionalidade_ representa uma funcionalidade fornecida por uma extensão. O nome da funcionalidade é exibido no registro durante o bootstrap da aplicação.

source: Example Startup Lines
pt_br: Linhas de Inicialização de Exemplo

source: A list of features installed in the runtime image
pt_br: Uma lista de funcionalidades instaladas na imagem de tempo de execução

source: The name of the feature should only contain lowercase characters, words are separated by dash; e.g. `security-jpa`. An extension should provide at most one feature and the name must be unique. If multiple extensions register a feature of the same name the build fails.
pt_br: O nome da funcionalidade deve conter apenas caracteres minúsculos, as palavras são separadas por traço; por exemplo, `security-jpa`. Uma extensão deve fornecer no máximo uma funcionalidade e o nome deve ser exclusivo. Se várias extensões registrarem uma funcionalidade com o mesmo nome, a construção falhará.

source: Capabilities
pt_br: Capacidades

source: A _capability_ represents a technical capability that can be queried by other extensions. An extension may provide multiple capabilities and multiple extensions can provide the same capability. By default, capabilities are not displayed to users. Capabilities should be used when checking for the presence of an extension rather than class path based checks.
pt_br: Uma _capacidade_ representa um recurso técnico que pode ser consultado por outras extensões. Uma extensão pode fornecer várias capacidades e várias extensões podem fornecer a mesma capacidade. Por padrão, as capacidades não são exibidas aos usuários. As capacidades devem ser usadas ao verificar a presença de uma extensão em vez de verificações baseadas em caminhos de classe.

source: Extensions can consume registered capabilities using the `Capabilities` build item:
pt_br: As extensões podem consumir capacidades registradas usando o item de construção `Capabilities`:

source: Capabilities should follow the naming conventions of Java packages; e.g. `io.quarkus.security.jpa`. Capabilities provided by core extensions should be listed in the `io.quarkus.deployment.Capability` enum and their name should always start with the `io.quarkus` prefix.
pt_br: As capacidades devem seguir as convenções de nomenclatura dos pacotes Java; por exemplo, `io.quarkus.security.jpa` . As capacidades fornecidas pelas extensões principais devem ser listados no enum `io.quarkus.deployment.Capability` e seu nome deve sempre começar com o prefixo `io.quarkus` .

source: Bean Defining Annotations
pt_br: Anotações de Definição de Bean

source: Register a Bean Defining Annotation
pt_br: Registrando uma Anotação de Definição de Bean

source: Register the annotation class and CDI default scope using the Jandex `DotName` class.
pt_br: Registre a classe de anotação e o escopo padrão CDI usando a classe Jandex `DotName`.

source: `ConfiguredBean` will be processed by the CDI layer the same as a bean annotated with the CDI standard @ApplicationScoped.
pt_br: `ConfiguredBean` será processado pela camada CDI da mesma forma que um bean anotado com a @ApplicationScoped padrão CDI.

source: Parsing Config to Objects
pt_br: Analisando Configurações para Objetos

source: One of the main things an extension is likely to do is completely separate the configuration phase of behavior from the runtime phase. Frameworks often do parsing/load of configuration on startup that can be done during build time to both reduce the runtime dependencies on frameworks like xml parsers as well as reducing the startup time the parsing incurs.
pt_br: Uma das principais coisas que uma extensão provavelmente fará é separar completamente a fase de configuração do comportamento da fase de tempo de execução. Os frameworks geralmente fazem a análise/carregamento da configuração na inicialização que pode ser feita durante o tempo de construção para reduzir as dependências de tempo de execução em frameworks como analisadores xml bem como reduzir o tempo de inicialização que a análise incorre.

source: An example of parsing an XML config file using JAXB is shown in the `TestProcessor#parseServiceXmlConfig` method:
pt_br: Um exemplo de análise de um arquivo de configuração XML usando JAXB é mostrado no método `TestProcessor#parseServiceXmlConfig` :

source: Parsing an XML Configuration into Runtime XmlConfig Instance
pt_br: Analisando uma Configuração XML em uma Instância XmlConfig em Tempo de Execução

source: Look for a config.xml classpath resource
pt_br: Procura por um recurso classpath config.xml

source: If found, parse using JAXB context for `XmlConfig.class`
pt_br: Se for encontrado, analisa utilizando o contexto JAXB para `XmlConfig.class`

source: If there was no /config.xml resource available in the build environment, then a null `RuntimeServiceBuildItem` would be returned and no subsequent logic based on a `RuntimeServiceBuildItem` being produced would execute.
pt_br: Se não houvesse nenhum recurso /config.xml disponível no ambiente de construção, seria devolvido um `RuntimeServiceBuildItem` nulo e não seria executada qualquer lógica subsequente baseada num `RuntimeServiceBuildItem` produzido.

source: If for some reason you need to parse the config and use it in other build steps in an extension processor, you would need to create an `XmlConfigBuildItem` to pass the parsed XmlConfig instance around.
pt_br: Se, por algum motivo, for necessário analisar a configuração e utilizá-la em outros passos de construção num processador de extensão, será necessário criar um `XmlConfigBuildItem` para transmitir a instância XmlConfig analisada.

source: Scanning Deployments Using Jandex
pt_br: Verificando Implantações Usando Jandex

source: If your extension defines annotations or interfaces that mark beans needing to be processed, you can locate these beans using the Jandex API, a Java annotation indexer and offline reflection library. The following `TestProcessor#scanForBeans` method shows how to find the beans annotated with our `@TestAnnotation` that also implement the `IConfigConsumer` interface:
pt_br: Se a sua extensão definir anotações ou interfaces que marcam os beans que precisam ser processados, você pode localizar esses beans utilizando a API Jandex, um indexador de anotações Java e uma biblioteca de reflexão offline. O método `TestProcessor#scanForBeans` a seguir mostra como localizar os beans anotados com nosso `@TestAnnotation` que também implementam a interface `IConfigConsumer`:

source: Example Jandex Usage
pt_br: Exemplo de Uso do Jandex

source: Depend on a `BeanArchiveIndexBuildItem` to have the build step be run after the deployment has been indexed.
pt_br: Depende de um `BeanArchiveIndexBuildItem` para que o passo de construção seja executado depois da implantação ter sido indexada.

source: Retrieve the index.
pt_br: Recupera o índice.

source: Find all beans annotated with `@TestAnnotation`.
pt_br: Encontra todos os beans anotados com `@TestAnnotation`.

source: Determine which of these beans also has the `IConfigConsumer` interface.
pt_br: Determina qual destes beans também tem a interface `IConfigConsumer`.

source: Save the bean class in a `TestBeanBuildItem` for use in a latter RUNTIME_INIT build step that will interact with the bean instances.
pt_br: Salva a classe do bean em `TestBeanBuildItem` para utilizar num passo de construção RUNTIME_INIT posterior que irá interagir com as instâncias do bean.

source: Interacting With Extension Beans
pt_br: Interagindo Com os Beans de Extensão

source: You can use the `io.quarkus.arc.runtime.BeanContainer` interface to interact with your extension beans. The following `configureBeans` methods illustrate interacting with the beans scanned for in the previous section:
pt_br: Você pode utilizar a interface `io.quarkus.arc.runtime.BeanContainer` para interagir com os seus beans de extensão. Os seguintes métodos `configureBeans` ilustram a interação com os beans analisados na seção anterior:

source: Using CDI BeanContainer Interface
pt_br: Usando a Interface CDI BeanContainer

source: Consume the `TestBeanBuildItem`s produced from the scanning build step.
pt_br: Consome o `TestBeanBuildItem` produzido a partir da etapa de construção de varredura.

source: Consume the `BeanContainerBuildItem` to order this build step to run after the CDI bean container has been created.
pt_br: Consume o `BeanContainerBuildItem` para ordenar que este passo de construção seja executado depois que o contêiner de beans CDI tenha sido criado.

source: Call the runtime recorder to record the bean interactions.
pt_br: Chame o gravador de tempo de execução para registrar as interações do bean.

source: Runtime recorder retrieves the bean using its type.
pt_br: O gravador de tempo de execução recupera o bean usando o seu tipo.

source: Runtime recorder invokes the `IConfigConsumer#loadConfig(...)` method passing in the configuration objects with runtime information.
pt_br: O gravador de tempo de execução invoca o método `IConfigConsumer#loadConfig(…​)`, passando os objetos de configuração com informações de tempo de execução.

source: Manage Non-CDI Service
pt_br: Gerenciar Serviço Não CDI

source: Creating a Non-CDI Service
pt_br: Criando um Serviço Não CDI

source: Call into the runtime recorder to record the creation of the service.
pt_br: Chame gravador de tempo de execução para registrar a criação do serviço.
