Repository: quarkusio/pt.quarkus.io
Catalog: l10n/po/*/_guides/writing-extensions.adoc.po
Languages: pt_br

source: While it is handy to have the documentation available when coding, the configuration documentation must also be available in the extension guides. The Quarkus build automatically generates the configuration documentation based on the Javadoc comments, but it needs to be explicitly included in each guide.
pt_br: Embora seja útil ter a documentação disponível durante a codificação, a documentação de configuração também deve estar disponível nos guias de extensão. A construção do Quarkus gera automaticamente a documentação de configuração com base nos comentários do Javadoc, mas ela precisa ser incluída explicitamente em cada guia.

source: Writing the documentation
pt_br: Escrevendo a documentação

source: Each configuration property, requires a Javadoc explaining its purpose.
pt_br: Cada propriedade de configuração requer um Javadoc que explique o seu objetivo.

source: The first sentence should be meaningful and self-contained as it is included in the summary table.
pt_br: A primeira frase deve ser significativa e autônoma, uma vez que está incluída no sumário.

source: While standard Javadoc comments are perfectly fine for simple documentation (recommended even), AsciiDoc is more suitable for tips, source code extracts, lists and more:
pt_br: Embora os comentários Javadoc padrão sejam perfeitamente adequados para documentação simples (até mesmo recomendados), o AsciiDoc é mais adequado para dicas, extratos de código-fonte, listas e muito mais:

source: To use AsciiDoc, the Javadoc comment must be annotated with `@asciidoclet` tag. This tag serves two purposes: it is used as a marker for Quarkus generation tool, but it is also used by the `javadoc` process for the Javadoc generation.
pt_br: Para usar o AsciiDoc, o comentário do Javadoc deve ser anotado com a tag `@asciidoclet` . Essa tag tem duas finalidades: é usada como um marcador para a ferramenta de geração Quarkus, mas também é usada pelo processo `javadoc` para a geração do Javadoc.

source: A more detailed example:
pt_br: Um exemplo mais detalhado:

source: For indentation to be respected in the Javadoc comment (list items spread on multiple lines or indented source code), the automatic Eclipse formatter must be disabled (the formatter is automatically included in the build), with the markers `// @formatter:off`/`// @formatter:on`. These require separate comments and a mandatory space after the `//` marker.
pt_br: Para que a identação seja respeitada no comentário do Javadoc (itens de lista espalhados em várias linhas ou código-fonte recuado), o formatador automático do Eclipse deve ser desativado (o formatador é incluído automaticamente na construção), com os marcadores `// @formatter:off` / `// @formatter:on` . Isso exige comentários separados e um espaço obrigatório após o marcador `//` .

source: Open blocks (`--`) are not supported in the AsciiDoc documentation. All the other types of blocks (source, admonitions...) are supported.
pt_br: Os blocos abertos ( `--` ) não são compatíveis com a documentação do AsciiDoc. Todos os outros tipos de blocos (fonte, advertências...) são compatíveis.

source: By default, the documentation generator will use the hyphenated field name as the key of a `java.util.Map`. Use the `io.quarkus.runtime.annotations.ConfigDocMapKey` annotation to override the behaviour.
pt_br: Por padrão, o gerador de documentação usará o nome do campo hifenizado como a chave de um `java.util.Map` . Use a anotação `io.quarkus.runtime.annotations.ConfigDocMapKey` para substituir o comportamento.

source: This will generate a configuration map key named `quarkus.some."cache-name"` instead of `quarkus.some."namespace"`.
pt_br: Isto irá gerar uma chave de mapa de configuração com o nome `quarkus.some."cache-name"` em vez de `quarkus.some."namespace"`.

source: It is possible to write a textual explanation for the documentation default value, this is useful when it is generated: `@ConfigDocDefault("explain how this is generated")`.
pt_br: É possível escrever uma explicação textual para o valor padrão da documentação, o que é útil quando ela é gerada: `@ConfigDocDefault("explain how this is generated")`.

source: `@ConfigDocEnumValue` gives a way to explicitly customize the string displayed in the documentation when listing accepted values for an enum.
pt_br: `@ConfigDocEnumValue` oferece uma maneira de personalizar explicitamente o texto exibido na documentação ao listar os valores aceitos para um enum.

source: Writing section documentation
pt_br: Escrevendo documentação de seção

source: To generate a configuration section of a given group, use the `@ConfigDocSection` annotation:
pt_br: Para gerar uma seção de configuração de um determinado grupo, use a anotação `@ConfigDocSection`:

source: This will add a section documentation for the `configGroup` config item in the generated documentation. The section title and introduction will be derived from the javadoc of the configuration item. The first sentence from the javadoc is considered as the section title and the remaining sentences used as section introduction.
pt_br: Isso adicionará uma seção de documentação para o item de configuração `configGroup` na documentação gerada. O título e a introdução da seção serão derivados do javadoc do item de configuração. A primeira frase do javadoc é considerada como o título da seção e as frases restantes são usadas como a introdução da seção.

source: Generating the documentation
pt_br: Gerando a documentação

source: To generate the documentation:
pt_br: Para gerar a documentação:

source: Can be executed globally or in a specific extension directory (e.g. `extensions/mailer`).
pt_br: Pode ser executado globalmente ou num diretório de extensão específico (por exemplo, `extensions/mailer`).

source: The documentation is generated in the global `target/asciidoc/generated/config/` located at the root of the project.
pt_br: A documentação é gerada na `target/asciidoc/generated/config/` global localizada na raiz do projeto.

source: Including the documentation in the extension guide
pt_br: Incluindo a documentação no guia de extensão

source: To include the generated configuration reference documentation in a guide, use:
pt_br: Para incluir a documentação de referência de configuração gerada num guia, use:

source: To include only a specific config group:
pt_br: Para incluir apenas um grupo de configuração específico:

source: For example, the `io.quarkus.vertx.http.runtime.FormAuthConfig` configuration group will be generated in a file named `quarkus-vertx-http-config-group-form-auth-config.adoc`.
pt_br: Por exemplo, o grupo de configuração `io.quarkus.vertx.http.runtime.FormAuthConfig` será gerado em um arquivo chamado `quarkus-vertx-http-config-group-form-auth-config.adoc`.

source: A few recommendations:
pt_br: Algumas recomendações:

source: `opts=optional` is mandatory to not fail the build if only part of the configuration documentation has been generated.
pt_br: `opts=optional` é obrigatório para não falhar a construção se apenas parte da documentação de configuração tiver sido gerada.

source: The documentation is generated with a title level of 2 (i.e. `==`). It may need an adjustment with `leveloffset=+N`.
pt_br: A documentação é gerada com um nível de título de 2 (ou seja, `==`). Pode ser necessário um ajuste com `leveloffset=+N`.

source: The whole configuration documentation should not be included in the middle of the guide.
pt_br: A documentação completa de configuração não deve ser incluída no meio do guia.

source: If the guide includes an `application.properties` example, a tip must be included just below the code snippet:
pt_br: Se o guia incluir um exemplo de `application.properties`, uma dica deve ser incluída logo abaixo do trecho de código:

source: And at the end of the guide, the extensive configuration documentation:
pt_br: E no final do guia, a extensa documentação de configuração:

source: All documentation should be generated and validated before being committed.
pt_br: Toda a documentação deve ser gerada e validada antes de ser aceita.

source: Conditional Step Inclusion
pt_br: Inclusão Condicional de Etapas

source: It is possible to only include a given `@BuildStep` under certain conditions. The `@BuildStep` annotation has two optional parameters: `onlyIf` and `onlyIfNot`. These parameters can be set to one or more classes which implement `BooleanSupplier`. The build step will only be included when the method returns `true` (for `onlyIf`) or `false` (for `onlyIfNot`).
pt_br: É possível incluir um determinado `@BuildStep` somente em determinadas condições. A anotação `@BuildStep` tem dois parâmetros opcionais: `onlyIf` e `onlyIfNot` . Esses parâmetros podem ser definidos para uma ou mais classes que implementam `BooleanSupplier` . A etapa de construção só será incluída quando o método retornar `true` (para `onlyIf` ) ou `false` (para `onlyIfNot` ).

source: The condition class may also inject a value of type `io.quarkus.runtime.LaunchMode`. Constructor parameter and field injection is supported.
pt_br: A classe de condição também pode injetar um valor do tipo `io.quarkus.runtime.LaunchMode` . Há suporte para injeção de campo e parâmetro de construtor.

source: An example of a conditional build step
pt_br: Um exemplo de um passo de construção condicional

source: You can also apply a set of conditions to all build steps in a given class with `@BuildSteps`:
pt_br: Também é possível aplicar um conjunto de condições a todos os passos de construção numa determinada classe com `@BuildSteps`:

source: Class-wide condition for build step with @BuildSteps
pt_br: Condição em toda a classe para o passo de construção com @BuildSteps

source: This condition will apply to all methods defined in `MyDevModeProcessor`
pt_br: Esta condição será aplicada a todos os métodos definidos em `MyDevModeProcessor`

source: The main build step will only be executed in dev mode.
pt_br: A etapa principal de construção só será executada no modo de desenvolvimento.

source: The other build step will only be executed in dev mode.
pt_br: A outra etapa de construção só será executada no modo de desenvolvimento.

source: Bytecode Recording
pt_br: Gravação de Bytecode

source: One of the main outputs of the build process is recorded bytecode. This bytecode actually sets up the runtime environment. For example, in order to start Undertow, the resulting application will have some bytecode that directly registers all Servlet instances and then starts Undertow.
pt_br: Um dos principais resultados do processo de construção é o bytecode gravado. Na verdade, esse bytecode configura o ambiente de tempo de execução. Por exemplo, para iniciar o Undertow, a aplicação resultante terá algum bytecode que registra diretamente todas as instâncias de Servlet e, em seguida, inicia o Undertow.

source: As writing bytecode directly is complex, this is instead done via bytecode recorders. At deployment time, invocations are made on recorder objects that contain the actual runtime logic, but instead of these invocations proceeding as normal they are intercepted and recorded (hence the name). This recording is then used to generate bytecode that performs the same sequence of invocations at runtime. This is essentially a form of deferred execution where invocations made at deployment time get deferred until runtime.
pt_br: Como escrever bytecode diretamente é complexo, isso é feito por meio de gravadores de bytecode. No momento da implantação, as invocações são feitas em objetos gravadores que contêm a lógica real do tempo de execução, mas, em vez de essas invocações prosseguirem normalmente, elas são interceptadas e gravadas (daí o nome). Essa gravação é então usada para gerar bytecode que executa a mesma sequência de invocações no tempo de execução. Essencialmente, essa é uma forma de execução diferida em que as invocações feitas no momento da implantação são adiadas até o tempo de execução.

source: Let's look at the classic 'Hello World' type example. To do this the Quarkus way we would create a recorder as follows:
pt_br: Vejamos o exemplo clássico do tipo 'Olá Mundo'. Para fazer isto à maneira do Quarkus, criaríamos um gravador como se segue:

source: And then create a build step that uses this recorder:
pt_br: E, em seguida, criaríamos um passo de construção que utilize este gravador:

source: When this build step is run nothing is printed to the console. This is because the `HelloRecorder` that is injected is actually a proxy that records all invocations. Instead, if we run the resulting Quarkus program we will see 'Hello World' printed to the console.
pt_br: Quando essa etapa de construção é executada, nada é impresso no console. Isso ocorre porque o `HelloRecorder` que é injetado é, na verdade, um proxy que registra todas as invocações. Em vez disso, se executarmos o programa Quarkus resultante, veremos "Hello World" impresso no console.

source: Methods on a recorder can return a value, which must be proxiable (if you want to return a non-proxiable item wrap it in `io.quarkus.runtime.RuntimeValue`). These proxies may not be invoked directly, however they can be passed into other recorder methods. This can be any recorder method, including from other `@BuildStep` methods, so a common pattern is to produce `BuildItem` instances that wrap the results of these recorder invocations.
pt_br: Os métodos em um gravador podem retornar um valor, que deve ser proxiable (se você quiser retornar um item não proxiable, envolva-o em `io.quarkus.runtime.RuntimeValue` ). Esses proxies não podem ser invocados diretamente, mas podem ser passados para outros métodos do gravador. Esse pode ser qualquer método de gravador, inclusive de outros métodos `@BuildStep`, portanto, um padrão comum é produzir instâncias `BuildItem` que envolvam os resultados dessas invocações de gravadores.

source: For instance, in order to make arbitrary changes to a Servlet deployment Undertow has a `ServletExtensionBuildItem`, which is a `MultiBuildItem` that wraps a `ServletExtension` instance. I can return a `ServletExtension` from a recorder in another module, and Undertow will consume it and pass it into the recorder method that starts Undertow.
pt_br: Por exemplo, para fazer alterações arbitrárias em uma implantação de Servlet, o Undertow tem um `ServletExtensionBuildItem` , que é um `MultiBuildItem` que envolve uma instância de `ServletExtension` . Posso retornar um `ServletExtension` de um gravador em outro módulo, e o Undertow o consumirá e o passará para o método do gravador que inicia o Undertow.

source: At runtime the bytecode will be invoked in the order it is generated. This means that build step dependencies implicitly control the order that generated bytecode is run. In the example above we know that the bytecode that produces a `ServletExtensionBuildItem` will be run before the bytecode that consumes it.
pt_br: No tempo de execução, o bytecode será chamado na ordem em que foi gerado. Isso significa que as dependências da etapa de construção controlam implicitamente a ordem em que o bytecode gerado é executado. No exemplo acima, sabemos que o bytecode que produz um `ServletExtensionBuildItem` será executado antes do bytecode que o consome.

source: The following objects can be passed to recorders:
pt_br: Os seguintes objetos podem ser passados aos gravadores:

source: Primitives
pt_br: Primitivos

source: Class<?> objects
pt_br: Objetos Class<?>

source: Objects returned from a previous recorder invocation
pt_br: Objetos retornados de uma invocação anterior do gravador

source: Objects with a no-arg constructor and getter/setters for all properties (or public fields)
pt_br: Objetos com um construtor sem argumentos e getter/setters para todas as propriedades (ou campos públicos)

source: Objects with a constructor annotated with `@RecordableConstructor` with parameter names that match field names
pt_br: Objetos com um construtor anotado com `@RecordableConstructor` com nomes de parâmetros que correspondem a nomes de campos

source: Any arbitrary object via the `io.quarkus.deployment.recording.RecorderContext#registerSubstitution(Class, Class, Class)` mechanism
pt_br: Qualquer objeto arbitrário através do mecanismo `io.quarkus.deployment.recording.RecorderContext#registerSubstitution(Class, Class, Class)`

source: Arrays, Lists and Maps of the above
pt_br: Vetores, Listas e Mapas dos elementos acima

source: In cases where some fields of an object to be recorded should be ignored (i.e. the value that being at build time should not be reflected at runtime), the `@IgnoreProperty` can be placed on the field.
pt_br: Nos casos em que alguns campos de um objeto a ser gravado devam ser ignorados (ou seja, o valor que será construído não deve ser refletido em tempo de execução), o `@IgnoreProperty` pode ser colocado no campo.

source: If the class cannot depend on Quarkus, then Quarkus can use any custom annotation, as long as the extension implements the `io.quarkus.deployment.recording.RecordingAnnotationsProvider` SPI.
pt_br: Se a classe não puder depender do Quarkus, o Quarkus pode utilizar qualquer anotação personalizada, desde que a extensão implemente o SPI `io.quarkus.deployment.recording.RecordingAnnotationsProvider`.

source: This same SPI can also be used to provide a custom annotation that will substitute for `@RecordableConstructor`.
pt_br: Este mesmo SPI também pode ser utilizado para fornecer uma anotação personalizada que substituirá `@RecordableConstructor`.

source: Injecting Configuration into Recorders
pt_br: Injetando Configuração nos Gravadores

source: `io.quarkus.deployment.recording.RecorderContext` provides some convenience methods to enhance bytecode recording, this includes the ability to register creation functions for classes without no-arg constructors, to register an object substitution (basically a transformer from a non-serializable object to a serializable one and vice versa), and to create a class proxy. This interface can be directly injected as a method parameter into any `@Record` method.
pt_br: `io.quarkus.deployment.recording.RecorderContext` fornece alguns métodos de conveniência para aprimorar a gravação de bytecode, o que inclui a capacidade de registrar funções de criação para classes sem construtores sem argumento, registrar uma substituição de objeto (basicamente um transformador de um objeto não serializável para um serializável e vice-versa) e criar um proxy de classe. Essa interface pode ser injetada diretamente como um parâmetro de método em qualquer método `@Record`.

source: Calling `classProxy` with a given fully-qualified class name will create a `Class` instance that can be passed into a recorder method, and at runtime will be substituted with the class whose name was passed in to `classProxy()`. However, this method should not be needed in most use cases because directly loading deployment/application classes at processing time in build steps is safe. Therefore, this method is deprecated. Nonetheless, there are some use cases where this method comes in handy, such as referring to classes that were generated in previous build steps using `GeneratedClassBuildItem`.
pt_br: Chamar `classProxy` com um determinado nome de classe totalmente qualificado criará uma instância de `Class` que pode ser passada para um método de gravador e, no tempo de execução, será substituída pela classe cujo nome foi passado para `classProxy()` . No entanto, esse método não deve ser necessário na maioria dos casos de uso, pois é seguro carregar diretamente as classes de implantação/aplicação no tempo de processamento nas etapas de construção. Portanto, esse método está obsoleto. No entanto, há alguns casos de uso em que esse método é útil, como a referência a classes que foram geradas em etapas de construção anteriores usando `GeneratedClassBuildItem` .

source: Printing step execution time
pt_br: Imprimindo o tempo de execução da etapa

source: At times, it can be useful to know how the exact time each startup task (which is the result of each bytecode recording) takes when the application is run. The simplest way to determine this information is to launch the Quarkus application with the `-Dquarkus.debug.print-startup-times=true` system property. The output will look something like:
pt_br: Às vezes, pode ser útil saber o tempo exato que cada tarefa de inicialização (que é o resultado de cada gravação de bytecode) leva quando a aplicação é executada. A maneira mais simples de determinar essas informações é iniciar o aplicativo Quarkus com a propriedade de sistema `-Dquarkus.debug.print-startup-times=true`. O resultado será algo parecido com:

source: Runtime Classpath check
pt_br: Verificação do Classpath de Tempo de Execução

source: Extensions often need a way to determine whether a given class is part of the application's runtime classpath. The proper way for an extension to perform this check is to use `io.quarkus.bootstrap.classloading.QuarkusClassLoader.isClassPresentAtRuntime`.
pt_br: As extensões geralmente precisam de uma maneira de determinar se uma classe faz parte do classpath de tempo de execução da aplicação. A maneira correta de uma extensão realizar essa verificação é usar `io.quarkus.bootstrap.classloading.QuarkusClassLoader.isClassPresentAtRuntime` .

source: Contexts and Dependency Injection
pt_br: Contextos e Injeção de Dependência

source: Extension Points
pt_br: Pontos de Extensão

source: As a CDI based runtime, Quarkus extensions often make CDI beans available as part of the extension behavior. However, Quarkus DI solution does not support CDI Portable Extensions. Instead, Quarkus extensions can make use of various xref:cdi-reference.adoc[Build Time Extension Points].
pt_br: Como um tempo de execução baseado em CDI, as extensões do Quarkus geralmente disponibilizam beans CDI como parte do comportamento da extensão. No entanto, a solução de DI do Quarkus não suporta Extensões Portáteis CDI. Em vez disso, as extensões do Quarkus podem fazer uso de vários xref:cdi-reference.adoc[Pontos de Extensão de Tempo de Construção].

source: Extension-defined endpoints
pt_br: Endpoints definidos pela extensão

source: Your extension can add additional, non-application endpoints to be served alongside endpoints for Health, Metrics, OpenAPI, Swagger UI, etc.
pt_br: Sua extensão pode adicionar endpoints adicionais que não sejam de aplicações para serem servidos juntamente com endpoints para Health, Metrics, OpenAPI, Swagger UI, etc.

source: Use a `NonApplicationRootPathBuildItem` to define an endpoint:
pt_br: Use um `NonApplicationRootPathBuildItem` para definir um endpoint:

source: Note that the path above does not start with a '/', indicating it is a relative path. The above endpoint will be served relative to the configured non-application endpoint root. The non-application endpoint root is `/q` by default, which means the resulting endpoint will be found at `/q/custom-endpoint`.
pt_br: Observe que o caminho acima não começa com um '/', o que indica que é um caminho relativo. O endpoint acima será servido em relação à raiz configurada do endpoint sem aplicação. A raiz do endpoint que não é de aplicação é `/q` por padrão, o que significa que o endpoint resultante será encontrado em `/q/custom-endpoint`.

source: Absolute paths are handled differently. If the above called `route("/custom-endpoint")`, the resulting endpoint will be found at `/custom-endpoint`.
pt_br: Os caminhos absolutos são tratados de forma diferente. Se o acima chamou `route("/custom-endpoint")`, o endpoint resultante será encontrado em `/custom-endpoint` .

source: If an extension needs nested non-application endpoints:
pt_br: Se uma extensão precisar de endpoints não relacionados com a aplicação aninhados:
