Repository: quarkusio/pt.quarkus.io
Catalog: l10n/po/*/_versions/3.20/guides/cli-tooling.adoc.po
Languages: pt_br

source: For instance, let's use `io.quarkiverse.authzed:quarkus-authzed-cli:runner:jar:0.2.0` which is a real executable jar that provides a CLI utility for the `quarkus-authzed` extension.
pt_br: Por exemplo, vamos usar `io.quarkiverse.authzed:quarkus-authzed-cli:runner:jar:0.2.0`, que é um jar executável real que fornece um recurso CLI para a extensão `quarkus-authzed`.

source: It is also possible to set a description that will appear in the help output.
pt_br: É possível também definir uma descrição que será exibida na saída do `help`.

source: Where are the plugins added?
pt_br: Onde os plugins são instalados?

source: Removing plugins
pt_br: Removendo plugins

source: Syncing plugins
pt_br: Sincronizando plugins

source: To remove stale plugins or discover new plugins provided by extensions, the `quarkus plugin sync` command is available. With this command binaries and JBang aliases that are added to the catalog but are no longer available will be purged.
pt_br: Para remover plugins obsoletos ou descobrir novos plugins fornecidos por extensões, está disponível o comando `quarkus plugin sync`. Com este comando, os binários e atalhos do JBang adicionados ao catálogo, mas que não estão mais disponíveis, serão eliminados.

source: Remote plugins that are explicitly added by the user using URL/Maven coordinates are excluded from the removal.
pt_br: Os plugins remotos que são explicitamente adicionados pelo usuário usando URL/coordenadas Maven são excluídos da remoção.

source: Weekly
pt_br: Semanalmente

source: If the project files have been updated since the last catalog update (limited to the module).
pt_br: Se os arquivos do projeto tiverem sido atualizados desde a última atualização do catálogo (limitado ao módulo).
