Repository: quarkusio/pt.quarkus.io
Catalog: l10n/po/*/_versions/3.20/guides/lra.adoc.po
Languages: pt_br

source: Narayana LRA Participant Support
pt_br: Apoio ao Participante do Narayana LRA

source: Introduction
pt_br: Introdução

source: The LRA (short for Long Running Action) participant extension is useful in microservice based designs where different services can benefit from a relaxed notion of distributed consistency.
pt_br: A extensão do participante LRA (abreviação de Long Running Action) é útil em projetos baseados em microsserviços, nos quais diferentes serviços podem se beneficiar de uma noção relaxada de consistência distribuída.

source: The idea is for multiple services to perform different computations/actions in concert, whilst retaining the option to compensate for any actions performed during the computation. This kind of loose coupling of services bridges the gap between strong consistency models such as JTA/XA and "home-grown" ad hoc consistency solutions.
pt_br: A ideia é que vários serviços executem diferentes cálculos/ações em conjunto, mantendo a opção de compensar quaisquer ações executadas durante o cálculo. Esse tipo de acoplamento frouxo de serviços preenche a lacuna entre modelos de consistência fortes, como JTA/XA, e soluções de consistência ad hoc "caseiras".

source: The model is based on the https://github.com/eclipse/microprofile-lra/blob/master/spec/src/main/asciidoc/microprofile-lra-spec.asciidoc[Eclipse MicroProfile LRA specification]. The approach is for the developer to annotate a business method with a Java annotation (https://download.eclipse.org/microprofile/microprofile-lra-1.0/apidocs/[`@LRA`]). When such a method is called, an LRA context is created (if one is not already present) which is passed along with subsequent Jakarta REST invocations until a method is reached which also contains an `@LRA` annotation with an attribute that indicates that the LRA should be closed or cancelled. The default is for the LRA to be closed in the same method that started the LRA (which itself may have propagated the context during method execution). The Jakarta REST resource indicates that it wishes to participate in the interaction by, minimally, marking one of the methods with an https://download.eclipse.org/microprofile/microprofile-lra-1.0/apidocs/[`@Compensate`] annotation. If the context is later cancelled, then this `@Compensate` action is guaranteed to be called even in the presence of failures and is the trigger for the resource to compensate for any activities it performed in the context of the LRA. This guarantee enables services to operate reliably with the assurance of eventual consistency (when all compensation activities have ran to completion). The participant can ask to be reliably notified when the LRA it is participating in is closed by marking one of the methods with an https://download.eclipse.org/microprofile/microprofile-lra-1.0/apidocs/[`@Complete`] annotation. In this way cancelling an LRA causes all participants to be notified via their Compensate callback and closing an LRA causes all participants to be notified via their Complete callback (if they have one). Other annotations for controlling participants are documented in the https://download.eclipse.org/microprofile/microprofile-lra-1.0/apidocs/[MicroProfile LRA API v1.0 javadoc].
pt_br: O modelo baseia-se no link:https://github.com/eclipse/microprofile-lra/blob/master/spec/src/main/asciidoc/microprofile-lra-spec.asciidoc[especificação do Eclipse MicroProfile LRA] . A abordagem é que o desenvolvedor anote um método de negócios com uma anotação Java ( link:https://download.eclipse.org/microprofile/microprofile-lra-1.0/apidocs/[@LRA] ). Quando esse método é chamado, é criado um contexto de LRA (se ainda não houver um), que é transmitido junto com as invocações subsequentes do Jakarta REST até que seja alcançado um método que também contenha uma anotação `@LRA` com um atributo que indique que o LRA deve ser fechado ou cancelado. O padrão é que o LRA seja fechado no mesmo método que iniciou o LRA (que pode ter propagado o contexto durante a execução do método). O recurso Jakarta REST indica que deseja participar da interação, no mínimo, marcando um dos métodos com uma anotação link:https://download.eclipse.org/microprofile/microprofile-lra-1.0/apidocs/[@Compensate] . Se o contexto for cancelado posteriormente, essa ação `@Compensate` tem a garantia de ser chamada mesmo na presença de falhas e é o gatilho para o recurso compensar todas as atividades realizadas no contexto do LRA. Essa garantia permite que os serviços operem de forma confiável com a garantia de consistência eventual (quando todas as atividades de compensação tiverem sido concluídas). O participante pode pedir para ser notificado de forma confiável quando o LRA do qual está participando for encerrado, marcando um dos métodos com uma anotação link:https://download.eclipse.org/microprofile/microprofile-lra-1.0/apidocs/[@Complete] . Dessa forma, o cancelamento de um LRA faz com que todos os participantes sejam notificados por meio de sua chamada de retorno Compensar e o fechamento de um LRA faz com que todos os participantes sejam notificados por meio de sua chamada de retorno Concluir (se houver). Outras anotações para controle de participantes estão documentadas no link:https://download.eclipse.org/microprofile/microprofile-lra-1.0/apidocs/[javadoc da API MicroProfile LRA v1.0] .

source: Configuration
pt_br: Configuração

source: Once you have your Quarkus Maven project configured you can add the `narayana-lra` extension by running the following command in your project base directory:
pt_br: Depois de configurar o seu projeto Quarkus Maven, é possível adicionar a extensão `narayana-lra` executando o seguinte comando no diretório base do seu projeto:

source: This will add the following to your build file:
pt_br: Isto irá adicionar a seguinte dependência ao seu arquivo de build:

source: `quarkus-narayana-lra` needs to be complemented with a server Jakarta REST implementation and a REST Client implementation in order to work. This means that users should also have either `quarkus-resteasy-jackson` and `quarkus-resteasy-client-jackson` or `quarkus-rest-jackson` and `quarkus-rest-client-jackson` dependencies in their application.
pt_br: `quarkus-narayana-lra` precisa ser complementado com uma implementação de servidor Jakarta REST e uma implementação de cliente REST para funcionar. Isso significa que os usuários também deveriam ter as dependências `quarkus-resteasy-jackson` e `quarkus-resteasy-client-jackson` ou `quarkus-rest-jackson` e `quarkus-rest-client-jackson` em seus aplicativos.

source: If there is a running coordinator then this is all you need in order to create new LRAs and to enlist participants with them.
pt_br: Se exitir um coordenador em execução, então isto é tudo o que você precisa para criar novas LRAs e alistar participantes nelas.

source: The LRA extension can be configured by updating an `application.properties` file in the `src/main/resources` directory. The only LRA specific property is `quarkus.lra.coordinator-url=<url>` which specifies the HTTP endpoint of an external coordinator, for example:
pt_br: A extensão LRA pode ser configurada atualizando um arquivo `application.properties` no diretório `src/main/resources` . A única propriedade específica do LRA é `quarkus.lra.coordinator-url=<url>` , que especifica o ponto de extremidade HTTP de um coordenador externo, por exemplo:

source: For a Narayana coordinator the path component of the url is normally `lra-coordinator`. Coordinators can be obtained from https://quay.io/repository/jbosstm/lra-coordinator or you can build your own coordinator using a maven pom that includes the appropriate dependencies. A Quarkus quickstart will be provided to show how to do this, or you can take a look at one of the https://github.com/jbosstm/quickstart/tree/master/rts/lra-examples/lra-coordinator[Narayana quickstarts]. Another option would be to run it managed inside a WildFly application server.
pt_br: Para um coordenador Narayana, o componente de caminho da url é normalmente `lra-coordinator` . Os coordenadores podem ser obtidos em https://quay.io/repository/jbosstm/lra-coordinator ou você pode criar seu próprio coordenador usando um maven pom que inclua as dependências apropriadas. Um quickstart do Quarkus será fornecido para mostrar como fazer isso, ou você pode dar uma olhada em um dos link:https://github.com/jbosstm/quickstart/tree/master/rts/lra-examples/lra-coordinator[quickstarts do Narayana] . Outra opção seria executá-lo gerenciado dentro de um servidor de aplicativos WildFly.

source: Handling failures
pt_br: Manuseio de falhas

source: When an LRA is told to finish, i.e. when a method annotated with `@LRA(end = true, ...)` is invoked, the coordinator will instruct all services involved in the interaction to finish. If a service is unavailable (or still finishing) then the coordinator will retry periodically. It is the user's responsibility to restart failed services on the same endpoint that they used when they first joined the LRA, or to tell the coordinator that they wish to be notified on new endpoints. An LRA is not deemed finished until *all* participants have acknowledged that they have finished.
pt_br: Quando uma LRA é instruída a finalizar, ou seja, quando um método anotado com @LRA(end = true, ...) é invocado, o coordenador instruirá todos os serviços envolvidos na interação a finalizar. Se um serviço estiver indisponível (ou ainda finalizando), o coordenador tentará novamente periodicamente. É responsabilidade do usuário reiniciar os serviços com falha no mesmo ponto de extremidade que usaram quando se juntaram à LRA pela primeira vez, ou informar ao coordenador que desejam ser notificados em novos pontos de extremidade. Uma LRA não é considerada finalizada até que todos os participantes tenham confirmado que finalizaram.

source: The coordinator is responsible for reliably creating and ending LRAs and for managing participant enlistment, and it therefore must be available (for example if it or the network fail then something in the environment is responsible for restarting the coordinator or for repairing the network, respectively). To fulfill this task the coordinator must have access to durable storage for its logs (via a filesystem or in a database). At the time of writing, managing coordinators is the responsibility of the user. An "out-of-the-box" solution will be forthcoming.
pt_br: O coordenador é responsável por criar e finalizar LRAs de forma confiável e por gerenciar o de participantes e, portanto, deve estar disponível (por exemplo, se ele ou a rede falharem, algo no ambiente será responsável por reiniciar o coordenador ou por reparar a rede, respectivamente). Para cumprir essa tarefa, o coordenador deve ter acesso a um armazenamento durável para seus registros (por meio de um sistema de arquivos ou em um banco de dados). No momento em que este artigo foi escrito, o gerenciamento de coordenadores é responsabilidade do usuário. Uma solução "pronta para uso" será apresentada em breve.

source: Examples
pt_br: Exemplos

source: The following is a simple example of how to start an LRA and how to receive a notification when the LRA is later cancelled (the `@Compensate` annotated method is called) or closed (`@Complete` is called):
pt_br: A seguir, um exemplo simples de como iniciar um LRA e como receber uma notificação quando o LRA for cancelado posteriormente (o método anotado `@Compensate` é chamado) ou fechado ( `@Complete` é chamado):

source: The example also shows that when an LRA is present its identifier can be obtained by reading the request headers via the `@HeaderParam` Jakarta REST annotation type.
pt_br: O exemplo também mostra que, quando um LRA está presente, seu identificador pode ser obtido pela leitura dos cabeçalhos da solicitação por meio do tipo de anotação `@HeaderParam` Jakarta REST.

source: And here's an example of how to start an LRA in one resource method and close it in a different resource method using the `end` element of the `LRA` annotation. It also shows how to configure the LRA to be automatically cancelled if the business method returns the particular HTTP status codes identified in the `cancelOn` and `cancelOnFamily` elements:
pt_br: E aqui está um exemplo de como iniciar um LRA em um método de recurso e fechá-lo em um método de recurso diferente usando o elemento `end` da anotação `LRA` . Ele também mostra como configurar o LRA para ser cancelado automaticamente se o método de negócios retornar os códigos de status HTTP específicos identificados nos elementos `cancelOn` e `cancelOnFamily` :

source: The `end = false` element on the bookTrip method forces the LRA to continue running when the method finishes and the `end = true` element on the confirmTrip method forces the LRA (started by the bookTrip method) to be closed when the method finishes. Note that this end element can be placed on any Jakarta REST resource (ie one service can start the LRA whilst a different service ends it). There are many more examples in the https://github.com/eclipse/microprofile-lra/blob/master/spec/src/main/asciidoc/microprofile-lra-spec.asciidoc#java-annotations-for-lras[Microprofile LRA specification document] and in the https://github.com/eclipse/microprofile-lra/tree/master/tck/src/main/java/org/eclipse/microprofile/lra/tck[Microprofile LRA TCK].
pt_br: O elemento `end = false` no método bookTrip força o LRA a continuar em execução quando o método termina e o elemento `end = true` no método confirmTrip força o LRA (iniciado pelo método bookTrip) a ser fechado quando o método termina. Observe que esse elemento final pode ser colocado em qualquer recurso Jakarta REST (ou seja, um serviço pode iniciar o LRA enquanto outro serviço diferente o encerra). Há muitos outros exemplos no link:https://github.com/eclipse/microprofile-lra/blob/master/spec/src/main/asciidoc/microprofile-lra-spec.asciidoc#java-annotations-for-lras[documento de especificação do Microprofile LRA] e no link:https://github.com/eclipse/microprofile-lra/tree/master/tck/src/main/java/org/eclipse/microprofile/lra/tck[Microprofile LRA TCK] .
