Repository: quarkusio/pt.quarkus.io
Catalog: l10n/po/*/_versions/3.20/guides/security-basic-authentication-howto.adoc.po
Languages: pt_br

source: Enable Basic authentication
pt_br: Ativar a autenticação básica

source: Enable xref:security-basic-authentication.adoc[Basic authentication] for your Quarkus project and allow users to authenticate with a username and password.
pt_br: Ative link:security-basic-authentication.html[a autenticação básica] para o seu projeto Quarkus e permita que os usuários se autentiquem com um username e um password.

source: Prerequisites
pt_br: Pré-requisitos

source: You have installed at least one extension that provides an `IdentityProvider` based on username and password. For example:
pt_br: Você instalou pelo menos uma extensão que fornece um `IdentityProvider` baseado no nome de usuário e senha. Por exemplo:

source: The following procedure outlines how you can enable Basic authentication for your application by using the `elytron-security-properties-file` extension.
pt_br: O procedimento a seguir descreve como você pode habilitar a autenticação básica para a sua aplicação usando a extensão `elytron-security-properties-file` .

source: Procedure
pt_br: Procedimento

source: In the `application.properties` file, set the `quarkus.http.auth.basic` property to `true`.
pt_br: No arquivo `application.properties`, defina a propriedade `quarkus.http.auth.basic` como `true`.

source: **Optional:** In a non-production environment only and purely for testing Quarkus Security in your applications:
pt_br: **Opcional:** Apenas em um ambiente que não seja de produção, e exclusivamente para testar o _Quarkus Security_ em suas aplicações:

source: To enable authentication for the embedded realm, set the `quarkus.security.users.embedded.enabled` property to `true`.
pt_br: Para habilitar a autenticação para o _embedded realm_, defina a propriedade `quarkus.security.users.embedded.enabled` como `true`.

source: You can also configure the required user credentials, user name, secret, and roles. For example:
pt_br: Você também pode configurar as credenciais de usuário, nome de usuário, _secret_ e as funções necessárias. Por exemplo:

source: The user, `alice`, has `alice` as their password and `admin` as their role.
pt_br: O usuário, `alice`, tem `alice` como password e `admin` como role.

source: The user, `bob`, has `bob` as their password and `user` as their role.
pt_br: O usuário, `bob`, tem `bob` como senha e `user` como role.

source: For information about other methods that you can use to configure the required user credentials, see the xref:security-testing.adoc#configuring-user-information[Configuring User Information] section of the Quarkus "Security Testing" guide.
pt_br: Para obter informações sobre outros métodos que você pode utilizar para configurar as credenciais de usuário necessárias, consulte a seção link:security-testing.html#configuring-user-information[Configurar as informações do usuario] do guia "Teste de segurança" do Quarkus.

source: Configuring user names, secrets, and roles in the `application.properties` file is appropriate only for testing scenarios. For securing a production application, it is crucial to use a database to store this information.
pt_br: Configurar nomes de usuário, _secrets_ e funções no arquivo `application.properties` é apropriado apenas para cenários de teste. Para proteger uma aplicação em produção, é crucial usar um banco de dados para armazenar essas informações.

source: Next steps
pt_br: Próximas etapas

source: For a more detailed walk-through that shows you how to configure Basic authentication together with Jakarta Persistence for storing user credentials in a database, see the xref:security-getting-started-tutorial.adoc[Getting started with Security by using Basic authentication and Jakarta Persistence] guide.
pt_br: Para um passo a passo mais detalhado que mostre como configurar a autenticação básica junto com o _Jakarta Persistence_ para armazenar credenciais de usuário em um banco de dados, consulte o guia xref:security-getting-started-tutorial.adoc[Começando com Segurança usando autenticação básica e _Jakarta Persistence_].

source: References
pt_br: Referências

source: xref:security-overview.adoc[Quarkus Security overview]
pt_br: xref:security-overview.adoc[Visão geral do Quarkus Security]

source: xref:security-identity-providers.adoc[Identity Providers]
pt_br: xref:security-identity-providers.adoc[Fornecedores de identidade]

source: xref:security-testing.adoc#configuring-user-information[Configuring User Information in application.properties]
pt_br: xref:security-testing.adoc#configuring-user-information[Configurar as informações do usuário no application.properties]

source: xref:security-basic-authentication.adoc[Basic authentication]
pt_br: xref:security-basic-authentication.adoc[Autenticação básica]
