Repository: quarkusio/pt.quarkus.io
Catalog: l10n/po/*/_versions/3.20/guides/security-oidc-configuration-properties-reference.adoc.po
Languages: pt_br

source: OpenID Connect (OIDC) configuration properties
pt_br: Propriedades de configuração do OpenID Connect (OIDC)

source: As a Quarkus developer, you configure the Quarkus OpenID Connect (OIDC) extension by setting the following properties in the `src/main/resources/application.properties` file.
pt_br: Como programador do Quarkus, você configura a extensão Quarkus OpenID Connect (OIDC) definindo as seguintes propriedades no diretório `src/main/resources/application.properties`.

source: <span class="icon"><i class="fa fa-lock" title="Fixed at build time"></i></span> Configuration property fixed at build time - All other configuration properties are overridable at runtime <input type="search" id="config-search-0" placeholder="FILTER CONFIGURATION" disabled>
pt_br: <span class="icon"><i class="fa fa-lock" title="Fixed at build time"></i></span> Propriedade de Configuração Fixa no Momento da Compilação - Todas as outras propriedades de configuração podem ser sobrepostas em tempo de execução. <input type="search" id="config-search-0" placeholder="FILTER CONFIGURATION" disabled>

source: References
pt_br: Referências

source: xref:security-oidc-bearer-token-authentication.adoc[OIDC Bearer token authentication]
pt_br: link:security-oidc-bearer-token-authentication.html[Autenticação de Token Bearer OIDC]

source: xref:security-oidc-bearer-token-authentication-tutorial.adoc[Protect a service application by using OpenID Connect (OIDC) Bearer token authentication]
pt_br: link:security-oidc-bearer-token-authentication-tutorial.html[Proteger uma aplicação de serviço usando a autenticação de token Bearer OpenID Connect (OIDC)]

source: xref:security-openid-connect-client-reference.adoc[OpenID Connect and OAuth2 Client and Filters Reference Guide]
pt_br: link:security-openid-connect-client-reference.html[Guia de referência para OpenID Connect e OAuth2: Client e Filters]

source: xref:security-authentication-mechanisms.adoc#oidc-jwt-oauth2-comparison[Choosing between OpenID Connect, SmallRye JWT, and OAuth2 authentication mechanisms]
pt_br: link:security-authentication-mechanisms.html#oidc-jwt-oauth2-comparison[Escolhendo entre os mecanismos de autenticação OpenID Connect, SmallRye JWT e OAuth2]

source: xref:security-authentication-mechanisms.adoc#combining-authentication-mechanisms[Combining authentication mechanisms]
pt_br: link:security-authentication-mechanisms.html#combining-authentication-mechanisms[Combinando de mecanismos de autenticação]

source: xref:security-overview.adoc[Quarkus Security]
pt_br: link:security-overview.html[Quarkus Security]
