Repository: quarkusio/pt.quarkus.io
Catalog: l10n/po/*/_versions/3.6/guides/context-propagation.adoc.po
Languages: pt_br

source: Context Propagation in Quarkus
pt_br: Propagação de Contexto no Quarkus

source: If you write reactive/async code, you have to cut your work into a pipeline of code blocks that get executed "later", and in practice after the method you defined them in have returned. As such, `try/finally` blocks as well as `ThreadLocal` variables stop working, because your reactive code gets executed in another thread, after the caller ran its `finally` block.
pt_br: Se você escrever código reativo/assíncrono, terá de dividir seu trabalho em um pipeline de blocos de código que serão executados "mais tarde" e, na prática, após o retorno do método em que você os definiu. Dessa forma, os blocos `try/finally` e as variáveis `ThreadLocal` param de funcionar, porque o código reativo é executado em outro thread, depois que o chamador executou o bloco `finally`.

source: link:https://github.com/smallrye/smallrye-context-propagation[SmallRye Context Propagation] an implementation of link:https://github.com/eclipse/microprofile-context-propagation[MicroProfile Context Propagation] was made to make those Quarkus extensions work properly in reactive/async settings. It works by capturing those contextual values that used to be in thread-locals, and restoring them when your code is called.
pt_br: A link:https://github.com/smallrye/smallrye-context-propagation[Propagação de Contexto do SmallRye], uma implementação da link:https://github.com/eclipse/microprofile-context-propagation[Propagação de Contexto do MicroProfile], foi criada para fazer com que essas extensões do Quarkus funcionem corretamente em configurações reativas/assíncronas. Ela funciona capturando os valores contextuais que costumavam estar em contextos locais de thread e os restaurando quando o código é chamado.

source: Solution
pt_br: Solução

source: We recommend that you follow the instructions in the next sections and create the application step by step. However, you can go right to the completed example.
pt_br: Recomendamos que siga as instruções nas seções seguintes e crie a aplicação passo a passo. No entanto, você pode ir diretamente para o exemplo completo.

source: Clone the Git repository: `git clone {quickstarts-clone-url}`, or download an {quickstarts-archive-url}[archive].
pt_br: Clone o repositório Git: `git clone {quickstarts-clone-url}`, ou baixe um {quickstarts-archive-url}[arquivo].

source: The solution is located in the `context-propagation-quickstart` link:{quickstarts-tree-url}/context-propagation-quickstart[directory].
pt_br: A solução está localizada no link:{quickstarts-tree-url}/context-propagation-quickstart[diretório] `context-propagation-quickstart`.

source: Setting it up
pt_br: Configuração

source: If you are using link:https://smallrye.io/smallrye-mutiny[Mutiny] (the `quarkus-mutiny` extension), you just need to add the `quarkus-smallrye-context-propagation` extension to enable context propagation.
pt_br: Se você estiver usando o link:https://smallrye.io/smallrye-mutiny[Mutiny] (a extensão `quarkus-mutiny`), basta adicionar a extensão `quarkus-smallrye-context-propagation` para ativar a propagação de contexto.

source: In other words, add the following dependencies to your build file:
pt_br: Em outras palavras, adicione as seguintes dependências ao seu arquivo de construção:

source: With this, you will get context propagation for ArC, RESTEasy Reactive and transactions, if you are using them.
pt_br: Com isso, você terá propagação de contexto para ArC, RESTEasy Reativo e transações, se estiver usando-os.

source: Usage example with Mutiny
pt_br: Exemplo de uso com Mutiny

source: This section uses Mutiny reactive types. If you are not familiar with Mutiny, check xref:mutiny-primer.adoc[Mutiny - an intuitive reactive programming library].
pt_br: Esta seção usa os tipos reativos do Mutiny. Se você não estiver familiarizado com o Mutiny, consulte xref:mutiny-primer.adoc[Mutiny - uma biblioteca de programação reativa intuitiva].

source: Let's write a REST endpoint that reads the next 3 items from a xref:kafka.adoc[Kafka topic], stores them in a database using xref:hibernate-orm-panache.adoc[Hibernate ORM with Panache] (all in the same transaction) before returning them to the client, you can do it like this:
pt_br: Vamos escrever um endpoint REST que leia os próximos 3 itens de um xref:kafka.adoc[tópico do Kafka], armazene-os em um banco de dados usando o xref:hibernate-orm-panache.adoc[Hibernate ORM com Panache] (tudo na mesma transação) antes de devolvê-los ao cliente:

source: Notice that thanks to Mutiny support for context propagation, this works out of the box. The 3 items are persisted using the same transaction and this transaction is committed when the stream completes.
pt_br: Observe que, graças ao suporte do Mutiny para propagação de contexto, isso funciona imediatamente. Os três itens são mantidos usando a mesma transação e essa transação é confirmada quando o fluxo é concluído.

source: Usage example for `CompletionStage`
pt_br: Exemplo de uso para `CompletionStage`

source: Using `ThreadContext` or `ManagedExecutor` you can wrap most useful functional types and `CompletionStage` in order to get context propagated.
pt_br: Usando `ThreadContext` ou `ManagedExecutor`, você pode envolver os tipos funcionais mais úteis e `CompletionStage` para que o contexto seja propagado.

source: The injected `ManagedExecutor` uses the Quarkus thread pool.
pt_br: O site `ManagedExecutor` injetado usa o pool de threads do Quarkus.

source: Overriding which contexts are propagated
pt_br: Sobrescrevendo quais contextos são propagados

source: By default, all available contexts are propagated. However, you can override this behaviour in several ways.
pt_br: Por padrão, todos os contextos disponíveis são propagados. No entanto, você pode sobrescrever esse comportamento de várias maneiras.

source: Using configuration
pt_br: Usando a configuração

source: The following configuration properties allow you to specify the default sets of propagated contexts:
pt_br: As propriedades de configuração a seguir permitem que você especifique os conjuntos padrão de contextos propagados:

source: Description
pt_br: Descrição

source: Default Value
pt_br: Valor padrão

source: The comma-separated set of propagated contexts
pt_br: O conjunto de contextos propagados, separado por vírgulas

source: `Remaining` (all non-explicitly list contexts)
pt_br: `Remaining` (todos os contextos de lista não explícita)

source: The comma-separated set of cleared contexts
pt_br: O conjunto de contextos liberados separados por vírgulas

source: `None` (no context), unless neither the propagated nor cleared sets contain `Remaining`, in which case the default is `Remaining` (all non-explicitly listed contexts)
pt_br: `None` (sem contexto), a menos que nem os conjuntos propagados nem os limpos contenham `Remaining`, caso em que o padrão é `Remaining` (todos os contextos não listados explicitamente)

source: The comma-separated set of unchanged contexts
pt_br: O conjunto de contextos inalterados, separado por vírgulas

source: `None` (no context)
pt_br: `None` (sem contexto)

source: The following contexts are available in Quarkus either out of the box, or depending on whether you include their extensions:
pt_br: Os contextos a seguir estão disponíveis no Quarkus imediatamente ou dependendo da inclusão de suas extensões:

source: Context Name
pt_br: Nome do Contexto

source: Name Constant
pt_br: Nome Constante

source: Can be used to specify an empty set of contexts, but setting the value to empty works too
pt_br: Pode ser usado para especificar um conjunto vazio de contextos, mas definir o valor como vazio também funciona

source: All the contexts that are not explicitly listed in other sets
pt_br: Todos os contextos que não estão explicitamente listados em outros conjuntos

source: https://javadoc.io/static/org.eclipse.microprofile.context-propagation/microprofile-context-propagation-api/1.2/org/eclipse/microprofile/context/ThreadContext.html#TRANSACTION[`ThreadContext.TRANSACTION`]
pt_br: link:https://javadoc.io/static/org.eclipse.microprofile.context-propagation/microprofile-context-propagation-api/1.2/org/eclipse/microprofile/context/ThreadContext.html#TRANSACTION[`ThreadContext.TRANSACTION`]

source: The JTA transaction context
pt_br: O contexto da transação JTA

source: The CDI (ArC) context
pt_br: O contexto do CDI (ArC)

source: The servlet context
pt_br: O contexto do servlet

source: The RESTEasy Reactive or RESTEasy Classic context
pt_br: O contexto do RESTEasy Reativo ou RESTEasy Clássico

source: The current `ThreadContextClassLoader`
pt_br: O `ThreadContextClassLoader` atual

source: Overriding the propagated contexts using annotations
pt_br: Sobrescrevendo os contextos propagados usando anotações

source: In order for automatic context propagation, such as Mutiny uses, to be overridden in specific methods, you can use the https://javadoc.io/doc/io.smallrye/smallrye-context-propagation-api/latest/io/smallrye/context/api/CurrentThreadContext.html[`@CurrentThreadContext`] annotation:
pt_br: Para que a propagação automática de contexto, como o Mutiny usa, seja sobrescrita em métodos específicos, você pode usar a anotação https://javadoc.io/doc/io.smallrye/smallrye-context-propagation-api/latest/io/smallrye/context/api/CurrentThreadContext.html[`@CurrentThreadContext`]:

source: Overriding the propagated contexts using CDI injection
pt_br: Sobrescrevendo os contextos propagados usando injeção de CDI

source: You can also inject a custom-built `ThreadContext` using the https://javadoc.io/doc/io.smallrye/smallrye-context-propagation-api/latest/io/smallrye/context/api/ThreadContextConfig.html[`@ThreadContextConfig`] annotation on your injection point:
pt_br: Você também pode injetar um `ThreadContext` personalizado usando a anotação https://javadoc.io/doc/io.smallrye/smallrye-context-propagation-api/latest/io/smallrye/context/api/ThreadContextConfig.html[`@ThreadContextConfig`] em seu ponto de injeção:

source: Likewise, there is a similar way to inject a configured instance of `ManagedExecutor` using the https://javadoc.io/doc/io.smallrye/smallrye-context-propagation-api/latest/io/smallrye/context/api/ManagedExecutorConfig.html[`@ManagedExecutorConfig`] annotation:
pt_br: Da mesma forma, há uma maneira semelhante de injetar uma instância configurada de `ManagedExecutor` usando a anotação https://javadoc.io/doc/io.smallrye/smallrye-context-propagation-api/latest/io/smallrye/context/api/ManagedExecutorConfig.html[`@ManagedExecutorConfig`]:

source: Sharing configured CDI instances of ManagedExecutor and ThreadContext
pt_br: Compartilhando instâncias de CDI configuradas de ManagedExecutor e ThreadContext

source: If you need to inject the same `ManagedExecutor` or `ThreadContext` into several places and share its capacity, you can name the instance with https://javadoc.io/doc/io.smallrye/smallrye-context-propagation-api/latest/io/smallrye/context/api/NamedInstance.html[`@NamedInstance`] annotation. `@NamedInstance` is a CDI qualifier and all injections of the same type and name will therefore share the same underlying instance. If you also need to customize your instance, you can do so using `@ManagedExecutorConfig`/`ThreadContextConfig` annotation on one of its injection points:
pt_br: Se você precisar injetar o mesmo `ManagedExecutor` ou `ThreadContext` em vários locais e compartilhar sua capacidade, você pode nomear a instância com a anotação https://javadoc.io/doc/io.smallrye/smallrye-context-propagation-api/latest/io/smallrye/context/api/NamedInstance.html[`@NamedInstance`]. `@NamedInstance` é um qualificador de CDI e, portanto, todas as injeções do mesmo tipo e nome compartilharão a mesma instância subjacente. Se também precisar personalizar a instância, você pode fazer isso usando a anotação `@ManagedExecutorConfig` / `ThreadContextConfig` em um dos pontos de injeção:

source: Context Propagation for CDI
pt_br: Propagação de Contexto para CDI

source: In terms of CDI, `@RequestScoped`, `@ApplicationScoped` and `@Singleton` beans get propagated and are available in other threads. `@Dependent` beans as well as any custom scoped beans cannot be automatically propagated via CDI Context Propagation.
pt_br: Em termos de CDI, os beans `@RequestScoped`, `@ApplicationScoped` e `@Singleton` são propagados e ficam disponíveis em outros threads. Os beans `@Dependent`, bem como quaisquer beans com escopo personalizado, não podem ser propagados automaticamente por meio da Propagação de Contexto do CDI.

source: `@ApplicationScoped` and `@Singleton` beans are always active scopes and as such are easy to deal with - context propagation tasks can work with those beans so long as the CDI container is running. However, `@RequestScoped` beans are a different story. They are only active for a short period of time which can be bound either to HTTP request or some other request/task when manually activated/deactivated. In this case user must be aware that once the original thread gets to an end of a request, it will terminate the context, calling `@PreDestroy` on those beans and then clearing them from the context. Subsequent attempts to access those beans from other threads can result in unexpected behaviour. It is therefore recommended to make sure all tasks using request scoped beans via context propagation are performed in such a manner that they don't outlive the original request duration.
pt_br: Beans `@ApplicationScoped` e `@Singleton` são sempre escopos ativos e, portanto, são fáceis de lidar - as tarefas de propagação de contexto podem funcionar com esses beans enquanto o contêiner CDI estiver em execução. Entretanto, os beans `@RequestScoped` são uma história diferente. Eles só ficam ativos por um curto período de tempo, que pode ser vinculado a uma solicitação HTTP ou a alguma outra solicitação/tarefa quando ativados/desativados manualmente. Nesse caso, o usuário deve estar ciente de que, quando o thread original chegar ao fim de uma solicitação, ele encerrará o contexto, chamando `@PreDestroy` nesses beans e, em seguida, limpando-os do contexto. As tentativas subsequentes de acessar esses beans de outros threads podem resultar em um comportamento inesperado. Portanto, é recomendável garantir que todas as tarefas que usam beans com escopo de solicitação por meio da propagação de contexto sejam executadas de forma que não ultrapassem a duração da solicitação original.

source: Due to the above described behavior, it is recommended to avoid using `@PreDestroy` on `@RequestScoped` beans when working with Context Propagation in CDI.
pt_br: Devido ao comportamento descrito acima, recomenda-se evitar o uso de `@PreDestroy` em `@RequestScoped` beans ao trabalhar com a propagação de contexto no CDI.
