Repository: quarkusio/pt.quarkus.io
Catalog: l10n/po/*/_versions/3.15/guides/grpc-service-implementation.adoc.po
Languages: pt_br

source: Implementing a gRPC Service
pt_br: Implementando um serviço gRPC

source: gRPC service implementations exposed as CDI beans are automatically registered and served by quarkus-grpc.
pt_br: As implementações de serviço gRPC expostas como beans CDI são automaticamente registradas e servidas pelo quarkus-grpc.

source: Implementing a gRPC service requires the gRPC classes to be generated. Place your `proto` files in `src/main/proto` and run `mvn compile`.
pt_br: A implementação de um serviço gRPC requer que as classes gRPC sejam geradas. Coloque seus arquivos 'proto' em 'src/main/proto' e execute 'mvn compile'.

source: Generated Code
pt_br: Código Gerado

source: Quarkus generates a few implementation classes for services declared in the `proto` file:
pt_br: O Quarkus gera algumas classes de implementação para serviços declarados no arquivo 'proto':

source: A _service interface_ using the Mutiny API
pt_br: Um _service interface_ usando a API Mutiny

source: the class name is `${JAVA_PACKAGE}.${NAME_OF_THE_SERVICE}`
pt_br: o nome da classe é '${JAVA_PACKAGE}.${NAME_OF_THE_SERVICE}'

source: An _implementation base_ class using the gRPC API
pt_br: Uma classe _base de implementação_ que utiliza a API gRPC

source: the class name is structured as follows: `${JAVA_PACKAGE}.${NAME_OF_THE_SERVICE}Grpc.${NAME_OF_THE_SERVICE}ImplBase`
pt_br: o nome da classe está estruturado da seguinte forma: '${JAVA_PACKAGE}.${NAME_OF_THE_SERVICE}Grpc.${NAME_OF_THE_SERVICE}ImplBase'

source: For example, if you use the following `proto` file snippet:
pt_br: Por exemplo, se você usar o seguinte trecho de arquivo 'proto':

source: `hello` is the java package for the generated classes.
pt_br: `hello` é o pacote java para as classes geradas.

source: `Greeter` is the service name.
pt_br: `Greeter` é o nome do serviço.

source: Then the service interface is `hello.Greeter` and the implementation base is the abstract static nested class: `hello.GreeterGrpc.GreeterImplBase`.
pt_br: Em seguida, a interface de serviço é 'Olá. Greeter' e a base de implementação é a classe aninhada estática abstrata: 'hello. GreeterGrpc.GreeterImplBase'.

source: You'll need to implement the _service interface_ or extend the _base class_ with your service implementation bean as described in the following sections.
pt_br: Você precisará implementar o _service interface_ ou estender o _base class_ com seu bean de implementação de serviço, conforme descrito nas seções a seguir.

source: Implementing a Service with the Mutiny API
pt_br: Implementando um serviço com a API Mutiny

source: To implement a gRPC service using the Mutiny API, create a class that implements the service interface. Then, implement the methods defined in the service interface. If you don't want to implement a service method just throw an `java.lang.UnsupportedOperationException` from the method body (the exception will be automatically converted to the appropriate gRPC exception). Finally, implement the service and add the `@GrpcService` annotation:
pt_br: Para implementar um serviço gRPC usando a API Mutiny , crie uma classe que implemente a interface de serviço. Em seguida, implemente os métodos definidos na interface de serviço. Se você não quiser implementar um método de serviço, basta lançar um 'java.lang.UnsupportedOperationException' do corpo do método (a exceção será convertida automaticamente para a exceção gRPC apropriada). Finalmente, implemente o serviço e adicione a anotação '@GrpcService':

source: A gRPC service implementation bean must be annotated with the `@GrpcService` annotation and should not declare any other CDI qualifier. All gRPC services have the `jakarta.inject.Singleton` scope. Additionally, the request context is always active during a service call.
pt_br: Um bean de implementação de serviço gRPC deve ser anotado com a anotação '@GrpcService' e não deve declarar nenhum outro qualificador CDI. Todos os serviços gRPC têm o escopo 'jakarta.inject.Singleton'. Além disso, o contexto de solicitação está sempre ativo durante uma chamada de serviço.

source: `hello.Greeter` is the generated service interface.
pt_br: `hello.Greeter` é a interface de serviço gerada.

source: The service implementation bean can also extend the Mutiny implementation base, where the class name is structured as follows: `Mutiny${NAME_OF_THE_SERVICE}Grpc.${NAME_OF_THE_SERVICE}ImplBase`.
pt_br: O bean de implementação de serviço também pode estender a base de implementação do Mutiny , onde o nome da classe é estruturado da seguinte maneira: 'Mutiny${NAME_OF_THE_SERVICE}Grpc.${NAME_OF_THE_SERVICE}ImplBase'.

source: Implementing a Service with the default gRPC API
pt_br: Implementando um serviço com a API gRPC padrão

source: To implement a gRPC service using the default gRPC API, create a class that extends the default implementation base. Then, override the methods defined in the service interface. Finally, implement the service and add the `@GrpcService` annotation:
pt_br: Para implementar um serviço gRPC usando a API gRPC padrão, crie uma classe que estenda a base de implementação padrão. Em seguida, substitua os métodos definidos na interface de serviço. Finalmente, implemente o serviço e adicione a anotação '@GrpcService':

source: Blocking Service Implementation
pt_br: Implementação do serviço de bloqueio

source: By default, all the methods from a gRPC service run on the event loop. As a consequence, you must **not** block. If your service logic must block, annotate the method with `io.smallrye.common.annotation.Blocking`:
pt_br: Por padrão, todos os métodos de um serviço gRPC são executados no loop de eventos. Como consequência, você deve **não** bloquear. Se a lógica do serviço precisar bloquear, anote o método com 'io.smallrye.common.annotation.Blocking':

source: Handling Streams
pt_br: Manipulação de fluxos

source: gRPC allows receiving and returning streams:
pt_br: gRPC permite receber e retornar fluxos:

source: Using Mutiny, you can implement these as follows:
pt_br: Usando o Mutiny, você pode implementá-los da seguinte maneira:

source: For the implemented services, Quarkus gRPC exposes health information in the following format:
pt_br: Para os serviços implementados, o Quarkus gRPC expõe informações de integridade no seguinte formato:

source: Clients can specify the fully qualified service name to get the health status of a specific service or skip specifying the service name to get the general status of the gRPC server.
pt_br: Os clientes podem especificar o nome de serviço totalmente qualificado para obter o status de integridade de um serviço específico ou ignore a especificação do nome do serviço para obter o status geral do servidor gRPC.

source: For more details, check out the https://github.com/grpc/grpc/blob/v1.28.1/doc/health-checking.md[gRPC documentation]
pt_br: Para mais detalhes, confira o https://github.com/grpc/grpc/blob/v1.28.1/doc/health-checking.md[documentação do gRPC]

source: Additionally, if Quarkus SmallRye Health is added to the application, a readiness check for the state of the gRPC services will be added to the MicroProfile Health endpoint response, that is `/q/health`.
pt_br: Além disso, se o Quarkus SmallRye Health for adicionado ao aplicativo, uma verificação de prontidão para o estado dos serviços gRPC será adicionado à resposta de ponto de extremidade do MicroProfile Health, ou seja, '/q/health'.

source: Quarkus gRPC Server implements the https://github.com/grpc/grpc/blob/master/doc/server-reflection.md[reflection service]. This service allows tools like https://github.com/fullstorydev/grpcurl[grpcurl] or https://github.com/gusaul/grpcox[grpcox] to interact with your services.
pt_br: O Quarkus gRPC Server implementa o https://github.com/grpc/grpc/blob/master/doc/server-reflection.md[reflection service]. Este serviço permite que ferramentas como https://github.com/fullstorydev/grpcurl[grpcurl] ou https://github.com/gusaul/grpcox[grpcox] interajam com seus serviços.

source: The reflection service is enabled by default in _dev_ mode. In test or production mode, you need to enable it explicitly by setting `quarkus.grpc.server.enable-reflection-service` to `true`.
pt_br: O reflection service é habilitado por padrão no modo _dev_. No modo de teste ou produção, você precisa habilitá-lo explicitamente definindo 'quarkus.grpc.server.enable-reflection-service' como 'true'.

source: Quarkus exposes both the reflection service `v1` and `v1alpha`.
pt_br: O Quarkus expõe o reflection service `v1` e `v1alpha`.

source: Scaling
pt_br: Dimensionamento

source: By default, quarkus-grpc starts a single gRPC server running on a single event loop.
pt_br: Por padrão, o quarkus-grpc inicia um único servidor gRPC em execução em um único loop de eventos.

source: If you wish to scale your server, you can set the number of server instances by setting `quarkus.grpc.server.instances`.
pt_br: Se você deseja dimensionar seu servidor, você pode definir o número de instâncias do servidor definindo 'quarkus.grpc.server.instances'.

source: Server Configuration
pt_br: Configuração do Servidor

source: When you disable `quarkus.grpc.server.use-separate-server`, you are then using the new Vert.x gRPC server implementation which uses the existing HTTP server. Which means that the server port is now `8080` (or the port configured with `quarkus.http.port`). Also, most of the other configuration properties are no longer applied, since it's the HTTP server that should already be properly configured.
pt_br: Quando você desabilita 'quarkus.grpc.server.use-separate-server', você está usando a nova implementação do servidor gRPC Vert.x que usa o servidor HTTP existente. O que significa que a porta do servidor agora é '8080' (ou a porta configurada com 'quarkus.http.port'). Além disso, a maioria das outras propriedades de configuração não são mais aplicadas, pois é o servidor HTTP que já deve estar configurado corretamente.

source: When you enable `quarkus.grpc.server.xds.enabled`, it's the xDS that should handle most of the configuration above.
pt_br: Quando você habilita 'quarkus.grpc.server.xds.enabled', é o xDS que deve lidar com a maior parte da configuração acima.

source: Example of Configuration
pt_br: Exemplo de configuração

source: Enabling TLS
pt_br: Habilitando o TLS

source: To enable TLS, use the following configuration.
pt_br: Para habilitar o TLS, use a configuração a seguir.

source: Note that all paths in the configuration may either specify a resource on the classpath (typically from `src/main/resources` or its subfolder) or an external file.
pt_br: Observe que todos os caminhos na configuração podem especificar um recurso no classpath (normalmente de 'src/main/resources' ou sua subpasta) ou um arquivo externo.

source: When SSL/TLS is configured, `plain-text` is automatically disabled.
pt_br: Quando SSL/TLS é configurado, `plain-text` é automaticamente desativado.

source: TLS with Mutual Auth
pt_br: TLS com autenticação mútua

source: To use TLS with mutual authentication, use the following configuration:
pt_br: Para utilizar o TLS com autenticação mútua, utilize a seguinte configuração:

source: Server Interceptors
pt_br: Interceptores de servidor

source: gRPC server interceptors let you perform logic, such as authentication, before your service is invoked.
pt_br: Os interceptadores de servidor gRPC permitem que você execute lógica, como autenticação, antes que seu serviço seja chamado.

source: You can implement a gRPC server interceptor by creating an `@ApplicationScoped` bean implementing `io.grpc.ServerInterceptor`:
pt_br: Você pode implementar um interceptor de servidor gRPC criando um bean '@ApplicationScoped' implementando 'io.grpc.ServerInterceptor':

source: It's also possible to annotate a producer method as a global interceptor:
pt_br: Também é possível anotar um método de produtor como um interceptador global:

source: Check the https://grpc.github.io/grpc-java/javadoc/io/grpc/ServerInterceptor.html[ServerInterceptor JavaDoc] to properly implement your interceptor.
pt_br: Verifique o https://grpc.github.io/grpc-java/javadoc/io/grpc/ServerInterceptor.html[ServerInterceptor JavaDoc] para implementar corretamente seu interceptador.

source: To apply an interceptor to all exposed services, annotate it with `@io.quarkus.grpc.GlobalInterceptor`. To apply an interceptor to a single service, register it on the service with `@io.quarkus.grpc.RegisterInterceptor`:
pt_br: Para aplicar um interceptador a todos os serviços expostos, anote-o com '@io.quarkus.grpc.GlobalInterceptor'. Para aplicar um interceptador a um único serviço, registre-o no serviço com '@io.quarkus.grpc.RegisterInterceptor':

source: When you have multiple server interceptors, you can order them by implementing the `jakarta.enterprise.inject.spi.Prioritized` interface. Please note that all the global interceptors are invoked before the service-specific interceptors.
pt_br: Quando você tem vários interceptadores de servidor, você pode encomendá-los implementando a interface 'jakarta.enterprise.inject.spi.Priorizd'. Observe que todos os interceptores globais são invocados antes do serviço específico Interceptadores.

source: Interceptors with the highest priority are called first. The default priority, used if the interceptor does not implement the `Prioritized` interface, is `0`.
pt_br: Os interceptadores com a maior prioridade são chamados primeiro. A prioridade padrão, usada se o interceptador não implementar a interface `Prioritized` , é `0` .

source: Testing your services
pt_br: Testando seus serviços

source: The easiest way to test a gRPC service is to use a gRPC client as described in xref:grpc-service-consumption.adoc[Consuming a gRPC Service].
pt_br: A maneira mais fácil de testar um serviço gRPC é usar um cliente gRPC conforme descrito em xref:grpc-service-consumption.adoc[Consumindo um serviço gRPC].

source: Please note that in the case of using a client to test an exposed service that does not use TLS, there is no need to provide any configuration. E.g. to test the `HelloService` defined above, one could create the following test:
pt_br: Observe que, no caso de usar um cliente para testar um serviço exposto que não usa TLS, Não há necessidade de fornecer nenhuma configuração. Por exemplo, para testar o 'HelloService' definido acima, pode-se criar o seguinte teste:

source: Trying out your services manually
pt_br: Experimentando seus serviços manualmente

source: Please note that your application needs to expose the "normal" HTTP port for the Dev UI to be accessible. If your application does not expose any HTTP endpoints, you can create a dedicated profile with a dependency on `quarkus-vertx-http`:
pt_br: Observe que seu aplicativo precisa expor a porta HTTP "normal" para que a interface do usuário de desenvolvimento seja acessível. Se seu aplicativo não expor nenhum ponto de extremidade HTTP, você poderá criar um perfil dedicado com uma dependência em 'quarkus-vertx-http':

source: Having it, you can run the dev mode with: `mvn quarkus:dev -Pdevelopment`.
pt_br: Tendo isso, você pode executar o modo dev com: 'mvn quarkus:dev -Pdevelopment'.

source: If you use Gradle, you can simply add a dependency for the `quarkusDev` task:
pt_br: Se você usar o Gradle, você pode simplesmente adicionar uma dependência para a tarefa 'quarkusDev':

source: gRPC Server metrics
pt_br: Métricas do gRPC Server

source: Enabling metrics collection
pt_br: Habilitando a coleta de métricas

source: gRPC server metrics are automatically enabled when the application also uses the xref:telemetry-micrometer.adoc[`quarkus-micrometer`] extension. Micrometer collects the metrics of all the gRPC services implemented by the application.
pt_br: As métricas do servidor gRPC são ativadas automaticamente quando o aplicativo também usa a extensão xref:telemetry-micrometer.adoc['quarkus-micrometer']. O Micrometer coleta as métricas de todos os serviços gRPC implementados pelo aplicativo.

source: As an example, if you export the metrics to Prometheus, you will get:
pt_br: Como exemplo, se você exportar as métricas para o Prometheus, obterá:

source: The service name, method and type can be found in the _tags_.
pt_br: O nome do serviço, o método e o tipo podem ser encontrados nas _tags_.

source: Disabling metrics collection
pt_br: Desativar a coleta de métricas

source: To disable the gRPC server metrics when `quarkus-micrometer` is used, add the following property to the application configuration:
pt_br: Para desabilitar as métricas do servidor gRPC quando 'quarkus-micrometer' for usado, adicione a seguinte propriedade à configuração do aplicativo:

source: Use virtual threads
pt_br: Usar threads virtuais

source: To use virtual threads in your gRPC service implementation, check the dedicated xref:./grpc-virtual-threads.adoc[guide].
pt_br: Para usar threads virtuais na implementação do serviço gRPC, verifique o xref:./grpc-virtual-threads.adoc[guia] dedicado.

source: Basic authentication
pt_br: Autenticação básica
