Repository: quarkusio/pt.quarkus.io
Catalog: l10n/po/*/_versions/3.15/guides/quarkus-runtime-*-image.adoc.po
Languages: pt_br

source: Quarkus Base Runtime Image
pt_br: Imagem de Tempo de Execução de Base do Quarkus

source: To ease the containerization of native executables, Quarkus provides a base image providing the requirements to run these executables. The `quarkus-micro-image:2.0` image is:
pt_br: Para facilitar a conteinerização de executáveis nativos, o Quarkus fornece uma imagem de base com os requisitos para rodar esses executáveis. A imagem `quarkus-micro-image:2.0` é:

source: small (based on `ubi8-micro`)
pt_br: pequena (baseada em `ubi8-micro`)

source: designed for containers
pt_br: concebida para contêineres

source: contains the right set of dependencies (glibc, libstdc++, zlib)
pt_br: contém o conjunto correto de dependências (glibc, libstdc++, zlib)

source: support upx-compressed executables (more details on the xref:upx.adoc[enabling compression documentation])
pt_br: suporta executáveis comprimidos por upx (mais detalhes na xref:upx.adoc[documentação de ativação da compressão])

source: Using the base image
pt_br: Usando a imagem de base

source: In your `Dockerfile`, just use:
pt_br: No seu `Dockerfile`, basta usar:

source: Extending the image
pt_br: Estendendo a imagem

source: Your application may have additional requirements. For example, if you have an application that requires `libfreetype.so`, you need to copy the native libraries to the container. In this case, you need to use a multi-stage `dockerfile` to copy the required libraries:
pt_br: Sua aplicação pode ter requisitos adicionais. Por exemplo, se tiver uma aplicação que exija `libfreetype.so`, será necessário copiar as bibliotecas nativas para o contêiner. Nesse caso, você precisa usar um `dockerfile` de vários estágios para copiar as bibliotecas necessárias:

source: If you need to have access to the full AWT support, you need more than just `libfreetype.so`, but also the font and font configurations:
pt_br: Se precisar de acesso a todo o suporte AWT, precisa de mais do que apenas `libfreetype.so`, mas também da fonte e das configurações da fonte:

source: Alternative - Using ubi-minimal
pt_br: Alternativa - Usando o ubi-minimal

source: If the micro image does not suit your requirements, you can use https://catalog.redhat.com/software/containers/ubi8/ubi-minimal/5c359a62bed8bd75a2c3fba8[ubi8/ubi-minimal]. It's a bigger image, but contains more utilities and is closer to a full Linux distribution. Typically, it contains a package manager (`microdnf`), so you can install packages more easily.
pt_br: Se a imagem micro não atender às suas necessidades, você pode usar o https://catalog.redhat.com/software/containers/ubi8/ubi-minimal/5c359a62bed8bd75a2c3fba8[ubi8/ubi-minimal]. É uma imagem maior, mas contém mais utilitários e está mais próxima de uma distribuição completa do Linux. Normalmente, ela contém um gerenciador de pacotes ( `microdnf` ), para que você possa instalar pacotes com mais facilidade.

source: To use this base image, use the following `Dockerfile`:
pt_br: Para usar esta imagem de base, use o seguinte `Dockerfile`:
