Repository: quarkusio/pt.quarkus.io
Catalog: l10n/po/*/_versions/3.15/guides/qute.adoc.po
Languages: pt_br

source: Qute Templating Engine
pt_br: Motor de template Qute

source: Qute is a templating engine designed specifically to meet the Quarkus needs. The usage of reflection is minimized to reduce the size of native images. The API combines both the imperative and the non-blocking reactive style of coding. In the development mode, all files located in `src/main/resources/templates` are watched for changes and modifications are immediately visible. Furthermore, we try to detect most of the template problems at build time. In this guide, you will learn how to easily render templates in your application.
pt_br: Qute é um mecanismo de modelagem projetado especificamente para atender às necessidades do Quarkus. O uso de reflexão é minimizado para reduzir o tamanho das imagens nativas. A API combina tanto o estilo imperativo quanto o estilo de codificação reativo e não bloqueante. No modo de desenvolvimento, todos os arquivos localizados em `src/main/resources/templates` são monitorados para alterações, e as modificações são imediatamente visíveis. Além disso, tentamos detectar a maioria dos problemas de modelo durante o tempo de compilação. Neste guia, você aprenderá como renderizar facilmente modelos em sua aplicação.

source: Solution
pt_br: Solução

source: We recommend that you follow the instructions in the next sections and create the application step by step. However, you can go right to the completed example.
pt_br: Recomendamos que siga as instruções nas seções seguintes e crie a aplicação passo a passo. No entanto, você pode ir diretamente para o exemplo completo.

source: Clone the Git repository: `git clone {quickstarts-clone-url}`, or download an {quickstarts-archive-url}[archive].
pt_br: Clone o repositório Git: `git clone {quickstarts-clone-url}`, ou baixe um {quickstarts-archive-url}[arquivo].

source: The solution is located in the `qute-quickstart` link:{quickstarts-tree-url}/qute-quickstart[directory].
pt_br: A solução está localizada no link:{quickstarts-tree-url}/qute-quickstart[diretório] `qute-quickstart`.

source: `{name}` is a value expression that is evaluated when the template is rendered.
pt_br: `{name}` é uma expressão de valor que é avaliada quando o modelo é processado.

source: Now let's inject the "compiled" template in the resource class.
pt_br: Agora vamos injetar o modelo "compilado" na classe de recurso.

source: If there is no `@Location` qualifier provided, the field name is used to locate the template. In this particular case, we're injecting a template with path `templates/hello.txt`.
pt_br: Se não for fornecido um qualificador `@Location`, o nome do campo é utilizado para localizar o modelo/template. Neste caso específico, vamos injetar um modelo com o caminho `templates/hello.txt`.

source: `Template.data()` returns a new template instance that can be customized before the actual rendering is triggered. In this case, we put the name value under the key `name`. The data map is accessible during rendering.
pt_br: O `Template.data()` retorna uma nova instância de modelo que pode ser configurado antes que a renderização. Neste caso, colocamos o valor do nome na chave `name`. O mapa de dados está acessível durante a renderização.

source: Note that we don't trigger the rendering - this is done automatically by a special `ContainerResponseFilter` implementation.
pt_br: Note-se que não acionamos a renderização - isto é feito automaticamente por uma implementação especial do `ContainerResponseFilter`.

source: If your application is running, you can request the endpoint:
pt_br: Se sua aplicação estiver rodando, você pode fazer uma requisição ao endpoint:

source: Type-safe templates
pt_br: Type-safe templates(Templates com tipos seguros)

source: There's an alternate way to declare your templates in your Java code, which relies on the following convention:
pt_br: Existe uma forma alternativa de declarar os seus modelos no seu código Java, que se baseia na seguinte convenção:

source: Organise your template files in the `/src/main/resources/templates` directory, by grouping them into one directory per resource class. So, if your `ItemResource` class references two templates `hello` and `goodbye`, place them at `/src/main/resources/templates/ItemResource/hello.txt` and `/src/main/resources/templates/ItemResource/goodbye.txt`. Grouping templates per resource class makes it easier to navigate to them.
pt_br: Organize os seus arquivos de modelos no diretório `/src/main/resources/templates`, agrupando-os em um diretório por classe de recurso. Assim, se a sua classe `ItemResource` faz referência a dois modelos `hello` e `goodbye`, coloque-os em `/src/main/resources/templates/ItemResource/hello.txt` e `/src/main/resources/templates/ItemResource/goodbye.txt`. O agrupamento de modelos por classe de recurso facilita a navegação até eles.

source: In each of your resource class, declare a `@CheckedTemplate static class Template {}` class within your resource class.
pt_br: Em cada uma das suas classes de recursos, declare uma classe `@CheckedTemplate static class Template {}` dentro da sua classe de recursos.

source: Declare one `public static native TemplateInstance method();` per template file for your resource.
pt_br: Declare um `public static native TemplateInstance method();` por arquivo modelo para o seu recurso.

source: Use those static methods to build your template instances.
pt_br: Utilize esses métodos estáticos para criar as suas instâncias de modelo.

source: Here's the previous example, rewritten using this style:
pt_br: Aqui está o exemplo anterior, reescrito com este estilo:

source: We'll start with a very simple template:
pt_br: Vamos começar com um modelo muito simples:

source: Now let's declare and use those templates in the resource class.
pt_br: Agora vamos declarar e utilizar esses modelos na classe de recurso.

source: This declares a template with path `templates/HelloResource/hello`.
pt_br: Isto declara um modelo com o caminho `templates/HelloResource/hello`.

source: `Templates.hello()` returns a new template instance that is returned from the resource method. Note that we don't trigger the rendering - this is done automatically by a special `ContainerResponseFilter` implementation.
pt_br: `Templates.hello()` retorna uma nova instância de modelo que é gerada pelo método de recurso. Observe que não acionamos a renderização - isso é feito automaticamente por uma implementação especial de `ContainerResponseFilter`.

source: Once you have declared a `@CheckedTemplate` class, we will check that all its methods point to existing templates, so if you try to use a template from your Java code and you forgot to add it, we will let you know at build time :)
pt_br: Depois de declarar uma classe `@CheckedTemplate`, verificaremos se todos os seus métodos apontam para modelos existentes, por isso, informaremos no tempo de compilação, caso tenha esquecido de adicionar um modelo no seu projeto :)

source: Keep in mind this style of declaration allows you to reference templates declared in other resources too:
pt_br: Não se esqueça de que este estilo de declaração também permite fazer referência a modelos declarados em outros recursos:

source: Naturally, if you want to declare templates at the top-level, directly in `/src/main/resources/templates/hello.txt`, for example, you can declare them in a top-level (non-nested) `Templates` class:
pt_br: Naturalmente, se quiser declarar os modelos ao nível superior, diretamente em `/src/main/resources/templates/hello.txt`, por exemplo, pode declará-los numa classe `Templates` de nível superior (não aninhada):

source: This declares a template with path `templates/hello`.
pt_br: Isto declara um modelo com o caminho `templates/hello`.

source: Template Parameter Declarations
pt_br: Declarações de parâmetros de modelo

source: If you declare a *parameter declaration* in a template then Qute attempts to validate all expressions that reference this parameter and if an incorrect expression is found the build fails.
pt_br: Se você declarar uma *declaração de parâmetro* em um modelo, o Qute tentará validar todas as expressões que fazem referência a esse parâmetro e, se uma expressão incorreta for encontrada, a compilação falhará.

source: Let's suppose we have a simple class like this:
pt_br: Vamos supor que temos uma classe simples como esta:

source: And we'd like to render a simple HTML page that contains the item name and price.
pt_br: E gostaríamos de renderizar uma página HTML simples que contenha o nome e o preço do item.

source: Let's start again with the template:
pt_br: Vamos começar de novo com o modelo:

source: This expression is validated. Try to change the expression to `{item.nonSense}` and the build should fail.
pt_br: Esta expressão é validada. Se tentar alterar a expressão para `{item.nonSense}`, a construção deverá falhar.

source: This is also validated.
pt_br: Isto também é validado.

source: Finally, let's create a resource class with type-safe templates:
pt_br: Finalmente, vamos criar uma classe de recurso com modelos type-safe:

source: Declare a method that gives us a `TemplateInstance` for `templates/ItemResource/item.html` and declare its `Item item` parameter so we can validate the template.
pt_br: Declare um método que nos dê um `TemplateInstance` para `templates/ItemResource/item.html` e declare o seu parâmetro `Item item` para podermos validar o modelo.

source: Make the `Item` object accessible in the template.
pt_br: Tornar o objeto `Item` acessível no modelo.

source: Template parameter declaration inside the template itself
pt_br: Declaração do parâmetro do modelo dentro do próprio modelo

source: Alternatively, you can declare your template parameters in the template file itself.
pt_br: Em alternativa, pode declarar os seus parâmetros de modelo no próprio arquivo de modelo.

source: Optional parameter declaration. Qute attempts to validate all expressions that reference the parameter `item`.
pt_br: Declaração de parâmetro opcional. O Qute tenta validar todas as expressões que fazem referência ao parâmetro `item`.

source: Finally, let's create a resource class.
pt_br: Finalmente, vamos criar uma classe de recurso.

source: Inject the template with path `templates/item.html`.
pt_br: Injetar o modelo com o caminho `templates/item.html`.

source: Template Extension Methods
pt_br: Métodos de extensão de modelos

source: *Template extension methods* are used to extend the set of accessible properties of data objects.
pt_br: *Os métodos de extensão de modelos* são utilizados para estender o conjunto de propriedades acessíveis dos objetos de dados.

source: Sometimes, you're not in control of the classes that you want to use in your template, and you cannot add methods to them. Template extension methods allows you to declare new method for those classes that will be available from your templates just as if they belonged to the target class.
pt_br: Por vezes, você não tem controle sobre as classes que deseja usar em seu modelo e não pode adicionar métodos às mesmas. Os métodos de extensão de modelos permitem-lhe declarar novos métodos para essas classes que estarão disponíveis a partir dos seus modelos, tal como se pertencessem à classe de destino.

source: Let's keep extending on our simple HTML page that contains the item name, price and add a discounted price. The discounted price is sometimes called a "computed property". We will implement a template extension method to render this property easily. Let's update our template:
pt_br: Vamos continuar a estender a nossa página HTML simples que contém o nome do item, o preço e adicionar um preço com desconto. O preço com desconto é por vezes designado por “propriedade computada”. Vamos implementar um método de extensão de modelo para processar esta propriedade facilmente. Vamos atualizar o nosso modelo:

source: `if` is a basic control flow section.
pt_br: `if` é uma instrução básica do fluxo de controle.

source: This expression is also validated against the `Item` class and obviously there is no such property declared. However, there is a template extension method declared on the `TemplateExtensions` class - see below.
pt_br: Esta expressão é também validada em relação à classe `Item` e, obviamente, não existe tal propriedade declarada. No entanto, existe um método de extensão de modelo declarado na classe `TemplateExtensions` - veja abaixo.

source: Finally, let's create a class where we put all our extension methods:
pt_br: Finalmente, vamos criar uma classe onde colocamos todos os nossos métodos de extensão:

source: A static template extension method can be used to add "computed properties" to a data class. The class of the first parameter is used to match the base object and the method name is used to match the property name.
pt_br: Um método de extensão de modelo estático pode ser utilizado para adicionar “propriedades computadas” a uma classe de dados. A classe do primeiro parâmetro é utilizada para corresponder ao objeto base e o nome do método é utilizado para corresponder ao nome da propriedade.

source: you can place template extension methods in every class if you annotate them with `@TemplateExtension` but we advise to keep them either grouped by target type, or in a single `TemplateExtensions` class by convention.
pt_br: pode colocar métodos de extensão de modelos em todas as classes se os anotar com `@TemplateExtension`, mas aconselhamos a mantê-los agrupados por tipo de destino ou numa única classe `TemplateExtensions` por convenção.

source: Rendering Periodic Reports
pt_br: Renderização de relatórios periódicos

source: Templating engine could be also very useful when rendering periodic reports. You'll need to add the `quarkus-scheduler` and `quarkus-qute` extensions first. In your `pom.xml` file, add:
pt_br: O mecanismo de criação de modelos também pode ser muito útil na apresentação de relatórios periódicos. Primeiro, é necessário adicionar as extensões `quarkus-scheduler` e `quarkus-qute`. No seu arquivo `pom.xml`, adicione:

source: Let's suppose we have a `SampleService` bean whose `get()` method returns a list of samples.
pt_br: Vamos supor que temos um bean `SampleService` cujo método `get()` devolve uma lista de amostras.

source: The template is simple:
pt_br: O modelo é simples:

source: The loop section makes it possible to iterate over iterables, maps and streams.
pt_br: A instrução de repetição permite iterar sobre iteráveis, mapas e fluxos.

source: This value expression is using the https://en.wikipedia.org/wiki/Elvis_operator[elvis operator] - if the name is null the default value is used.
pt_br: Esta expressão de valor está utilizando o link:https://en.wikipedia.org/wiki/Elvis_operator[operador el] vis - se o nome for nulo, é utilizado o valor predefinido.

source: In this case, we use the `@Location` qualifier to specify the template path: `templates/reports/v1/report_01.html`.
pt_br: Neste caso, utilizamos o qualificador `@Location` para especificar o caminho do modelo: `templates/reports/v1/report_01.html`.

source: Use the `@Scheduled` annotation to instruct Quarkus to execute this method on the half hour. For more information see the xref:scheduler.adoc[Scheduler] guide.
pt_br: Utilize a anotação `@Scheduled` para instruir o Quarkus a executar este método a cada meia hora. Para mais informações, consulte o guia link:scheduler.html[Scheduler].

source: The `TemplateInstance.render()` method triggers rendering. Note that this method blocks the current thread.
pt_br: O método `TemplateInstance.render()` aciona a renderização. Note-se que este método bloqueia a thread atual.

source: Qute Reference Guide
pt_br: Guia de Referência do Qute

source: To learn more about Qute, please refer to the xref:qute-reference.adoc[Qute reference guide].
pt_br: Para saber mais sobre a Qute, consulte o link:qute-reference.html[guia de referência da Qute].

source: Qute Configuration Reference
pt_br: Referência de configuração do Qute

source: <span class="icon"><i class="fa fa-lock" title="Fixed at build time"></i></span> Configuration property fixed at build time - All other configuration properties are overridable at runtime <input type="search" id="config-search-0" placeholder="FILTER CONFIGURATION" disabled>
pt_br: <span class="icon"><i class="fa fa-lock" title="Fixed at build time"></i></span> Propriedade de Configuração Fixa no Momento da Compilação - Todas as outras propriedades de configuração podem ser sobrepostas em tempo de execução. <input type="search" id="config-search-0" placeholder="FILTER CONFIGURATION" disabled>
