Repository: quarkusio/pt.quarkus.io
Catalog: l10n/po/*/_versions/3.15/guides/rest-client.adoc.po
Languages: pt_br

source: As HTTP messages can have large bodies, we limit the amount of body characters logged. The default limit is `100`, you can change it by specifying `quarkus.rest-client.logging.body-limit`.
pt_br: Como as mensagens HTTP podem ter corpos grandes, limitamos a quantidade de caracteres do corpo registrado. O limite padrão é `100`, pode alterá-lo especificando `quarkus.rest-client.logging.body-limit`.

source: An example logging configuration:
pt_br: Um exemplo de configuração de registro:

source: Mocking the client for tests
pt_br: Simulação do cliente para testes

source: If you use a client injected with the `@RestClient` annotation, you can easily mock it for tests. You can do it with Mockito's `@InjectMock` or with `QuarkusMock`.
pt_br: Se você usar um cliente injetado com a anotação `@RestClient`, poderá facilmente simulá-lo para testes. Você pode fazer isso com `@InjectMock` do Mockito ou com `QuarkusMock` .

source: This section shows how to replace your client with a mock. If you would like to get a more in-depth understanding of how mocking works in Quarkus, see the blog post on https://quarkus.io/blog/mocking/[Mocking CDI beans].
pt_br: Esta seção mostra como substituir o seu cliente por uma simulação. Se pretender obter uma compreensão mais aprofundada de como funciona a simulação no Quarkus, consulte a publicação do blog sobre a https://quarkus.io/blog/mocking/[simulação de beans CDI].

source: Mocking does not work when using `@QuarkusIntegrationTest`.
pt_br: A simulação não funciona quando se utiliza `@QuarkusIntegrationTest`.

source: Let's assume you have the following client:
pt_br: Vamos supor que você tem o seguinte cliente:

source: Mocking with InjectMock
pt_br: Simulando com InjectMock

source: The simplest approach to mock a client for tests is to use Mockito and `@InjectMock`.
pt_br: A abordagem mais simples para simular um cliente para testes é usar Mockito e `@InjectMock`.

source: First, add the following dependency to your application:
pt_br: Primeiro, adicione a seguinte dependência à sua aplicação:

source: Then, in your test you can simply use `@InjectMock` to create and inject a mock:
pt_br: Depois, no seu teste, pode simplesmente utilizar `@InjectMock` para criar e injetar uma simulação:

source: Mocking with QuarkusMock
pt_br: Simulando com o QuarkusMock

source: If Mockito doesn't meet your needs, you can create a mock programmatically using `QuarkusMock`, e.g.:
pt_br: Se o Mockito não satisfizer as suas necessidades, você pode criar uma simulação programaticamente utilizando `QuarkusMock`, e.g.:

source: here we use a manually created implementation of the client interface to replace the actual Client
pt_br: aqui utilizamos uma implementação criada manualmente da interface do cliente para substituir a interface do cliente atual

source: note that `RestClient.LITERAL` has to be passed as the last argument of the `installMockForType` method
pt_br: note-se que `RestClient.LITERAL` tem de ser passado como último argumento do método `installMockForType`

source: Using a Mock HTTP Server for tests
pt_br: Usando um Servidor HTTP Simulado para testes

source: Known limitations
pt_br: Limitações conhecidas

source: it is not possible to set `HostnameVerifier` or `SSLContext`
pt_br: não é possível definir `HostnameVerifier` ou `SSLContext`

source: a few things that don't make sense for a non-blocking implementations, such as setting the `ExecutorService`, don't work
pt_br: algumas coisas que não fazem sentido para implementações não blocantes, como a definição do `ExecutorService`, não funcionam

source: Further reading
pt_br: Leitura adicional

source: link:https://download.eclipse.org/microprofile/microprofile-rest-client-2.0/microprofile-rest-client-spec-2.0.html[MicroProfile Rest Client specification]
pt_br: link:https://download.eclipse.org/microprofile/microprofile-rest-client-2.0/microprofile-rest-client-spec-2.0.html[Especificação do Cliente Rest MicroProfile]
