Repository: quarkusio/pt.quarkus.io
Catalog: l10n/po/*/_versions/3.15/guides/rest-client.adoc.po
Languages: pt_br

source: Using the REST Client
pt_br: Usando o Cliente REST

source: Prerequisites
pt_br: Pré-requisitos

source: Solution
pt_br: Solução

source: We recommend that you follow the instructions in the next sections and create the application step by step. However, you can go right to the completed example.
pt_br: Recomendamos que siga as instruções nas seções seguintes e crie a aplicação passo a passo. No entanto, você pode ir diretamente para o exemplo completo.

source: Clone the Git repository: `git clone {quickstarts-clone-url}`, or download an {quickstarts-archive-url}[archive].
pt_br: Clone o repositório Git: `git clone {quickstarts-clone-url}`, ou baixe um {quickstarts-archive-url}[arquivo].

source: Creating the Maven project
pt_br: Criar o projeto Maven

source: First, we need a new project. Create a new project with the following command:
pt_br: Primeiro, precisamos de um novo projeto. Crie um novo projeto com o seguinte comando:

source: This command generates the Maven project with a REST endpoint and imports:
pt_br: Este comando gera o projeto Maven com um endpoint REST e com importações:

source: This will add the following to your build file:
pt_br: Isto irá adicionar o seguinte trecho no seu arquivo de build:

source: Setting up the model
pt_br: Configurando o modelo

source: In this guide we will be demonstrating how to consume part of the REST API supplied by the link:https://stage.code.quarkus.io[stage.code.quarkus.io] service. Our first order of business is to set up the model we will be using, in the form of a `Extension` POJO.
pt_br: Neste guia, demonstraremos como consumir parte da API REST fornecida pelo serviço link:https://stage.code.quarkus.io[stage.code.quarkus.io] . Nosso primeiro passo é configurar o modelo que usaremos, na forma de um POJO `Extension` .

source: Create a `src/main/java/org/acme/rest/client/Extension.java` file and set the following content:
pt_br: Crie um arquivo `src/main/java/org/acme/rest/client/Extension.java` e defina o seguinte conteúdo:

source: The model above is only a subset of the fields provided by the service, but it suffices for the purposes of this guide.
pt_br: O modelo acima é apenas um subconjunto dos campos fornecidos pelo serviço, mas é suficiente para os objetivos deste guia.

source: Create the interface
pt_br: Crie a interface

source: The `getById` method gives our code the ability to get an extension by id from the Code Quarkus API. The client will handle all the networking and marshalling leaving our code clean of such technical details.
pt_br: O método `getById` dá ao nosso código a capacidade de obter uma extensão por id a partir da API do Code Quarkus. O cliente tratará de toda a ligação em rede e da organização, deixando o nosso código livre desses pormenores técnicos.

source: The purpose of the annotations in the code above is the following:
pt_br: O objetivo das anotações no código acima é o seguinte:

source: `@RegisterRestClient` allows Quarkus to know that this interface is meant to be available for CDI injection as a REST Client
pt_br: `@RegisterRestClient` permite que o Quarkus saiba que essa interface deve estar disponível para injeção de CDI como um Cliente REST

source: `@Path`, `@GET` and `@QueryParam` are the standard Jakarta REST annotations used to define how to access the service
pt_br: `@Path`, `@GET` e `@QueryParam` são as anotações Jakarta REST padrão utilizadas para definir o modo de acesso ao serviço

source: If you don't rely on the JSON default, it is heavily recommended to annotate your endpoints with the `@Produces` and `@Consumes` annotations to define precisely the expected content-types. It will allow to narrow down the number of Jakarta REST providers (which can be seen as converters) included in the native executable.
pt_br: Se você não conta com JSON padrão, é altamente recomendável anotar seus endpoints com as anotações `@Produces` e `@Consumes` para definir com precisão os tipos de conteúdo esperados. Isso permitirá reduzir o número de provedores Jakarta REST (que podem ser vistos como conversores) incluídos no executável nativo.

source: Query Parameters
pt_br: Parâmetros de Consulta

source: The easiest way to specify a query parameter is to annotate a client method parameter with the `@QueryParam` or the `@RestQuery`. The `@RestQuery` is equivalent of the `@QueryParam`, but with optional name. Additionally, it can be also used to pass query parameters as a `Map`, which is convenient if parameters are not known in advance.
pt_br: A maneira mais fácil de especificar um parâmetro de consulta é anotar um parâmetro de método do cliente com `@QueryParam` ou `@RestQuery` . O `@RestQuery` é equivalente ao `@QueryParam` , mas com nome opcional. Além disso, ele também pode ser usado para passar parâmetros de consulta como `Map` , o que é conveniente se os parâmetros não forem conhecidos antecipadamente.

source: Request query will include parameter with key `name`
pt_br: A consulta da requisição incluirá um parâmetro com a chave `name`

source: Each `Map` entry represents exactly one query parameter
pt_br: Cada entrada `Map` representa exatamente um parâmetro de consulta

source: `MultivaluedMap` allows you to send array values
pt_br: `MultivaluedMap` permite enviar valores de vetor

source: Using @ClientQueryParam
pt_br: Usando @ClientQueryParam

source: Another way to add query parameters to a request is to use `@io.quarkus.rest.client.reactive.ClientQueryParam` on either the REST client interface or a specific method of the interface. The annotation can specify the query parameter name while the value can either be a constant, a configuration property or it can be determined by invoking a method.
pt_br: Outra forma de adicionar parâmetros de consulta a uma requisição é usar `@io.quarkus.rest.client.reactive.ClientQueryParam` na interface do cliente REST ou em um método específico da interface. A anotação pode especificar o nome do parâmetro de consulta, enquanto o valor pode ser uma constante, uma propriedade de configuração ou pode ser determinado pela chamada de um método.

source: The following example shows the various possible usages:
pt_br: O exemplo a seguir mostra as várias utilizações possíveis:

source: By placing `@ClientQueryParam` on the interface, we ensure that `my-param` will be added to all requests of the client. Because we used the `${...}` syntax, the actual value of the parameter will be obtained using the `my.property-value` configuration property.
pt_br: Ao colocar `@ClientQueryParam` na interface, garantimos que `my-param` será adicionado a todas as requisições do cliente. Como usamos a sintaxe `${...}`, o valor real do parâmetro será obtido usando a propriedade de configuração `my.property-value` .

source: When `getWithOtherParam` is called, in addition to the `my-param` query parameter, `some-other-param` with the value of `other` will also be added.
pt_br: Quando `getWithOtherParam` é chamado, além do parâmetro de consulta `my-param`, `some-other-param` com o valor de `other` também será adicionado.

source: when `getFromMethod` is called, in addition to the `my-param` query parameter, `param-from-method` with the value of `test` (because that's what the `withParam` method returns when invoked with `param-from-method`) will also be added.
pt_br: quando `getFromMethod` é chamado, além do parâmetro de consulta `my-param`, `param-from-method` com o valor de `test` (porque é isso que o método `withParam` devolve quando invocado com `param-from-method`) também será adicionado.

source: Note that if an interface method contains an argument annotated with `@QueryParam`, that argument will take priority over anything specified in any `@ClientQueryParam` annotation.
pt_br: Observe que, se um método de interface contiver um argumento anotado com `@QueryParam` , esse argumento terá prioridade sobre qualquer coisa especificada em qualquer anotação `@ClientQueryParam` .

source: Form Parameters
pt_br: Parâmetros do Formulário

source: Form parameters can be specified using `@RestForm` (or `@FormParam`) annotations:
pt_br: Os parâmetros do formulário podem ser especificados utilizando as anotações `@RestForm` (ou `@FormParam`):

source: Using @ClientFormParam
pt_br: Usando @ClientFormParam

source: Form parameters can also be specified using `@ClientFormParam`, similar to `@ClientQueryParam`:
pt_br: Os parâmetros do formulário também podem ser especificados utilizando `@ClientFormParam`, semelhante a `@ClientQueryParam`:

source: Path Parameters
pt_br: Parâmetros do Caminho

source: If the GET request requires path parameters you can leverage the `@PathParam("parameter-name")` annotation instead of (or in addition to) the `@QueryParam`. Path and query parameters can be combined, as required, as illustrated in the example below.
pt_br: Se a requisição GET exigir parâmetros de caminho, você poderá utilizar a anotação `@PathParam("parameter-name")` em vez de (ou além de) `@QueryParam` . Os parâmetros de caminho e de consulta podem ser combinados, conforme necessário, como ilustrado no exemplo abaixo.

source: Create the configuration
pt_br: Crie a configuração

source: In order to determine the base URL to which REST calls will be made, the REST Client uses configuration from `application.properties`. The name of the property needs to follow a certain convention which is best displayed in the following code:
pt_br: Para determinar o URL de base para o qual as chamadas REST serão feitas, o Cliente REST usa a configuração de `application.properties`. O nome da propriedade precisa seguir uma determinada convenção que é melhor exibida no código a seguir:

source: Note that `org.acme.rest.client.ExtensionsService` _must_ match the fully qualified name of the `ExtensionsService` interface we created in the previous section.
pt_br: Note que `org.acme.rest.client.ExtensionsService` _deve_ corresponder ao nome totalmente qualificado da interface `ExtensionsService` que criamos na seção anterior.

source: To facilitate the configuration, you can use the `@RegisterRestClient` `configKey` property that allows to use different configuration root than the fully qualified name of your interface.
pt_br: Para facilitar a configuração, você pode utilizar a propriedade `configKey` de `@RegisterRestClient` que permite utilizar uma raiz de configuração diferente do nome totalmente qualificado da sua interface.

source: Disabling Hostname Verification
pt_br: Desabilitando a Verificação do Nome do Host

source: To disable the SSL hostname verification for a specific REST client, add the following property to your configuration:
pt_br: Para desabilitar a verificação do nome do host SSL para um cliente REST específico, adicione a seguinte propriedade à sua configuração:

source: This setting should not be used in production as it will disable the SSL hostname verification.
pt_br: Esta definição não deve ser utilizada em produção, uma vez que irá desativar a verificação do nome do host SSL.

source: HTTP/2 Support
pt_br: Suporte HTTP/2

source: HTTP/2 is disabled by default in REST Client. If you want to enable it, you can set:
pt_br: O HTTP/2 está desabilitado por padrão no Cliente REST. Se pretende habilitar, pode definir:

source: Alternatively, you can enable the Application-Layer Protocol Negotiation (alpn) TLS extension and the client will negotiate which HTTP version to use over the ones compatible by the server. By default, it will try to use HTTP/2 first and if it's not enabled, it will use HTTP/1.1. If you want to enable it, you can set:
pt_br: Alternativamente, você pode habilitar a extensão TLS de Negociação de Protocolo de Camada de Aplicação (alpn) e o cliente irá determinar qual versão HTTP utilizar, dentre as que são compatíveis com o servidor. Por padrão, ele tentará usar o HTTP/2 primeiro e, se não estiver habilitado, usará o HTTP/1.1. Se você quiser habilitá-lo, você pode definir:

source: Create the Jakarta REST resource
pt_br: Crie o recurso Jakarta REST

source: Create the `src/main/java/org/acme/rest/client/ExtensionsResource.java` file with the following content:
pt_br: Crie o arquivo `src/main/java/org/acme/rest/client/ExtensionsResource.java` com o seguinte conteúdo:

source: There are two interesting parts in this listing:
pt_br: Há duas partes interessantes nesta listagem:

source: the client stub is injected with the `@RestClient` annotation instead of the usual CDI `@Inject`
pt_br: o stub do cliente é injetado com a anotação `@RestClient` em vez da habitual anotação CDI `@Inject`

source: Programmatic client creation with QuarkusRestClientBuilder
pt_br: Criação programática de clientes com o QuarkusRestClientBuilder

source: Instead of annotating the client with `@RegisterRestClient`, and injecting a client with `@RestClient`, you can also create REST Client programmatically. You do that with the `QuarkusRestClientBuilder`.
pt_br: Em vez de anotar o cliente com `@RegisterRestClient` e injetar um cliente com `@RestClient`, você também pode criar um cliente REST de forma programática. Você faz isso com o `QuarkusRestClientBuilder` .

source: With this approach the client interface could look as follows:
pt_br: Com esta abordagem, a interface do cliente poderia ter o seguinte aspecto:

source: And the service as follows:
pt_br: E o serviço é o seguinte:

source: The `QuarkusRestClientBuilder` interface is a Quarkus-specific API to programmatically create clients with additional configuration options. Otherwise, you can also use the `RestClientBuilder` interface from the Microprofile API:
pt_br: A interface `QuarkusRestClientBuilder` é uma API específica do Quarkus para criar programaticamente clientes com opções de configuração adicionais. Caso contrário, você também pode utilizar a interface `RestClientBuilder` da API Microprofile:

source: Use Custom HTTP Options
pt_br: Usar Opções HTTP Personalizadas

source: `quarkus.rest-client.client-prefix.connect-timeout` to configure the connect timeout in milliseconds.
pt_br: `quarkus.rest-client.client-prefix.connect-timeout` para configurar o tempo limite de conexão em milissegundos.

source: `quarkus.rest-client.client-prefix.max-redirects` to limit the number of redirects.
pt_br: `quarkus.rest-client.client-prefix.max-redirects` para limitar o número de redirecionamentos.

source: However, there are many more options within the Vert.x HTTP Client to configure the connections. See all the options in the Vert.x HTTP Client Options API in https://vertx.io/docs/apidocs/io/vertx/core/http/HttpClientOptions.html[this link].
pt_br: No entanto, existem muitas outras opções no Cliente HTTP Vert.x para configurar as conexões. Veja todas as opções na API de Opções do Cliente HTTP Vert.x https://vertx.io/docs/apidocs/io/vertx/core/http/HttpClientOptions.html[neste link].

source: Let's see an example about how to provide the HTTP Client Options via CDI:
pt_br: Vejamos um exemplo de como fornecer as Opções de Cliente HTTP através de CDI:

source: Now, all the REST Clients will be using your custom HTTP Client Options.
pt_br: Agora, todos os Clientes REST usarão suas Opções de Cliente HTTP personalizadas.

source: Another approach is to provide the custom HTTP Client options when creating the client programmatically:
pt_br: Outra abordagem é fornecer as opções do Cliente HTTP personalizadas ao criar o cliente programaticamente:

source: the client will use the registered HTTP Client options over the HTTP Client options provided via CDI if any.
pt_br: o cliente utilizará as opções de Cliente HTTP registradas em vez das opções de Cliente HTTP fornecidas via CDI, se existirem.

source: Redirection
pt_br: Redirecionamento

source: A HTTP server can redirect a response to another location by sending a response with a status code that starts with "3" and a HTTP header "Location" holding the URL to be redirected to. When the REST Client receives a redirection response from a HTTP server, it won't automatically perform another request to the new location. We can enable the automatic redirection in REST Client by adding the "follow-redirects" property:
pt_br: Um servidor HTTP pode redirecionar uma resposta para outra localização, enviando uma resposta com um código de estado que começa por "3" e um cabeçalho HTTP "Location" que contém o URL para onde deve ser redirecionado. Quando o Cliente REST recebe uma resposta de redirecionamento de um servidor HTTP, não efetua automaticamente outra requisição para a nova localização. Podemos ativar o redirecionamento automático no Cliente REST adicionando a propriedade "follow-redirects":

source: `quarkus.rest-client.follow-redirects` to enable redirection for all REST clients.
pt_br: `quarkus.rest-client.follow-redirects` para ativar o redirecionamento para todos os clientes REST.

source: `quarkus.rest-client.<client-prefix>.follow-redirects` to enable redirection for a specific REST client.
pt_br: `quarkus.rest-client.<client-prefix>.follow-redirects` para ativar o redirecionamento para um cliente REST específico.

source: If this property is true, then REST Client will perform a new request that it receives a redirection response from the HTTP server.
pt_br: Se esta propriedade for verdadeira, então o Cliente REST efetuará uma nova requisição quando receber uma resposta de redirecionamento do servidor HTTP.

source: Additionally, we can limit the number of redirections using the property "max-redirects".
pt_br: Além disso, podemos limitar o número de redirecionamentos utilizando a propriedade "max-redirects".

source: One important note is that according to the https://www.rfc-editor.org/rfc/rfc2616#section-10.3.8[RFC2616] specs, by default the redirection will only happen for GET or HEAD methods. However, in REST Client, you can provide your custom redirect handler to enable redirection on POST or PUT methods, or to follow a more complex logic, via either using the `@ClientRedirectHandler` annotation, CDI or programmatically when creating your client.
pt_br: Uma nota importante é que, de acordo com as especificações https://www.rfc-editor.org/rfc/rfc2616#section-10.3.8[RFC2616], por padrão o redirecionamento só ocorrerá para os métodos GET ou HEAD. No entanto, no Cliente REST, você pode fornecer o seu manipulador de redirecionamento personalizado para permitir o redirecionamento nos métodos POST ou PUT, ou para seguir uma lógica mais complexa, utilizando a anotação `@ClientRedirectHandler`, CDI ou programaticamente ao criar o seu cliente.

source: Let's see an example about how to register your own custom redirect handler using the `@ClientRedirectHandler` annotation:
pt_br: Vejamos um exemplo sobre como registrar o seu próprio manipulador de redirecionamento personalizado utilizando a anotação `@ClientRedirectHandler`:

source: The "alwaysRedirect" redirect handler will only be used by the specified REST Client which in this example is the "ExtensionsService" client.
pt_br: O manipulador de redirecionamento "alwaysRedirect" só será utilizado pelo Cliente REST especificado que, neste exemplo, é o cliente "ExtensionsService".

source: Alternatively, you can also provide a custom redirect handler for all your REST Clients via CDI:
pt_br: Alternativamente, você também pode fornecer um manipulador de redirecionamento personalizado para todos os seus Clientes REST através de CDI:

source: Now, all the REST Clients will be using your custom redirect handler.
pt_br: Agora, todos os Clientes REST usarão seu manipulador de redirecionamento personalizado.

source: Another approach is to provide it programmatically when creating the client:
pt_br: Outra abordagem consiste em fornecê-lo programaticamente na criação do cliente:

source: the client will use the registered redirect handler over the redirect handler provided via CDI if any.
pt_br: o cliente utilizará o manipulador de redirecionamento registrado em vez do manipulador de redirecionamento fornecido através do CDI, se existir.

source: Update the test
pt_br: Atualize o teste

source: Next, we need to update the functional test to reflect the changes made to the endpoint. Edit the `src/test/java/org/acme/rest/client/ExtensionsResourceTest.java` file and change the content of the test to:
pt_br: Em seguida, precisamos atualizar o teste funcional para refletir as alterações feitas no endpoint. Edite o arquivo `src/test/java/org/acme/rest/client/ExtensionsResourceTest.java` e altere o conteúdo do teste para:

source: The code above uses link:https://rest-assured.io/[REST Assured]'s link:https://github.com/rest-assured/rest-assured/wiki/GettingStarted#jsonpath[json-path] capabilities.
pt_br: O código acima utiliza as capacidades link:https://github.com/rest-assured/rest-assured/wiki/GettingStarted#jsonpath[json-path] do link:https://rest-assured.io/[REST Assured].

source: Async Support
pt_br: Suporte Assíncrono

source: Open the `src/main/java/org/acme/rest/client/ExtensionsResource.java` file and update it with the following content:
pt_br: Abra o arquivo `src/main/java/org/acme/rest/client/ExtensionsResource.java` e atualize-o com o seguinte conteúdo:

source: To test asynchronous methods, add the test method below in `ExtensionsResourceTest`:
pt_br: Para testar métodos assíncronos, adicione o método de teste abaixo em `ExtensionsResourceTest`:

source: The `Uni` version is very similar:
pt_br: A versão `Uni` é muito semelhante:

source: The `ExtensionsResource` becomes:
pt_br: O `ExtensionsResource` torna-se:

source: The previous snippet uses Mutiny reactive types. If you are not familiar with Mutiny, check xref:mutiny-primer.adoc[Mutiny - an intuitive reactive programming library].
pt_br: O código anterior usa tipos reativos do Mutiny. Se você não estiver familiarizado com o Mutiny, consulte xref:mutiny-primer.adoc[Mutiny - uma biblioteca de programação reativa intuitiva] .

source: When returning a `Uni`, every _subscription_ invokes the remote service. It means you can re-send the request by re-subscribing on the `Uni`, or use a `retry` as follows:
pt_br: Ao retornar um `Uni` , cada _assinatura_ invoca o serviço remoto. Isso significa que você pode reenviar a requisição assinando novamente o `Uni` , ou usar um `retry` da seguinte forma:

source: If you use a `CompletionStage`, you would need to call the service's method to retry. This difference comes from the laziness aspect of Mutiny and its subscription protocol. More details about this can be found in https://smallrye.io/smallrye-mutiny/latest/reference/uni-and-multi/[the Mutiny documentation].
pt_br: Se você usar um `CompletionStage` , precisará chamar o método do serviço para tentar novamente. Essa diferença vem do aspecto preguiçoso do Mutiny e de seu protocolo de assinatura. Mais detalhes sobre isso podem ser encontrados na https://smallrye.io/smallrye-mutiny/latest/reference/uni-and-multi/[documentação do Mutiny] .

source: Server-Sent Event (SSE) support
pt_br: Suporte a Eventos Enviados pelo Servidor (SSE)

source: Consuming SSE events is possible simply by declaring the result type as a `io.smallrye.mutiny.Multi`.
pt_br: O consumo de eventos SSE é possível simplesmente declarando o tipo de resultado como um `io.smallrye.mutiny.Multi` .

source: The simplest example is:
pt_br: O exemplo mais simples é:

source: All the IO involved in streaming the SSE results is done in a non-blocking manner.
pt_br: Toda a E/S envolvida no streaming dos resultados do SSE é feita de forma não blocante.

source: Results are not limited to strings - for example when the server returns JSON payload for each event, Quarkus automatically deserializes it into the generic type used in the `Multi`.
pt_br: Os resultados não se limitam a strings - por exemplo, quando o servidor retorna um payload JSON para cada evento, o Quarkus a desserializa automaticamente para o tipo genérico usado no `Multi` .
