Repository: quarkusio/pt.quarkus.io
Catalog: l10n/po/*/_versions/3.15/guides/rest-client.adoc.po
Languages: pt_br

source: Users can also access the entire SSE event by using the `org.jboss.resteasy.reactive.client.SseEvent` type.
pt_br: Os usuários também podem acessar todo o evento SSE usando o tipo `org.jboss.resteasy.reactive.client.SseEvent` .

source: A simple example where the event payloads are `Long` values is the following:
pt_br: Um exemplo simples em que os payloads do evento são valores `Long` é o seguinte:

source: Filtering out events
pt_br: Filtrando eventos

source: On occasion, the stream of SSE events may contain some events that should not be returned by the client - an example of this is having the server send heartbeat events in order to keep the underlying TCP connection open. The REST Client supports filtering out such events by providing the `@org.jboss.resteasy.reactive.client.SseEventFilter`.
pt_br: Ocasionalmente, o fluxo de eventos SSE pode conter alguns eventos que não devem ser retornados pelo cliente - um exemplo disso é fazer com que o servidor envie eventos de batimento cardíaco para manter aberta a conexão TCP subjacente. O Cliente REST oferece suporte à filtragem desses eventos, fornecendo o `@org.jboss.resteasy.reactive.client.SseEventFilter` .

source: Here is an example of filtering out heartbeat events:
pt_br: Aqui está um exemplo de filtragem de eventos de batimento cardíaco:

source: Custom headers support
pt_br: Suporte para cabeçalhos personalizados

source: There are a few ways in which you can specify custom headers for your REST calls:
pt_br: Existem algumas formas de especificar cabeçalhos personalizados para as suas chamadas REST:

source: by registering a `ClientHeadersFactory` or a `ReactiveClientHeadersFactory` with the `@RegisterClientHeaders` annotation
pt_br: registrando um `ClientHeadersFactory` ou um `ReactiveClientHeadersFactory` com a anotação `@RegisterClientHeaders`

source: by programmatically registering a `ClientHeadersFactory` or a `ReactiveClientHeadersFactory` with the `QuarkusRestClientBuilder.clientHeadersFactory(factory)` method
pt_br: registrando programaticamente um `ClientHeadersFactory` ou um `ReactiveClientHeadersFactory` com o método `QuarkusRestClientBuilder.clientHeadersFactory(factory)`

source: by specifying the value of the header with `@ClientHeaderParam`
pt_br: especificando o valor do cabeçalho com `@ClientHeaderParam`

source: by specifying the value of the header by `@HeaderParam`
pt_br: especificando o valor do cabeçalho por `@HeaderParam`

source: The code below demonstrates how to use each of these techniques:
pt_br: O código abaixo demonstra como utilizar cada uma destas técnicas:

source: There can be only one `ClientHeadersFactory` per class. With it, you can not only add custom headers, but you can also transform existing ones. See the `RequestUUIDHeaderFactory` class below for an example of the factory.
pt_br: Só pode haver um `ClientHeadersFactory` por classe. Com ela, é possível não só adicionar cabeçalhos personalizados, mas também transformar os existentes. Veja a classe `RequestUUIDHeaderFactory` abaixo para um exemplo da fábrica.

source: `@ClientHeaderParam` can be used on the client interface and on methods. It can specify a constant header value...
pt_br: `@ClientHeaderParam` pode ser utilizado na interface do cliente e nos métodos. Pode especificar um valor de cabeçalho constante...

source: ... and a name of a method that should compute the value of the header. It can either be a static method or a default method in this interface. The method can take either no parameters, a single String parameter or a single `io.quarkus.rest.client.reactive.ComputedParamContext` parameter (which is very useful for code that needs to compute headers based on method parameters and naturally complements `@io.quarkus.rest.client.reactive.NotBody`).
pt_br: ... e um nome de um método que deve calcular o valor do cabeçalho. Pode ser um método estático ou um método padrão nesta interface. O método pode não receber nenhum parâmetro, um único parâmetro String ou um único parâmetro `io.quarkus.rest.client.reactive.ComputedParamContext` (que é muito útil para código que precisa calcular cabeçalhos com base em parâmetros de métodos e complementa naturalmente `@io.quarkus.rest.client.reactive.NotBody`).

source: ... as well as a value from your application's configuration
pt_br: ... bem como um valor da configuração da sua aplicação

source: ... or even any mixture of verbatim text, method parameters (referenced by name), a configuration value (as mentioned previously) and method invocations (as mentioned before)
pt_br: ... ou mesmo qualquer mistura de texto literal, parâmetros de métodos (referenciados pelo nome), um valor de configuração (como mencionado anteriormente) e invocações de métodos (como mencionado anteriormente)

source: ... or as a normal Jakarta REST `@HeaderParam` annotated argument
pt_br: ... ou como um argumento anotado do Jakarta REST `@HeaderParam` normal

source: When using Kotlin, if default methods are going to be leveraged, then the Kotlin compiler needs to be configured to use Java's default interface capabilities. See link:https://kotlinlang.org/docs/java-to-kotlin-interop.html#default-methods-in-interfaces[this] for more details.
pt_br: Ao usar o Kotlin, se os métodos padrão forem aproveitados, o compilador do Kotlin precisará ser configurado para usar os recursos de interface padrão do Java. Veja link:https://kotlinlang.org/docs/java-to-kotlin-interop.html#default-methods-in-interfaces[isso] para obter mais detalhes.

source: A `ClientHeadersFactory` can look as follows:
pt_br: Um `ClientHeadersFactory` pode ter o seguinte aspecto:

source: As you see in the example above, you can make your `ClientHeadersFactory` implementation a CDI bean by annotating it with a scope-defining annotation, such as `@Singleton`, `@ApplicationScoped`, etc.
pt_br: Como você vê no exemplo acima, é possível tornar a implementação do `ClientHeadersFactory` um bean CDI anotando-o com uma anotação de definição de escopo, como `@Singleton` , `@ApplicationScoped` , etc.

source: To specify a value for `${header.value}`, simply put the following in your `application.properties`:
pt_br: Para especificar um valor para `${header.value}`, basta colocar o seguinte no seu `application.properties`:

source: Also, there is a reactive flavor of `ClientHeadersFactory` that allows doing blocking operations. For example:
pt_br: Além disso, existe uma variante reativa de `ClientHeadersFactory` que permite realizar operações blocantes. Por exemplo:

source: Default header factory
pt_br: Fábrica de cabeçalhos padrão

source: The `@RegisterClientHeaders` annotation can also be used without any custom factory specified. In that case the `DefaultClientHeadersFactoryImpl` factory will be used. If you make a REST client call from a REST resource, this factory will propagate all the headers listed in `org.eclipse.microprofile.rest.client.propagateHeaders` configuration property from the resource request to the client request. Individual header names are comma-separated.
pt_br: A anotação `@RegisterClientHeaders` também pode ser usada sem nenhuma fábrica personalizada especificada. Nesse caso, será usada a fábrica `DefaultClientHeadersFactoryImpl` . Se você fizer uma chamada de cliente REST a partir de um recurso REST, essa fábrica propagará todos os cabeçalhos listados na propriedade de configuração `org.eclipse.microprofile.rest.client.propagateHeaders` da requisição do recurso para a requisição do cliente. Os nomes dos cabeçalhos individuais são separados por vírgulas.

source: Customizing the request
pt_br: Personalização da requisição

source: A simple example of customizing the request would be to add a custom header:
pt_br: Um exemplo simples de personalização da requisição seria adicionar um cabeçalho personalizado:

source: Next, you can register your filter using the `@RegisterProvider` annotation:
pt_br: Em seguida, pode registrar o seu filtro utilizando a anotação `@RegisterProvider`:

source: Or programmatically using the `.register()` method:
pt_br: Ou programaticamente, utilizando o método `.register()`:

source: Injecting the `jakarta.ws.rs.ext.Providers` instance in filters
pt_br: Injetando a instância `jakarta.ws.rs.ext.Providers` em filtros

source: The `jakarta.ws.rs.ext.Providers` is useful when we need to lookup the provider instances of the current client.
pt_br: O `jakarta.ws.rs.ext.Providers` é útil quando precisamos procurar as instâncias do fornecedor do cliente atual.

source: We can get the `Providers` instance in our filters from the request context as follows:
pt_br: Podemos obter a instância `Providers` nos nossos filtros a partir do contexto do requisição da seguinte forma:

source: Alternatively, you can implement the `ResteasyReactiveClientRequestFilter` interface instead of the `ClientRequestFilter` interface that will directly provide the `ResteasyReactiveClientRequestContext` context:
pt_br: Alternativamente, pode implementar a interface `ResteasyReactiveClientRequestFilter` em vez da interface `ClientRequestFilter`, que fornecerá diretamente o contexto `ResteasyReactiveClientRequestContext`:

source: The method must be annotated with `@ClientObjectMapper`.
pt_br: O método deve ser anotado com `@ClientObjectMapper`.

source: It's must be a static method. Also, the parameter `defaultObjectMapper` will be resolved via CDI. If not found, it will throw an exception at runtime.
pt_br: Tem que ser um método estático. Além disso, o parâmetro `defaultObjectMapper` será resolvido através do CDI. Se não for encontrado, será lançada uma exceção em tempo de execução.

source: In this example, we're creating a copy of the default object mapper. You should *NEVER* modify the default object mapper, but create a copy instead.
pt_br: Neste exemplo, estamos criando uma cópia do mapeador de objetos padrão. Você *NUNCA* deve modificar o mapeador de objetos padrão, mas sim criar uma cópia.

source: Exception handling
pt_br: Tratamento de exceções

source: The MicroProfile REST Client specification introduces the `org.eclipse.microprofile.rest.client.ext.ResponseExceptionMapper` whose purpose is to convert an HTTP response to an exception.
pt_br: A especificação do Cliente REST MicroProfile introduz o `org.eclipse.microprofile.rest.client.ext.ResponseExceptionMapper`, cujo objetivo é converter uma resposta HTTP numa exceção.

source: A simple example of implementing such a `ResponseExceptionMapper` for the `ExtensionsService` discussed above, could be:
pt_br: Um exemplo simples de implementação de tal `ResponseExceptionMapper` para o `ExtensionsService` discutido acima, poderia ser:

source: `ResponseExceptionMapper` also defines the `getPriority` method which is used in order to determine the priority with which `ResponseExceptionMapper` implementations will be called (implementations with a lower value for `getPriority` will be invoked first). If `toThrowable` returns an exception, then that exception will be thrown. If `null` is returned, the next implementation of `ResponseExceptionMapper` in the chain will be called (if there is any).
pt_br: `ResponseExceptionMapper` também define o método `getPriority` , que é usado para determinar a prioridade com que as implementações de `ResponseExceptionMapper` serão chamadas (as implementações com um valor menor para `getPriority` serão chamadas primeiro). Se `toThrowable` retornar uma exceção, essa exceção será lançada. Se `null` for retornado, a próxima implementação de `ResponseExceptionMapper` na cadeia será chamada (se houver alguma).

source: Using @ClientExceptionMapper
pt_br: Usando @ClientExceptionMapper

source: A simpler way to convert HTTP response codes of 400 or above is to use the `@ClientExceptionMapper` annotation.
pt_br: Uma forma mais simples de converter códigos de resposta HTTP de 400 pra cima é utilizar a anotação `@ClientExceptionMapper`.

source: For the `ExtensionsService` REST Client interface defined above, an example use of `@ClientExceptionMapper` would be:
pt_br: Para a interface de Cliente REST `ExtensionsService` definida acima, um exemplo de utilização de `@ClientExceptionMapper` seria:

source: Naturally this handling is per REST Client. `@ClientExceptionMapper` uses the default priority if the `priority` attribute is not set and the normal rules of invoking all handlers in turn apply.
pt_br: Naturalmente, este tratamento é efetuado por Cliente REST. `@ClientExceptionMapper` utiliza a prioridade predefinida se o atributo `priority` não estiver definido e aplicam-se as regras normais de invocação de todos os manipuladores sucessivamente.

source: Methods annotated with `@ClientExceptionMapper` can also take a `java.lang.reflect.Method` parameter which is useful if the exception mapping code needs to know the REST Client method that was invoked and caused the exception mapping code to engage.
pt_br: Os métodos anotados com `@ClientExceptionMapper` também podem receber um parâmetro `java.lang.reflect.Method`, o que é útil se o código de mapeamento de exceções precisar conhecer o método do Cliente REST que foi invocado e causou a ativação do código de mapeamento de exceções.

source: Using @Blocking annotation in exception mappers
pt_br: Usando a anotação @Blocking em mapeadores de exceções

source: In cases that warrant using `InputStream` as the return type of REST Client method (such as when large amounts of data need to be read):
pt_br: Em casos que justifiquem a utilização de `InputStream` como tipo de retorno do método do Cliente REST (por exemplo, quando é necessário ler grandes quantidades de dados):

source: This will work as expected, but if you try to read this InputStream object in a custom exception mapper, you will receive a `BlockingNotAllowedException` exception. This is because `ResponseExceptionMapper` classes are run on the Event Loop thread executor by default - which does not allow to perform IO operations.
pt_br: Isso funcionará como esperado, mas se você tentar ler esse objeto InputStream em um mapeador de exceções personalizado, receberá uma exceção `BlockingNotAllowedException`. Isso ocorre porque as classes `ResponseExceptionMapper` são executadas no executor de thread do Loop de Eventos por padrão - o que não permite realizar operações de E/S.

source: To make your exception mapper blocking, you can annotate the exception mapper with the `@Blocking` annotation:
pt_br: Para tornar o seu mapeador de exceções blocante, pode anotar o mapeador de exceções com a anotação `@Blocking`:

source: With the `@Blocking` annotation, the MyResponseExceptionMapper exception mapper will be executed in the worker thread pool.
pt_br: Com a anotação `@Blocking`, o mapeador de exceções MyResponseExceptionMapper será executado no pool de threads de trabalho.

source: Reading the entity is now allowed because we're executing the mapper on the worker thread pool.
pt_br: A leitura da entidade é agora permitida porque estamos executando o mapeador no pool de threads de trabalho.

source: Note that you can also use the `@Blocking` annotation when using @ClientExceptionMapper:
pt_br: Note que também pode utilizar a anotação `@Blocking` quando utilizar @ClientExceptionMapper:

source: Multipart Form support
pt_br: Suporte a Formulários Multi-partes

source: Sending Multipart messages
pt_br: Enviando Mensagens Multi-partes

source: To send data as a multipart form, you can just use the regular `@RestForm` (or `@FormParam`) annotations:
pt_br: Para enviar dados como um formulário multi-partes, você pode simplesmente utilizar as anotações normais `@RestForm` (ou `@FormParam`):

source: Naturally, you can also group these parameters into a containing class:
pt_br: Naturalmente, também é possível agrupar estes parâmetros numa classe que os contenha:

source: If there are `@RestForm` parameters that are not multipart-implying, then `@Consumes(MediaType.APPLICATION_FORM_URLENCODED)` is implied.
pt_br: Se houver parâmetros @RestForm que não implicam em multi-parte, então @Consumes(MediaType.APPLICATION_FORM_URLENCODED) estará implícito.

source: You can also send JSON multiparts by specifying the `@PartType` annotation:
pt_br: Você também pode enviar multi-partes JSON especificando a anotação `@PartType`:

source: Receiving Multipart Messages
pt_br: Recebendo Mensagens Multi-partes

source: uses the shorthand `@RestForm` annotation to make a field as a part of a multipart form
pt_br: utiliza a anotação abreviada `@RestForm` para criar um campo como parte de um formulário multi-partes

source: the standard `@FormParam` can also be used. It allows to override the name of the multipart part.
pt_br: a norma `@FormParam` também pode ser utilizada. Permite substituir o nome da parte multi-partes.

source: Then, create an interface method that corresponds to the call and make it return the `FormDto`:
pt_br: Em seguida, crie um método de interface que corresponda à chamada e faça-o devolver o `FormDto`:

source: At the moment, multipart response support is subject to the following limitations:
pt_br: Atualmente, o suporte de respostas multi-partes está sujeito às seguintes limitações:

source: files sent in multipart responses can only be parsed to `File`, `Path` and `FileDownload`
pt_br: os arquivos enviados em respostas multi-partes só podem ser analisados em `File`, `Path` e `FileDownload`

source: each field of the response type has to be annotated with `@PartType` - fields without this annotation are ignored
pt_br: cada campo do tipo de resposta tem de ser anotado com `@PartType` - os campos sem esta anotação são ignorados

source: The files you download are not automatically removed and can take up a lot of disk space. Consider removing the files when you are done working with them.
pt_br: Os arquivos que você baixa não são removidos automaticamente e podem ocupar muito espaço no disco. Considere a remoção dos arquivos quando terminar de trabalhar com eles.

source: Multipart mixed / OData usage
pt_br: Utilização de multi-partes mistas / OData

source: It is not uncommon that an application has to interact with enterprise systems (like CRM systems) using a special protocol called https://www.odata.org/documentation/odata-version-3-0/batch-processing/[OData]. This protocol essentially uses a custom HTTP `Content-Type` which needs some glue code to work with the REST Client (creating the body is entirely up to the application - the REST Client can't do much to help).
pt_br: Não é incomum que um aplicativo precise interagir com sistemas corporativos (como sistemas de CRM) usando um protocolo especial chamado https://www.odata.org/documentation/odata-version-3-0/batch-processing/[OData] . Esse protocolo usa essencialmente um `Content-Type` HTTP personalizado que precisa de algum código de cola para funcionar com o Cliente REST (a criação do corpo depende inteiramente da aplicação - o Cliente REST não pode fazer muito para ajudar).

source: An example looks like the following:
pt_br: Um exemplo é o seguinte:

source: The code uses the following pieces:
pt_br: O código utiliza os seguintes elementos:

source: `@ClientHeaderParam(name = "Content-Type", value = "{calculateContentType}")` which ensures that the `Content-Type` header is created by calling the interface's `calculateContentType` default method.
pt_br: `@ClientHeaderParam(name = "Content-Type", value = "{calculateContentType}")` que garante que o cabeçalho `Content-Type` é criado chamando o método padrão `calculateContentType` da interface.

source: The aforementioned parameter needs to be annotated with `@NotBody` because it is only used to aid the construction of HTTP headers.
pt_br: O parâmetro acima mencionado precisa de ser anotado com `@NotBody` porque só é utilizado para ajudar na construção de cabeçalhos HTTP.

source: `context.methodParameters().get(1).value()` which allows the `calculateContentType` method to obtain the proper method parameter passed to the REST Client method.
pt_br: `context.methodParameters().get(1).value()` que permite que o método `calculateContentType` obtenha o parâmetro de método correto passado para o método do Cliente REST.

source: As previously mentioned, the body parameter needs to be properly crafted by the application code to conform to the service's requirements.
pt_br: Tal como referido anteriormente, o parâmetro do corpo tem de ser corretamente elaborado pelo código da aplicação para estar em conformidade com os requisitos do serviço.

source: Receiving compressed messages
pt_br: Recebendo mensagens comprimidas

source: Proxy support
pt_br: Suporte de proxy

source: global client proxy settings, with `quarkus.rest-client.proxy-address`, `quarkus.rest-client.proxy-user`, `quarkus.rest-client.proxy-password`, `quarkus.rest-client.non-proxy-hosts`
pt_br: definições globais de proxy de cliente, com `quarkus.rest-client.proxy-address`, `quarkus.rest-client.proxy-user`, `quarkus.rest-client.proxy-password`, `quarkus.rest-client.non-proxy-hosts`

source: per-client proxy settings, with `quarkus.rest-client.<my-client>.proxy-address`, etc. These are applied only to clients injected with CDI, that is the ones created with `@RegisterRestClient`
pt_br: definições de proxy por cliente, com `quarkus.rest-client.<my-client>.proxy-address`, etc. Estas são aplicadas apenas a clientes injetados com CDI, ou seja, os criados com `@RegisterRestClient`

source: If `proxy-address` is set on the client level, the client uses its specific proxy settings. No proxy settings are propagated from the global configuration or JVM properties.
pt_br: Se `proxy-address` estiver definido no nível do cliente, o cliente utiliza as suas definições de proxy específicas. Nenhuma definição de proxy é propagada a partir da configuração global ou das propriedades da JVM.

source: If `proxy-address` is not set for the client but is set on the global level, the client uses the global settings. Otherwise, the client uses the JVM settings.
pt_br: Se `proxy-address` não estiver definido para o cliente, mas estiver definido no nível global, o cliente usará as configurações globais. Caso contrário, o cliente usará as configurações da JVM.

source: An example configuration for setting proxy:
pt_br: Um exemplo de configuração para definir o proxy:

source: MicroProfile REST Client specification does not allow setting proxy credentials. In order to specify proxy user and proxy password programmatically, you need to cast your `RestClientBuilder` to `RestClientBuilderImpl`.
pt_br: A especificação do Cliente REST MicroProfile não permite a definição de credenciais de proxy. Para especificar o usuário e a senha do proxy de forma programática, é necessário enviar o seu `RestClientBuilder` para `RestClientBuilderImpl`.

source: Package and run the application
pt_br: Empacote e execute a aplicação

source: Run the application with:
pt_br: Execute a aplicação com:

source: You should see a JSON object containing some basic information about this extension.
pt_br: Você deve ver um objeto JSON que contém algumas informações básicas sobre esta extensão.

source: As usual, the application can be packaged using:
pt_br: Como de costume, a aplicação pode ser empacotada utilizando:

source: And executed with `java -jar target/quarkus-app/quarkus-run.jar`.
pt_br: E executado com `java -jar target/quarkus-app/quarkus-run.jar`.

source: You can also generate the native executable with:
pt_br: Também é possível gerar o executável nativo com:

source: Logging traffic
pt_br: Registrando tráfego

source: `request-response` to log the request and response contents, or
pt_br: `request-response` para registrar o conteúdo da requisição e da resposta, ou

source: `all` to also enable low level logging of the underlying libraries.
pt_br: `all` para permitir também o registro de baixo nível das bibliotecas subjacentes.
