Repository: quarkusio/pt.quarkus.io
Catalog: l10n/po/*/_versions/3.15/guides/security-identity-providers.adoc.po
Languages: pt_br

source: `IdentityProvider` converts the authentication credentials provided by `HttpAuthenticationMechanism` to a `SecurityIdentity` instance.
pt_br: `IdentityProvider` converte as credenciais de autenticação fornecidas por `HttpAuthenticationMechanism` para uma instância `SecurityIdentity`.

source: If you use Basic or form-based authentication, you must add an `IdentityProvider` instance to convert a username and password to a `SecurityIdentity` instance.
pt_br: Se você utilizar a Basic ou form-based, você precisará adicionar uma instãncia `IdentityProvider` para converter um username e um password em uma instância `SecurityIdentity`.

source: To get started with security in Quarkus, consider combining the Quarkus built-in Basic HTTP authentication with the Jakarta Persistence identity provider to enable role-based access control (RBAC).
pt_br: Para começar a utilizar o security no Quarkus, considere a possibilidade de combinar a autenticação HTTP básica integrada no Quarkus com o Jakarta Persistence identity provider para permitir o role-based access control(RBAC).

source: For more information about Basic authentication, its mechanisms, and related identity providers, see the following resources:
pt_br: Para obter mais informações sobre a autenticação básica, os seus mecanismos e os identity providers relacionados, consulte os seguintes recursos:

source: xref:security-jpa.adoc[Quarkus Security with Jakarta Persistence]
pt_br: link:security-jpa.html[Quarkus Security com Jakarta Persistence]

source: xref:security-getting-started-tutorial.adoc[Getting started with Security by using Basic authentication and Jakarta Persistence]
pt_br: xref:security-getting-started-tutorial.adoc[Começando com Security usando a Basic authentication e o Jakarta Persistence]

source: xref:security-authentication-mechanisms.adoc#form-auth[Form-based authentication]
pt_br: link:security-authentication-mechanisms.html#form-auth[Autenticação baseada em formulários]

source: xref:security-jdbc.adoc[Using security with JDBC]
pt_br: link:security-jdbc.html[Utilizar o security com JDBC]

source: xref:security-ldap.adoc[Using security with an LDAP realm]
pt_br: link:security-ldap.html[Utilizar o security com um domínio LDAP]

source: xref:security-overview.adoc[Quarkus Security overview]
pt_br: xref:security-overview.adoc[Visão geral do Quarkus Security]
