Repository: quarkusio/pt.quarkus.io
Catalog: l10n/po/*/_versions/3.15/guides/security-vulnerability-detection.adoc.po
Languages: pt_br

source: Security vulnerability detection and reporting in Quarkus
pt_br: Detecção e relatório de vulnerabilidades de segurança no Quarkus

source: To view the registered Quarkus CPE names in the US NVD, use the following search URL:
pt_br: Para visualizar os nomes registrados do Quarkus CPE no NVD dos EUA, use o seguinte URL de pesquisa:

source: If the NVD database flags a CVE against a Quarkus tag, a link that provides more details about the CVE is added to the given CPE name entry.
pt_br: Se o banco de dados NVD sinalizar um CVE em relação a uma tag Quarkus, um link que fornece mais informações sobre o CVE será adicionado à entrada do nome do CPE em questão.

source: The NVD CPE team updates the list regularly, but if you encounter a false positive, report the details by creating an issue in the link:https://github.com/quarkusio/quarkus/issues/2611[quarkusio] repository.
pt_br: A equipe do NVD CPE atualiza a lista regularmente, mas se você encontrar um falso positivo, comunique os detalhes criando um problema no repositório link:https://github.com/quarkusio/quarkus/issues/2611[quarkusio] .

source: You can detect the vulnerabilities at the application build time with an NVD feed by using the Maven link:https://jeremylong.github.io/DependencyCheck/dependency-check-maven/[OWASP Dependency-check-maven plugin].
pt_br: Você pode detectar as vulnerabilidades no momento da construção do aplicativo com um feed NVD usando o link:https://jeremylong.github.io/DependencyCheck/dependency-check-maven/[plug-in] Maven link:https://jeremylong.github.io/DependencyCheck/dependency-check-maven/[OWASP Dependency-check-maven] .

source: To add the Open Worldwide Application Security Project (OWASP) Dependency-check-maven plugin to your Quarkus Maven project, add the following XML configuration to the `pom.xml` file:
pt_br: Para adicionar o plug-in OWASP (Open Worldwide Application Security Project) Dependency-check-maven ao seu projeto Quarkus Maven, adicione a seguinte configuração XML ao arquivo `pom.xml` :

source: Set the `owasp-dependency-check-plugin.version` value to `8.3.1` or later.
pt_br: Defina o valor de `owasp-dependency-check-plugin.version` para `8.3.1` ou posterior.

source: Next, configure the plugin as follows:
pt_br: Em seguida, configure o plug-in da seguinte forma:

source: To detect less severe issues, adjust the value of `failBuildOnCVSS` to suppress the false positives, as demonstrated in the following code sample:
pt_br: Para detectar problemas menos graves, ajuste o valor de `failBuildOnCVSS` para suprimir os falsos positivos, conforme demonstrado no exemplo de código a seguir:

source: Ensure that you review and update the suppression list regularly to ensure that the results are up to date. You can optionally apply a time limit to individual suppressions by adding an expiry attribute, as outlined in the following example:
pt_br: Certifique-se de revisar e atualizar a lista de supressão regularmente para garantir que os resultados estejam atualizados. Opcionalmente, você pode aplicar um limite de tempo a supressões individuais adicionando um atributo de expiração, conforme descrito no exemplo a seguir:

source: You can adjust the expiry date if you need to.
pt_br: Você pode ajustar a data de expiração, se necessário.

source: References
pt_br: Referências

source: xref:security-overview.adoc[Quarkus Security overview]
pt_br: xref:security-overview.adoc[Visão geral do Quarkus Security]

source: xref:security-authentication-mechanisms.adoc[Authentication mechanisms in Quarkus]
pt_br: xref:security-authentication-mechanisms.adoc[Mecanismos de autenticação no Quarkus]
